/*
 ZEVMS冒险岛(079)游戏服务端
 道具制作
 */
var 卷轴 = [
    /*************
     手套
     *************/
2044902,
2044809,
2044802,
2044702,
2044602,
2044502,
2044414,
2044402,
2044314,
2044302,
2044214,
2044202,
2044114,
2044102,
2044014,
2044002,
2043802,
2043702,
2043302,
2043214,
2043202,
2043114,
2043102,
2043019,
2043008,
2043002,
2041206,
2041201,
2041023,
2041020,
2041017,
2041014,
2041011,
2041008,
2041005,
2041002,
2040933,
2040928,
2040925,
2040920,
2040915,
2040902,
2040825,
2040816,
2040805,
2040802,
2040702,
2040627,
2040622,
2040612,
2040534,
2040517,
2040514,
2040502,
2040427,
2040419,
2040412,
2040323,
2040318,
2040302,
2040205,
2040200,
2040105,
2040100,
2040031,
2040031,
2040016,
2040005,
2040002,




    //
];
//说明文字
var 说明文字 = "   hi #b#h ##k 请选择你要的卷轴吧\r\n选择后是不能反悔的哦，#r进入此页面后请勿不选择#k，箱子已经被消耗。";


var status = -1;
var sels;

function start() {
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == 1) {
        status++;
    } else if (mode == 0) {
        status--;
    } else {
        cm.对话结束();
        return;
    }
    if (status == 0) {
        var 文本信息 = "";
        for (var i = 0; i < 卷轴.length; i++) {
            文本信息 += "#b#L" + i + "#";
            文本信息 += "#i" + 卷轴[i] + "##z" + 卷轴[i] + "##l#k\r\n";
         
        }

        cm.sendSimple("" + 说明文字 + "\r\n" + 文本信息 + "");
    } else if (status == 1) {
        sels = selection;
        cm.gainItem(卷轴[sels], 1);
	//	cm.haveItem(2022466)
        cm.gainItem(2022523, -1);
        cm.说明文字("恭喜你获得 " + cm.显示物品(卷轴[sels]) + "");
		cm.全服黄色喇叭("[卷轴自选] : 土豪玩家 "+cm.getPlayer().getName()+" 选中一张10%卷轴")
		//cm.输出记录("礼包兑换记录/重生套装兑换记录.txt",""+cm.时间()+" : "+cm.getChar().getName()+" 兑换了 "+cm.getItemName(装备[sels])+" \r\n");
        cm.对话结束();
    } else {
        cm.说明文字("#r发生错误: mode : " + mode + " 脚本执行 : " + status);
        cm.对话结束();
    }
}