/*
 ZEVMS冒险岛(079)游戏服务端
 */
//母矿，数量，金币，成品
var 合成表 = [
	[4010007, 10, 80000, 4011008],
	[4010004, 10, 80000, 4011004],
	[4010006, 10, 80000, 4011006],
    [4010000, 10, 80000, 4011000],
    [4010001, 10, 80000, 4011001],
    [4010002, 10, 80000, 4011002],
	[4010003, 10, 80000, 4011003],
	[4010005, 10, 80000, 4011005]

];

var sels;
var 记录;
var 脚本执行 = -1;

function start() {
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == 1) {
        脚本执行++;
    } else if (mode == 0) {
        脚本执行--;
    } else {
        cm.对话结束();
        return;
    }
    if (脚本执行 == 0) {
        var 文本信息 = "";
        for (var i = 0; i < 合成表.length; i++) {
            文本信息 += "#L" + i + "#";
            文本信息 += "#r#z" + 合成表[i][0] + "##k x #b" + 合成表[i][1] + "#k   #b￥" + 合成表[i][2] + "#k   =   #r#z" + 合成表[i][3] + "##l#k\r\n";
        }
        cm.sendSimple("  提示：#d鼠标放置在物品名称上会显示详细信息：#k\r\n\r\n" + 文本信息 + "");
    } else if (脚本执行 == 1) {
        sels = selection;
        i = selection;
		if (cm.判断背包其他栏().isFull()) {
            cm.sendNext("背包其他栏空间不足。");
            cm.dispose();
            return;
        }
        if (!cm.haveItem(合成表[i][0], 合成表[i][1])) {
            cm.说明文字(" 需要 #b#i" + 合成表[i][0] + "# #t" + 合成表[i][0] + "##k #r" + 合成表[i][1] + "#k 个。");
            cm.对话结束();
			return;
        }
		if (cm.判断金币()<合成表[i][2]) {
            cm.说明文字(" 需要 #b"+合成表[i][2]+"#k 金币。");
            cm.对话结束();
			return;
        }
		cm.收金币(合成表[i][2]);
        cm.收物品(合成表[i][0], 合成表[i][1]);
        cm.给物品(合成表[sels][3], 1);
        cm.说明文字(" 制作完成 #b#i" + 合成表[i][3] + "##k #r#t" + 合成表[i][3] + "#。");
        cm.对话结束();
    }
}