var status = -1;

function action(mode, type, selection) {
    if (cm.getOneTimeLog("新手礼包") < 1 && cm.canHold(1472149,1)&&cm.canHold(1332005,1)&&cm.canHold(1372013,1)&&cm.canHold(1332007,1)) {
        cm.setOneTimeLog("新手礼包");
        cm.gainPet(5000006, "新手小雪犬", 1, 0, 100, 0, 119);//新手宠物 90天 (宠物)
        cm.给予道具(1472149,30,30,30,30,0,0,30,30,0,0,0,0,0,0,0,0,0,0,1);
        cm.给予道具(1332005,30,30,30,30,0,0,30,30,0,0,0,0,0,0,0,0,0,0,1);
        cm.给予道具(1372013,30,30,30,30,0,0,30,30,0,0,0,0,0,0,0,0,0,0,1);
        cm.给予道具(1332007,30,30,30,30,0,0,30,30,0,0,0,0,0,0,0,0,0,0,1);
        cm.gainMeso(+100000); //加减金币	
        cm.gainItem(2120000, 200);
        cm.sendOk("领取新手礼包，请善待它哦。");
        cm.dispose();
    } else {
        cm.sendOk("您有足够的背包空间吗？或者您已领取过新手礼包。");
        cm.dispose();
    }
}