/* global cm */

var status = -1;
var select = -1;

function start() {
    cm.sendOk(
            "\t\t #i3994014##i3994018##i3994070##i3994061##i3994005##i3991038##i3991004#\r\n" +
            //"\t  #i3994060##i3994079##i3994060##i3994060##i3994070##i3994063##i3994071##i3994077#\r\n" +
            //"    #d此为泡泡谷指令整合区，有什么需要我替您服务吗?#k\r\n" +
            "#b@清除道具 <装备栏/消耗栏/装饰栏/其他栏/特殊栏><开始格数> <结束格数>#k  -  #r<清除背包道具>#k\r\n" +
            "#b@查看/@Ea#k  -  #r<排解异常+查看角色状态>#k\r\n" +
            "#b@怪物/@Mob#k  -  #r<查看身旁怪物资讯>#k\r\n" +
            //"#b@mobdrop#k  -  #r<查看身旁怪物掉落资讯>#k\r\n"+
            "#b@存档/@Save#k  -  #r<储存档案>#k\r\n" +
            "#b@Cgm#k  -  #r<传讯息给管理员>#k\r\n" +
            "#b@expfix#k  -  #r<使玩家经验归0>#k\r\n" +
            "#b@Event#k  -  #r<参加活动>#k\r\n" +
            "#b@Tsmega#k  -  #r<开/关所有广播>#k\r\n" +
            "#b@爆率#k  -  #r查看怪物爆率#k\r\n" +
			"#b@自动宠物食品#k  -  #r<开/关自动喂食宠物功能>#k\r\n"
            );
    cm.dispose();
}
