/*
 ZEVMS冒险岛(079)游戏服务端
 道具制作
 */
var 装备 = [
    //永恒定边手套
    1082234,
    //永恒逍遥手套
    1082235,
    //永恒白云手套
    1082236,
    //永恒探云手套
    1082237,
    //永恒抚浪手套
    1082238,
    /*************
     鞋子
     *************/
    //永恒坚壁靴
    1072355,
    //永恒缥缈鞋
    1072356,
    //永恒彩虹鞋
    1072357,
    //永恒舞空靴
    1072358,
    //永恒定海靴
    1072359,
    /*************
     套服
     *************/
    //永恒演武铠
    1052155,
    //永恒奥神袍
    1052156,
    //永恒巡礼者
    1052157,
    //永恒翻云服
    1052158,
    //永恒霸七海
    1052159,
    /*************
     帽子
     *************/
    //永恒冠军盔
    1002776,
    //永恒玄妙帽
    1002777,
    //永恒霓翎帽
    1002778,
    //永恒迷踪帽
    1002779,
    //永恒海王星
    1002780,
    /*************
     武器
     *************/
    //永恒破甲剑
    1302081,
    //永恒断蚺斧
    1312037,
    //永恒惊破天
    1322060,
    //永恒狂鲨锯
    1332073,
    //永恒断首刃
    1332074,
    //永恒蝶翼杖
    1372044,
    //永恒冰轮杖
    1382057,
    //永恒玄冥剑
    1402046,
    //永恒碎鼋斧
    1412033,
    //永恒威震天
    1422037,
    //永恒显圣枪
    1432047,
    //永恒神光戟
    1442063,
    //永恒惊电弓
    1452057,
    //永恒冥雷弩
    1462050,
    //永恒大悲赋
    1472068,
    //永恒孔雀翎
    1482023,
    //永恒凤凰铳
    1492023
];
//说明文字
var 说明文字 = "   hi #b#h ##k 请选择你要的装备吧，选择后是不能反悔的哦。#r进入此页面后请勿不选择#k，CDK已经被消耗。";


var sels;
var 脚本执行 = -1;

function start() {
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == 1) {
        脚本执行++;
    } else if (mode == 0) {
        脚本执行--;
    } else {
        cm.dispose();
        return;
    }
    if (脚本执行 == 0) {
        var 文本信息 = "";
        for (var i = 0; i < 装备.length; i++) {
            文本信息 += "#b#L" + i + "#";
            文本信息 += "#i" + 装备[i] + "##z" + 装备[i] + "##l#k\r\n";
        }

        cm.sendSimple("" + 说明文字 + "\r\n" + 文本信息 + "");
    } else if (脚本执行 == 1) {
        sels = selection;
        cm.gainItem(装备[sels], 1);
        cm.说明文字("恭喜你获得 " + cm.显示物品(装备[sels]) + "");
		cm.输出记录("礼包兑换记录/永恒套装兑换记录.txt",""+cm.时间()+" : "+cm.getChar().getName()+" 兑换了 "+cm.getItemName(装备[sels])+" \r\n");
        cm.dispose();
    } else {
        cm.说明文字("#r发生错误: mode : " + mode + " 脚本执行 : " + 脚本执行);
        cm.dispose();
    }
}