/*
 ZEVMS冒险岛(079)游戏服务端脚本
 */
function start() {
    status = -1;
    action(1, 0, 0)
}
function action(mode, type, selection) {
    if (status <= 0 && mode <= 0) {
        cm.dispose();
        return
    }
    if (mode == 1) {
        status++
    } else {
        status--

    }
    if (cm.getInventory(1).getItem(1) == null) {
        cm.说明文字("你的装备栏第一格没有装备。");
        cm.dispose();
        return
    }
	var 装备 = cm.显示物品(cm.getInventory(1).getItem(1).getItemId());
	if(cm.isCash(cm.getInventory(1).getItem(1).getItemId())){
		cm.说明文字("你的装备栏第一格 "+装备+" 是时装，无法镶嵌。");
        cm.dispose();
        return
	}
    var 装备 = cm.显示物品(cm.getInventory(1).getItem(1).getItemId());
    if (status <= 0) {
        var selStr = "选择使用的宝石，宝石会为装备栏第一格装备附加属性。";
        selStr += "\r\n    #d当前装备：" + 装备 + "\r\n\r\n";
        //力量+2
        if (cm.判断物品数量(4250800, 1)) {
            selStr += "#L1#" + cm.显示物品(4250800) + " 力量 + #r2#k#l\r\n";
        }
        //力量+3
        if (cm.判断物品数量(4250801, 1)) {
            selStr += "#L2#" + cm.显示物品(4250801) + " 力量 + #r3#k#l\r\n";
        }
        //力量+5
        if (cm.判断物品数量(4250802, 1)) {
            selStr += "#L3#" + cm.显示物品(4250802) + " 力量 + #r5#k#l\r\n";
        }

        //智力+2
        if (cm.判断物品数量(4250900, 1)) {
            selStr += "#L4#" + cm.显示物品(4250900) + " 智力 + #r2#k#l\r\n";
        }
        //智力+3
        if (cm.判断物品数量(4250901, 1)) {
            selStr += "#L5#" + cm.显示物品(4250901) + " 智力 + #r3#k#l\r\n";
        }
        //智力+5
        if (cm.判断物品数量(4250902, 1)) {
            selStr += "#L6#" + cm.显示物品(4250902) + " 智力 + #r5#k#l\r\n";
        }

        //敏捷+2
        if (cm.判断物品数量(4251100, 1)) {
            selStr += "#L7#" + cm.显示物品(4251100) + " 敏捷 + #r2#k#l\r\n";
        }
        //敏捷+3
        if (cm.判断物品数量(4251101, 1)) {
            selStr += "#L8#" + cm.显示物品(4251101) + " 敏捷 + #r3#k#l\r\n";
        }
        //敏捷+5
        if (cm.判断物品数量(4251102, 1)) {
            selStr += "#L9#" + cm.显示物品(4251102) + " 敏捷 + #r5#k#l\r\n";
        }

        //运气+2
        if (cm.判断物品数量(4251000, 1)) {
            selStr += "#L11#" + cm.显示物品(4251000) + " 运气 + #r2#k#l\r\n";
        }
        //运气+3
        if (cm.判断物品数量(4251001, 1)) {
            selStr += "#L12#" + cm.显示物品(4251001) + " 运气 + #r3#k#l\r\n";
        }
        //运气+5
        if (cm.判断物品数量(4251002, 1)) {
            selStr += "#L13#" + cm.显示物品(4251002) + " 运气 + #r5#k#l\r\n";
        }

        //次数+1
        if (cm.判断物品数量(4251400, 1)) {
            selStr += "#L14#" + cm.显示物品(4251400) + " 次数 + #r1#k#l\r\n";
        }
        //次数+2
        if (cm.判断物品数量(4251401, 1)) {
            selStr += "#L15#" + cm.显示物品(4251401) + " 次数 + #r2#k#l\r\n";
        }
        //次数+3
        if (cm.判断物品数量(4251402, 1)) {
            selStr += "#L16#" + cm.显示物品(4251402) + " 次数 + #r3#k#l\r\n";
        }

        //命中+2
        if (cm.判断物品数量(4250200, 1)) {
            selStr += "#L17#" + cm.显示物品(4250200) + " 命中率 + #r2#k#l\r\n";
        }
        //命中+3
        if (cm.判断物品数量(4250201, 1)) {
            selStr += "#L18#" + cm.显示物品(4250201) + " 命中率 + #r3#k#l\r\n";
        }
        //命中+5
        if (cm.判断物品数量(4250202, 1)) {
            selStr += "#L19#" + cm.显示物品(4250202) + " 命中率 + #r5#k#l\r\n";
        }

        //命中+2
        if (cm.判断物品数量(4250400, 1)) {
            selStr += "#L21#" + cm.显示物品(4250400) + " 移动速度 + #r2#k#l\r\n";
        }
        //命中+3
        if (cm.判断物品数量(4250401, 1)) {
            selStr += "#L22#" + cm.显示物品(4250401) + " 移动速度 + #r3#k#l\r\n";
        }
        //命中+5
        if (cm.判断物品数量(4250402, 1)) {
            selStr += "#L23#" + cm.显示物品(4250402) + " 移动速度 + #r5#k#l\r\n";
        }

        //跳跃力+1
        if (cm.判断物品数量(4250500, 1)) {
            selStr += "#L24#" + cm.显示物品(4250500) + " 跳跃力 + #r1#k#l\r\n";
        }
        //跳跃力+2
        if (cm.判断物品数量(4250501, 1)) {
            selStr += "#L25#" + cm.显示物品(4250501) + " 跳跃力 + #r2#k#l\r\n";
        }
        //跳跃力+3
        if (cm.判断物品数量(4250502, 1)) {
            selStr += "#L26#" + cm.显示物品(4250502) + " 跳跃力 + #r3#k#l\r\n";
        }

        //加最大生命值+10
        if (cm.判断物品数量(4250600, 1)) {
            selStr += "#L27#" + cm.显示物品(4250600) + " Maxhp + #r1#k#l\r\n";
        }
        //加最大生命值+20
        if (cm.判断物品数量(4250601, 1)) {
            selStr += "#L28#" + cm.显示物品(4250601) + " Maxhp + #r2#k#l\r\n";
        }
        //加最大生命值+30
        if (cm.判断物品数量(4250602, 1)) {
            selStr += "#L29#" + cm.显示物品(4250602) + " Maxhp + #r3#k#l\r\n";
        }

        //回避率+2
        if (cm.判断物品数量(4250300, 1)) {
            selStr += "#L31#" + cm.显示物品(4250300) + " 回避率 + #r2#k#l\r\n";
        }
        //回避率+3
        if (cm.判断物品数量(4250301, 1)) {
            selStr += "#L32#" + cm.显示物品(4250301) + " 回避率 + #r3#k#l\r\n";
        }
        //回避率+5
        if (cm.判断物品数量(4250302, 1)) {
            selStr += "#L33#" + cm.显示物品(4250302) + " 回避率 + #r5#k#l\r\n";
        }

        //魔法攻击力+1
        if (cm.判断物品数量(4250100, 1)) {
            selStr += "#L34#" + cm.显示物品(4250100) + " 魔法攻击力 + #r1#k#l\r\n";
        }
        //魔法攻击力+2
        if (cm.判断物品数量(4250101, 1)) {
            selStr += "#L35#" + cm.显示物品(4250101) + " 魔法攻击力 + #r2#k#l\r\n";
        }
        //魔法攻击力+3
        if (cm.判断物品数量(4250102, 1)) {
            selStr += "#L36#" + cm.显示物品(4250102) + " 魔法攻击力 + #r3#k#l\r\n";
        }

        //加最大法力值+10
        if (cm.判断物品数量(4250700, 1)) {
            selStr += "#L37#" + cm.显示物品(4250700) + " Maxmp + #r10#k#l\r\n";
        }
        //加最大法力值+20
        if (cm.判断物品数量(4250701, 1)) {
            selStr += "#L38#" + cm.显示物品(4250701) + " Maxmp + #r20#k#l\r\n";
        }
        //加最大法力值+30
        if (cm.判断物品数量(4250702, 1)) {
            selStr += "#L39#" + cm.显示物品(4250702) + " Maxmp + #r30#k#l\r\n";
        }

        //加物理攻击力+1
        if (cm.判断物品数量(4250000, 1)) {
            selStr += "#L41#" + cm.显示物品(4250000) + " 物理攻击力 + #1#k#l\r\n";
        }
        //加物理攻击力+2
        if (cm.判断物品数量(4250001, 1)) {
            selStr += "#L42#" + cm.显示物品(4250001) + " 物理攻击力 + #2#k#l\r\n";
        }
        //加物理攻击力+3
        if (cm.判断物品数量(4250002, 1)) {
            selStr += "#L43#" + cm.显示物品(4250002) + " 物理攻击力 + #3#k#l\r\n";
        }

        //双防+2
        if (cm.判断物品数量(4251300, 1)) {
            selStr += "#L44#" + cm.显示物品(4251300) + " 双防 + #2#k#l\r\n";
        }
        //双防+3
        if (cm.判断物品数量(4251301, 1)) {
            selStr += "#L45#" + cm.显示物品(4251301) + " 双防 + #3#k#l\r\n";
        }
        //双防+5
        if (cm.判断物品数量(4251302, 1)) {
            selStr += "#L46#" + cm.显示物品(4251302) + " 双防 + #5#k#l\r\n";
        }
        cm.sendSimple(selStr)
    } else if (status == 1) {
        switch (selection) {
            /**************************************************/
            //双防+5
            case 46:
                cm.收物品(4251302, 1);
                cm.加魔法防御(5);
                cm.加物理防御(5);
                cm.说明文字("宝石镶嵌成功。" + 装备 + " 双防 + 5");
                cm.dispose();
                break;
                //双防+3
            case 45:
                cm.收物品(4251301, 1);
                cm.加魔法防御(3);
                cm.加物理防御(3);
                cm.说明文字("宝石镶嵌成功。" + 装备 + " 双防 + 3");
                cm.dispose();
                break;
                //双防+2
            case 44:
                cm.收物品(4251300, 1);
                cm.加魔法防御(2);
                cm.加物理防御(2);
                cm.说明文字("宝石镶嵌成功。" + 装备 + " 双防 + 2");
                cm.dispose();
                break;
                /**************************************************/
                //加物理攻击力+3
            case 43:
                cm.收物品(4250002, 1);
                cm.加物理攻击(3);
                cm.说明文字("宝石镶嵌成功。" + 装备 + " 物理攻击力 + 3");
                cm.dispose();
                break;
                //加物理攻击力+2
            case 42:
                cm.收物品(4250001, 1);
                cm.加物理攻击(2);
                cm.说明文字("宝石镶嵌成功。" + 装备 + " 物理攻击力 + 2");
                cm.dispose();
                break;
                //加物理攻击力+1
            case 41:
                cm.收物品(4250000, 1);
                cm.加物理攻击(1);
                cm.说明文字("宝石镶嵌成功。" + 装备 + " 物理攻击力 + 1");
                cm.dispose();
                break;
                /**************************************************/
                //加最大法力值+30
            case 39:
                cm.收物品(4250702, 1);
                cm.加最大法力值(30);
                cm.说明文字("宝石镶嵌成功。" + 装备 + " Maxmp + 30");
                cm.dispose();
                break;
                //加最大法力值+20
            case 38:
                cm.收物品(4250701, 1);
                cm.加最大法力值(20);
                cm.说明文字("宝石镶嵌成功。" + 装备 + " Maxmp + 20");
                cm.dispose();
                break;
                //加最大法力值+10
            case 37:
                cm.收物品(4250700, 1);
                cm.加最大法力值(10);
                cm.说明文字("宝石镶嵌成功。" + 装备 + " Maxmp + 10");
                cm.dispose();
                break;
                /**************************************************/
                //魔法攻击力+3
            case 36:
                cm.收物品(4250102, 1);
                cm.加魔法攻击(3);
                cm.说明文字("宝石镶嵌成功。" + 装备 + " 魔法攻击力 + 3");
                cm.dispose();
                break;
                //魔法攻击力+2
            case 35:
                cm.收物品(4250101, 1);
                cm.加魔法攻击(2);
                cm.说明文字("宝石镶嵌成功。" + 装备 + " 魔法攻击力 + 2");
                cm.dispose();
                break;
                //魔法攻击力+1
            case 34:
                cm.收物品(4250100, 1);
                cm.加魔法攻击(1);
                cm.说明文字("宝石镶嵌成功。" + 装备 + " 魔法攻击力 + 1");
                cm.dispose();
                break;
                /**************************************************/
                //回避率+5
            case 33:
                cm.收物品(4250302, 1);
                cm.加闪避率(5);
                cm.说明文字("宝石镶嵌成功。" + 装备 + " 回避率 + 4");
                cm.dispose();
                break;
                //回避率+3
            case 32:
                cm.收物品(4250301, 1);
                cm.加闪避率(3);
                cm.说明文字("宝石镶嵌成功。" + 装备 + " 回避率 + 3");
                cm.dispose();
                break;
                //回避率+2
            case 31:
                cm.收物品(4250300, 1);
                cm.加闪避率(2);
                cm.说明文字("宝石镶嵌成功。" + 装备 + " 回避率 + 2");
                cm.dispose();
                break;
                /**************************************************/
                //加最大生命值+30
            case 29:
                cm.收物品(4250602, 1);
                cm.加最大生命值(30);
                cm.说明文字("宝石镶嵌成功。" + 装备 + " Maxhp + 30");
                cm.dispose();
                break;
                //加最大生命值+20
            case 28:
                cm.收物品(4250601, 1);
                cm.加最大生命值(20);
                cm.说明文字("宝石镶嵌成功。" + 装备 + " Maxhp + 20");
                cm.dispose();
                break;
                //加最大生命值+10
            case 27:
                cm.收物品(4250600, 1);
                cm.加最大生命值(10);
                cm.说明文字("宝石镶嵌成功。" + 装备 + " Maxhp + 10");
                cm.dispose();
                break;
                /**************************************************/
                //跳跃力+3
            case 26:
                cm.收物品(4250502, 1);
                cm.加跳跃力(3);
                cm.说明文字("宝石镶嵌成功。" + 装备 + " 跳跃力 + 3");
                cm.dispose();
                break;
                //跳跃力+2
            case 25:
                cm.收物品(4250501, 1);
                cm.加跳跃力(2);
                cm.说明文字("宝石镶嵌成功。" + 装备 + " 跳跃力 + 2");
                cm.dispose();
                break;
                //跳跃力+1
            case 24:
                cm.收物品(4250500, 1);
                cm.加跳跃力(1);
                cm.说明文字("宝石镶嵌成功。" + 装备 + " 跳跃力 + 1");
                cm.dispose();
                break;
                /**************************************************/
                //移动速度+5
            case 23:
                cm.收物品(4250402, 1);
                cm.加移动速度(5);
                cm.说明文字("宝石镶嵌成功。" + 装备 + " 移动速度 + 5");
                cm.dispose();
                break;
                //移动速度+3
            case 22:
                cm.收物品(4250401, 1);
                cm.加移动速度(3);
                cm.说明文字("宝石镶嵌成功。" + 装备 + " 移动速度 + 3");
                cm.dispose();
                break;
                //移动速度+2
            case 21:
                cm.收物品(4250400, 1);
                cm.加移动速度(2);
                cm.说明文字("宝石镶嵌成功。" + 装备 + " 移动速度 + 2");
                cm.dispose();
                break;
                /**************************************************/
                //命中+5
            case 19:
                cm.收物品(4250202, 1);
                cm.加命中率(5);
                cm.说明文字("宝石镶嵌成功。" + 装备 + " 命中率 + 5");
                cm.dispose();
                break;
                //命中+3
            case 18:
                cm.收物品(4250201, 1);
                cm.加命中率(3);
                cm.说明文字("宝石镶嵌成功。" + 装备 + " 命中率 + 3");
                cm.dispose();
                break;
                //命中+2
            case 17:
                cm.收物品(4250200, 1);
                cm.加命中率(2);
                cm.说明文字("宝石镶嵌成功。" + 装备 + " 命中率 + 2");
                cm.dispose();
                break;
                /**************************************************/
                //次数+3
            case 16:
                cm.收物品(4251402, 1);
                cm.加升级次数(3);
                cm.说明文字("宝石镶嵌成功。" + 装备 + " 升级次数 + 3");
                cm.dispose();
                break;
                //次数+2
            case 15:
                cm.收物品(4251401, 1);
                cm.加升级次数(2);
                cm.说明文字("宝石镶嵌成功。" + 装备 + " 升级次数 + 2");
                cm.dispose();
                break;
                //次数+1
            case 14:
                cm.收物品(4251400, 1);
                cm.加升级次数(1);
                cm.说明文字("宝石镶嵌成功。" + 装备 + " 升级次数 + 1");
                cm.dispose();
                break;
                /**************************************************/
                //运气+5
            case 13:
                cm.收物品(4251002, 1);
                cm.加运气(5);
                cm.说明文字("宝石镶嵌成功。" + 装备 + " 运气 + 5");
                cm.dispose();
                break;
                //运气+3
            case 12:
                cm.收物品(4251001, 1);
                cm.加运气(3);
                cm.说明文字("宝石镶嵌成功。" + 装备 + " 运气 + 3");
                cm.dispose();
                break;
                //运气+2
            case 11:
                cm.收物品(4251000, 1);
                cm.加运气(2);
                cm.说明文字("宝石镶嵌成功。" + 装备 + " 运气 + 2");
                cm.dispose();
                break;
                /**************************************************/
                //敏捷+5
            case 9:
                cm.收物品(4251102, 1);
                cm.加敏捷(5);
                cm.说明文字("宝石镶嵌成功。" + 装备 + " 敏捷 + 5");
                cm.dispose();
                break;
                //敏捷+3
            case 8:
                cm.收物品(4251101, 1);
                cm.加敏捷(3);
                cm.说明文字("宝石镶嵌成功。" + 装备 + " 敏捷 + 3");
                cm.dispose();
                break;
                //敏捷+2
            case 7:
                cm.收物品(4251100, 1);
                cm.加敏捷(2);
                cm.说明文字("宝石镶嵌成功。" + 装备 + " 敏捷 + 2");
                cm.dispose();
                break;
                /**************************************************/
                //智力+5
            case 6:
                cm.收物品(4250902, 1);
                cm.加智力(5);
                cm.说明文字("宝石镶嵌成功。" + 装备 + " 智力 + 5");
                cm.dispose();
                break;
                //智力+3
            case 5:
                cm.收物品(4250901, 1);
                cm.加智力(3);
                cm.说明文字("宝石镶嵌成功。" + 装备 + " 智力 + 3");
                cm.dispose();
                break;
                //智力+2
            case 4:
                cm.收物品(4250900, 1);
                cm.加智力(2);
                cm.说明文字("宝石镶嵌成功。" + 装备 + " 智力 + 2");
                cm.dispose();
                break;
                /**************************************************/
                //力量+5
            case 3:
                cm.收物品(4250802, 1);
                cm.加力量(5);
                cm.说明文字("宝石镶嵌成功。" + 装备 + " 力量 + 5");
                cm.dispose();
                break;
                //力量+3
            case 2:
                cm.收物品(4250801, 1);
                cm.加力量(3);
                cm.说明文字("宝石镶嵌成功。" + 装备 + " 力量 + 3");
                cm.dispose();
                break;
                //力量+2
            case 1:
                cm.收物品(4250800, 1);
                cm.加力量(2);
                cm.说明文字("宝石镶嵌成功。" + 装备 + " 力量 + 2");
                cm.dispose();
                break;

        }
    }
}