/*
 
 */
//水晶，数量，金币，1,2,3
var 合成表 = [
  [4005000, 1, 80000, 4250800, 4250801, 4250802],
  [4005001, 1, 80000, 4250900, 4250901, 4250902],
  [4005002, 1, 80000, 4251100, 4251101, 4251102],
  [4005003, 1, 80000, 4251000, 4251001, 4251002],
  [4005004, 1, 80000, 4251400, 4251401, 4251402],
  [4021000, 1, 80000, 4250200, 4250201, 4250202],
  [4021001, 1, 80000, 4250400, 4250401, 4250402],
  [4021002, 1, 80000, 4250500, 4250501, 4250502],
  [4021003, 1, 80000, 4250700, 4250701, 4250702],
  [4021004, 1, 80000, 4250300, 4250301, 4250302],
  [4021005, 1, 80000, 4250100, 4250101, 4250102],
  [4021006, 1, 80000, 4250600, 4250601, 4250602],
  [4021007, 1, 80000, 4250000, 4250001, 4250002],
  [4021008, 1, 80000, 4251300, 4251301, 4251302],
];

var sels;
var 记录;
var 脚本执行 = -1;

function start() {
  action(1, 0, 0);
}

function action(mode, type, selection) {
  if (mode == 1) {
    脚本执行++;
  } else if (mode == 0) {
    脚本执行--;
  } else {
    cm.对话结束();
    return;
  }
  if (脚本执行 == 0) {
    var 文本信息 = "";
    for (var i = 0; i < 合成表.length; i++) {
      文本信息 += "#L" + i + "#";
      文本信息 +=
        "#r#z" + 合成表[i][0] + "##k#b ￥" + 合成表[i][2] + "#k#l#k\r\n";
    }
    cm.sendSimple(
      "  提示：#d洗练后的宝石出现#r下等，中等，高级#k的品级：#k\r\n\r\n" +
        文本信息 +
        ""
    );
  } else if (脚本执行 == 1) {
    sels = selection;
    i = selection;
    if (cm.判断背包其他栏().isFull()) {
      cm.sendNext("背包其他栏空间不足。");
      cm.dispose();
      return;
    }
    if (!cm.haveItem(合成表[i][0], 合成表[i][1])) {
      cm.说明文字(
        " 需要 #b#i" +
          合成表[i][0] +
          "# #t" +
          合成表[i][0] +
          "##k #r" +
          合成表[i][1] +
          "#k 个。"
      );
      cm.对话结束();
      return;
    }
    if (cm.判断金币() < 合成表[i][2]) {
      cm.说明文字(" 需要 #b" + 合成表[i][2] + "#k 金币。");
      cm.对话结束();
      return;
    }
    var 随机 = cm.随机数(100);
    cm.收金币(合成表[i][2]);
    cm.收物品(合成表[i][0], 合成表[i][1]);
    if (随机 >= 90) {
      cm.给物品(合成表[sels][5], 1);
      cm.说明文字(
        " 洗练完成，获得 #b#i" +
          合成表[i][5] +
          "##k #r#t" +
          合成表[i][5] +
          "#。"
      );
    } else if (随机 >= 80) {
      cm.给物品(合成表[sels][4], 1);
      cm.说明文字(
        " 洗练完成，获得 #b#i" +
          合成表[i][4] +
          "##k #r#t" +
          合成表[i][4] +
          "#。"
      );
    } else {
      cm.给物品(合成表[sels][3], 1);
      cm.说明文字(
        " 洗练完成，获得 #b#i" +
          合成表[i][3] +
          "##k #r#t" +
          合成表[i][3] +
          "#。"
      );
    }
    cm.对话结束();
  }
}
