var status = 0;
var bossid = "消费礼包";
var giftLevel = Array(15, 30, 50, 100, 300, 500, 800, 1000, 1500, 2000, 3000, 4000, 5000,6000,7000,8000,10000);
var giftContent = Array(
    //15
    Array(2049116, 50, 1),      // 强混50
    Array(2049600, 20, 1),      //还原20
    //30
    Array(2049116, 50, 2),      // 强混100
    Array(2049600, 25, 2),      //还原50
    Array(1032220, 1, 2),      //低贝耳环


    // 50
    Array(2049116, 50, 3),      // 强混100
    Array(2049600, 25, 3),      //还原50
    Array(5750000, 50, 3),      //星岩魔方
    Array(5062024, 20, 3),      //闪炫魔方
    // Array(5062022, 20, 3),      //闪耀镜射


    //100
    Array(2049116, 100, 4),      // 强混100
    Array(2049600, 50, 4),      //还原50
    Array(5750000, 100, 4),      //星岩魔方
    Array(5062024, 50, 4),      //闪炫魔方
    //Array(5062022, 50, 4),      //闪耀镜射
    Array(2434007, 1, 4),      //ffn武器自选


    //300
    Array(2049116, 200, 5),      // 强混200
    Array(2049600, 100, 5),      //还原100
    Array(5750000, 100, 5),      //星岩魔方
    Array(5062024, 50, 5),      //闪炫魔方
    Array(2049323, 50, 5),      //无损
    Array(2435712, 3, 5),      // ffn防具自选3个


    //500
    Array(2049116, 200, 6),      // 强混200
    Array(2049600, 100, 6),      //还原100
    Array(5750000, 100, 6),      //星岩魔方
    Array(5062024, 50, 6),      //闪炫魔方
    Array(2049323, 50, 6),      //无损
    Array(2436114, 1, 6),      //暴君自选


    //800
    Array(2049116, 200, 7),      // 强混200
    Array(2049600, 100, 7),      //还原100
    Array(5750000, 100, 7),      //星岩魔方
    Array(5062024, 100, 7),      //闪炫魔方
    Array(2049323, 50, 7),      //无损
    //Array(2436114, 2, 7),      //暴君自选
    Array(1182017, 1, 7),      //休彼得曼黄金徽章②


    //1000
    Array(2049116, 200, 8),      // 强混200
    Array(2049600, 100, 8),      //还原100
    Array(5750000, 200, 8),      //星岩魔方
    Array(5062024, 100, 8),      //闪炫魔方
    Array(2049323, 100, 8),      //无损
    Array(2436114, 1, 8),      //暴君自选2
    Array(3994417, 1, 8),      //红色蜡笔1
    Array(3994418, 1, 8),      //橙色蜡笔1
    Array(3994419, 1, 8),      //黄色蜡笔1



		//1500
    Array(2049116, 200, 9),      // 强混200
    Array(2049600, 100, 9),      //还原100
    Array(5750000, 200, 9),      //星岩魔方
    Array(5062024, 100, 9),      //闪炫魔方
    Array(2049323, 100, 9),      //无损
    Array(3994417, 1, 9),      //红色蜡笔1
    Array(3994418, 1, 9),      //橙色蜡笔1
    Array(3994419, 1, 9),      //黄色蜡笔1
    Array(3994420, 1, 9),      //青色蜡笔1
    Array(2436114, 1, 9),      //暴君自选2
    Array(1672027, 1, 9),      //极真锂心脏
    Array(2436289, 1, 9),     //埃苏莱武器
    //todo as武器，未找到
    //todo as防具，未找到


		//2000
    Array(2049116, 200, 10),      // 强混200
    Array(2049600, 100, 10),      //还原100
    Array(5750000, 200, 10),      //星岩魔方
    Array(5062024, 100, 10),      //闪炫魔方
    Array(2049323, 100, 10),      //无损
    Array(3994417, 1, 10),      //红色蜡笔1
    Array(3994418, 1, 10),      //橙色蜡笔1
    Array(3994419, 1, 10),      //黄色蜡笔1
    Array(3994420, 1, 10),      //绿色蜡笔1
    Array(3994421, 1, 10),      //青色蜡笔1
    Array(2430888, 1, 10),      //特米自选
    Array(2436114, 1, 10),      //暴君自选1
    Array(3010832, 1, 10),      //太阳椅子
    //todo as防具，未找到

		//3000
    Array(2049116, 200, 11),      // 强混200
    Array(2049600, 100, 11),      //还原100
    Array(5750000, 200, 11),      //星岩魔方
    Array(5062024, 100, 11),      //闪炫魔方
    Array(2049323, 200, 11),      //无损
    Array(3994417, 1, 11),      //红色蜡笔1
    Array(3994418, 1, 11),      //橙色蜡笔1
    Array(3994419, 1, 11),      //黄色蜡笔1
    Array(3994420, 1, 11),      //绿色蜡笔1
    Array(3994421, 1, 11),      //青色蜡笔1
    Array(3994422, 1, 11),      //蓝色蜡笔1
    Array(2613050, 10, 11),      //x单手武器攻击
    Array(2613051, 10, 11),      //x单手武器魔力
    Array(2612061, 10, 11),      //x双手武器攻击
    Array(2612062, 10, 11),      //x双手武器魔力
    //Array(2436114, 2, 11),      //暴君自选2
    Array(2431980, 1, 11),      //神秘自选

		//4000
    Array(2049116, 200, 12),      // 强混200
    Array(2049600, 100, 12),      //还原100
    Array(5750000, 200, 12),      //星岩魔方
    Array(5062024, 100, 12),      //闪炫魔方
    Array(2049323, 200, 12),      //无损
    Array(3994417, 1, 12),      //红色蜡笔1
    Array(3994418, 1, 12),      //橙色蜡笔1
    Array(3994419, 1, 12),      //黄色蜡笔1
    Array(3994420, 1, 12),      //绿色蜡笔1
    Array(3994421, 1, 12),      //青色蜡笔1
    Array(3994422, 1, 12),      //蓝色蜡笔1
    Array(2613050, 10, 12),      //x单手武器攻击
    Array(2613051, 10, 12),      //x单手武器魔力
    Array(2612061, 10, 12),      //x双手武器攻击
    Array(2612062, 10, 12),      //x双手武器魔力
    Array(4310218, 50, 12),      //幻影币
    Array(1132246, 1, 12),      //最高贝腰带
    Array(2434999, 1, 12),     //神秘带属性自选

		//5000
    Array(2049116, 200, 13),      // 强混200
    Array(2049600, 100, 13),      //还原100
    Array(5750000, 200, 13),      //星岩魔方
    Array(5062024, 100, 13),      //闪炫魔方
    Array(2049323, 200, 13),      //无损
    Array(3994417, 1, 13),      //红色蜡笔1
    Array(3994418, 1, 13),      //橙色蜡笔1
    Array(3994419, 1, 13),      //黄色蜡笔1
    Array(3994420, 1, 13),      //绿色蜡笔1
    Array(3994421, 1, 13),      //青色蜡笔1
    Array(3994422, 1, 13),      //蓝色蜡笔1
    Array(2613050, 10, 13),      //x单手武器攻击
    Array(2613051, 10, 13),      //x单手武器魔力
    Array(2612061, 10, 13),      //x双手武器攻击
    Array(2612062, 10, 13),      //x双手武器魔力
    Array(4310218, 50, 13),      //幻影币
    Array(1672027, 1, 13),      //极真锂心脏
    Array(2434999, 1, 17),     //神秘带属性自选

		//6000
    Array(2049116, 200, 14),      // 强混200
    Array(2049600, 100, 14),      //还原100
    Array(5750000, 400, 14),      //星岩魔方
    Array(5062024, 200, 14),      //闪炫魔方
    Array(2049323, 200, 14),      //无损
    Array(3994417, 1, 14),      //红色蜡笔1
    Array(3994418, 1, 14),      //橙色蜡笔1
    Array(3994419, 1, 14),      //黄色蜡笔1
    Array(3994420, 1, 14),      //绿色蜡笔1
    Array(3994421, 1, 14),      //青色蜡笔1
    Array(3994422, 1, 14),      //lan色蜡笔1
    Array(2435824, 10, 14),      //V自选10
    Array(2432220, 1, 14),      //解封卷轴
    Array(2434999, 1, 14),     //神秘带属性自选

		//7000
    Array(2049116, 200, 15),      // 强混200
    Array(2049600, 100, 15),      //还原100
    Array(5750000, 400, 15),      //星岩魔方
    Array(5062024, 200, 15),      //闪炫魔方
    Array(2049323, 200, 15),      //无损
    Array(3994417, 1, 15),      //红色蜡笔1
    Array(3994418, 1, 15),      //橙色蜡笔1
    Array(3994419, 1, 15),      //黄色蜡笔1
    Array(3994420, 1, 15),      //绿色蜡笔1
    Array(3994421, 1, 15),      //青色蜡笔1
    Array(3994422, 1, 15),      //蓝色蜡笔1
    Array(2435824, 10, 15),      //V自选10
    Array(1672069, 1, 15),      //女武神
    //Array(1402224, 1, 15),      //柳德之剑
    Array(2434999, 1, 15),     //神秘带属性自选

		//8000
    Array(2049116, 200, 16),      // 强混200
    Array(2049600, 100, 16),      //还原100
    Array(5750000, 200, 16),      //星岩魔方
    Array(5062024, 100, 16),      //闪炫魔方
    Array(2049323, 200, 16),      //无损
    Array(3994417, 1, 16),      //红色蜡笔1
    Array(3994418, 1, 16),      //橙色蜡笔1
    Array(3994419, 1, 16),      //黄色蜡笔1
    Array(3994420, 1, 16),      //绿色蜡笔1
    Array(3994421, 1, 16),      //青色蜡笔1
    Array(3994422, 1, 16),      //蓝色蜡笔1
    Array(2435824, 10, 16),      //V自选10
    Array(2431980, 1, 16),      //神秘武器自选
    //Array(2432220, 1, 16),      //解封卷轴
    //Array(1004075, 1, 16),      //海神王冠
    Array(2434999, 1, 16),     //神秘带属性自选

		//10000
    Array(2049116, 200, 17),      // 强混200
    Array(2049600, 100, 17),      //还原100
    Array(5750000, 500, 17),      //星岩魔方
    Array(5062024, 200, 17),      //闪炫魔方
    Array(2049323, 500, 17),      //无损
    Array(3994417, 1, 17),      //红色蜡笔1
    Array(3994418, 1, 17),      //橙色蜡笔1
    Array(3994419, 1, 17),      //黄色蜡笔1
    Array(3994420, 1, 17),      //绿色蜡笔1
    Array(3994421, 1, 17),      //青色蜡笔1
    Array(3994422, 1, 17),      //蓝色蜡笔1
    Array(2435824, 20, 17),      //V自选20
    Array(2431980, 1, 17),      //神秘自选
    Array(2432220, 2, 17),      //解封卷轴
    Array(1382235, 1, 17),      //阿丽莎
    Array(4310218, 50, 17),      //幻影币
    Array(2049376, 3, 17),     //20星
    Array(2434999, 1, 17)     //神秘带属性自选   
);
var giftId = -1;
var giftToken = Array();
var gifts = null;
function start() {
    status = -1;
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (status == 0 && mode == 0) {
        cm.dispose();
        return;
    }
    if (mode == 1) {
        status++;
    } else {
        status--;
    }
    if (status == 0) {
        var text = "您已经累计消费:#r"+(-cm.getHyPay(2))+"#k元\r\n";
        text += "累计消费达到以下要求即可领取消费礼包\r\n";   //#e#r欢乐时刻礼物盒为200级神秘自选武器箱\r\n#e#r18000消费礼包中的#v2433706#能开出全属性200的#v1142802#\r\n#e#r24000消费礼包中的#v2433834#能开出全属性300#v1142111#\r\n#e#r24000消费超越箱和埃苏箱都为全100属性的\r\n#e#r38500消费礼包中的#v2434997#能开出全属性100#v1113056#自选\r\n#e#r47000消费礼包中的#v2434998#能开出全属性150#v1053065#防具自选！\r\n\r\n\t#e#r您当前的充值金额：#n#r￥" + cm.getTotalRMB() + "#k\r\n";
        for (var key in giftLevel) {
            var tips = "";
            giftToken[key] = false;
            if ((-cm.getHyPay(2)) >= giftLevel[key]) {
                if (cm.getBossLogAcc(bossid + key) != -1) {
                    tips = "(可领取)";
                    giftToken[key] = true;
                } else {
                    tips = "#g(已领取)#b";
                }
            } else {
                tips = "#r(条件不足)#b";
            }
            text += "#b#L" + (parseInt(key) + 1) + "#领取#r#e" + giftLevel[key] + "#n#b元消费礼包 " + tips + "#l#k\r\n";
        }
        cm.sendSimpleN(text, 716, 2400010);
    } else if (status == 1) {
        giftId = parseInt(selection);
        var text = "#r#e" + giftLevel[giftId - 1] + "#n#b元消费礼包内容：\r\n";
        gifts = getGift(giftId);
        for (var key in gifts) {
            var itemId = gifts[key][0];
            var itemQuantity = gifts[key][1];
            text += "#v" + itemId + "##b#t" + itemId + "##k #rx " + itemQuantity + "#k\r\n";
        }
        text += "\r\n#d是否现在就领取该礼包？#k";
        cm.sendSimpleN(text, 716, 2400010);
    } else if (status == 2) {
        if (giftId != -1 && gifts != null) {
            if (cm.getSpace(1) < 15 || cm.getSpace(2) < 15 || cm.getSpace(3) < 15 || cm.getSpace(4) < 15 || cm.getSpace(5) < 15) {
                cm.sendOk("您的背包空间不足，请保证每个栏位至少15格的空间，以避免领取失败。");
                cm.dispose();
                return;
            }
            if (giftToken[giftId - 1]) {
                cm.setBossLogAcc(bossid + (giftId - 1), -2);
                for (var key in gifts) {
                    var itemId = gifts[key][0];
                    var itemQuantity = gifts[key][1];
                    cm.gainItem(itemId, itemQuantity);
                }
                cm.sendOk("恭喜您，领取成功！快打开包裹看看吧！");
               cm.worldSpouseMessage(0x13, "『消费礼包』" + " : " + "玩家 " + cm.getChar().getName() + " 领取了 " + giftLevel[giftId - 1] + "元 消费礼包。");
			                  cm.worldSpouseMessage(0x13, "『消费礼包』" + " : " + "玩家 " + cm.getChar().getName() + " 领取了 " + giftLevel[giftId - 1] + "元 消费礼包。");
               cm.worldSpouseMessage(0x13, "『消费礼包』" + " : " + "玩家 " + cm.getChar().getName() + " 领取了 " + giftLevel[giftId - 1] + "元 消费礼包。");

                cm.dispose();
            } else {
                status = -1;
                cm.sendSimple("您已经领过了该礼包或者充值金额未达到要求，无法领取。");
            }
        } else {
            cm.sendOk("领取错误！请联系管理员！");
            cm.dispose();
        }
    }
}
function getGift(id) {
    var lastGiftContent = Array();
    for (var key in giftContent) {
        if (giftContent[key][2] == id)
            lastGiftContent.push(giftContent[key]);
    }
    return lastGiftContent;
}