/*
 蜗牛冒险岛(079)游戏服务端
 脚本：渔场
 */
function start() {
    var 类型 = 3;
    var 地图 = cm.getMapId();
	var 角色 = cm.getPlayer().id;
    var 传送点 = cm.判断传送点x(角色, 类型);
    var 落脚点 = cm.判断传送点y(角色, 类型);
    if (地图 == 741000200) {
		if(传送点<=0){
			cm.warp(100000000,0);
			cm.sendOk("传送点出错，默认为你回到射手村，已经为你重新配置该传送点。");
		}else{
			cm.warp(传送点, 落脚点);
		}
		cm.设置传送点x(角色,类型,0);
		cm.设置传送点y(角色,类型,0);
    } else {
        //射手村
        if (地图 == 100000000) {
            传送(地图,12);
        //废弃都市
        } else if (地图 == 103000000) {
            传送(地图,44);
		 //林中之城
        } else if (地图 == 105040300) {
           传送(地图,1);
		 //玩具城
        } else if (地图 == 220000000) {
            传送(地图,33);
		 //嵩山
        } else if (地图 == 702000000) {
            传送(地图,3);
		 //魔法密林
        } else if (地图 == 101000000) {
            传送(地图,8);
		 //勇士部落
        } else if (地图 == 102000000) {
            传送(地图,19);
		//冰封雪域
        } else if (地图 == 211000000) {
            传送(地图,2);
		//百草堂
        } else if (地图 == 251000000) {
            传送(地图,2);
		//水上市场
        } else if (地图 == 500000000) {
            传送(地图,12);
		//新加坡
        } else if (地图 == 540000000) {
            传送(地图,4);
		//码头成
        } else if (地图 == 541000000) {
            传送(地图,5);
		//干塝村
        } else if (地图 == 551000000) {
            传送(地图,8);	
		//上海
        } else if (地图 == 701000000) {
            传送(地图,8);	
		//江户村
        } else if (地图 == 800000000) {
            传送(地图,0);
		//邵和存
        } else if (地图 == 801000000) {
            传送(地图,0);
        } else {
			cm.warp(100000000,0);
            cm.sendOk("传送点出错，默认为你回到射手村，已经为你重新配置该传送点。");
        }
    }
    cm.dispose();
}

function 传送( a, b) {
	var 类型 = 3;
    var 地图 = cm.getMapId();
	var 角色 = cm.getPlayer().id;
	cm.warp(741000200,8);
	cm.设置传送点x(角色,类型,a);
	cm.设置传送点y(角色,类型,b);
}

















