/*
 蜗牛冒险岛(079)游戏服务端
 脚本：藏宝城
 */
function start() {
    var 类型 = 9;
    var 地图 = cm.getMapId();
	var 角色 = cm.getPlayer().id;
    var 传送点 = cm.判断传送点x(角色, 类型);
    var 落脚点 = cm.判断传送点y(角色, 类型);
    if (地图 == 674030100) {
        if(传送点<=0){
			cm.warp(100000000,0);
			cm.sendOk("传送点出错，默认为你回到射手村，已经为你重新配置该传送点。");
		}else{
			cm.warp(传送点, 落脚点);
		}
		cm.设置传送点x(角色,类型,0);
		cm.设置传送点y(角色,类型,0);
    } else {
        if (地图 == 100000000) {
            传送(地图,16);
        } else if (地图 == 101000000) {
            传送(地图,19);
        } else if (地图 == 102000000) {
            传送(地图,1);
        } else if (地图 == 103000000) {
            传送(地图,11);
        } else if (地图 == 104000000) {
            传送(地图,17);
        } else if (地图 == 105040300) {
            传送(地图,5);
        } else if (地图 == 200000000) {
            传送(地图,41);
        } else if (地图 == 211000000) {
            传送(地图,21);
        } else if (地图 == 220000000) {
            传送(地图,0);
        } else if (地图 == 222000000) {
            传送(地图,2);
        } else if (地图 == 230000000) {
            传送(地图,3);
        } else if (地图 == 240000000) {
            传送(地图,0);
        } else if (地图 == 250000000) {
            传送(地图,4);
        } else if (地图 == 261000000) {
            传送(地图,13);
        } else if (地图 == 500000000) {
            传送(地图,16);
        } else if (地图 == 550000000) {
            传送(地图,10);
        } else if (地图 == 551000000) {
            传送(地图,10);
        } else if (地图 == 701000100) {
            传送(地图,2);
        } else if (地图 == 702000000) {
            传送(地图,0);
        } else {
            cm.warp(100000000, 0);
            cm.sendOk("传送点出错，默认为你回到射手村，已经为你重新配置该传送点。");
        }
    }
    cm.dispose();
}



function 传送( a, b) {
	var 类型 = 9;
    var 地图 = cm.getMapId();
	var 角色 = cm.getPlayer().id;
	cm.warp(674030100, 1);
	cm.设置传送点x(角色,类型,a);
	cm.设置传送点y(角色,类型,b);
}









