/*
 蜗牛冒险岛(079)游戏服务端
 脚本：市场进出
 */
//cm.getPlayer().getMap().getPortals().size()
//进入市场

var zev;
function start() {
	var 类型 = 1;
    var 地图 = cm.getMapId();
	var 角色 = cm.getPlayer().id;
    var 传送点 = cm.判断传送点x(角色, 类型);
    var 落脚点 = cm.判断传送点y(角色, 类型);
    if (地图 == 910000000) {
		if(传送点<=0){
			cm.warp(100000000,0);
			cm.sendOk("传送点出错，默认为你回到射手村，已经为你重新配置该传送点。");
		}else{
			cm.warp(传送点, 落脚点);
		}
		cm.设置传送点x(角色,类型,0);
		cm.设置传送点y(角色,类型,0);
    } else {
        //射手村
        if (地图 == 100000100) {
			传送(地图,21);
            //勇士部落
        } else if (地图 == 102000000) {
            传送(地图,27);
            //里恩
        } else if (地图 == 140000000) {
            传送(地图,8);
            //圣地
        } else if (地图 == 130000200) {
            传送(地图,4);
            //水下世界
        } else if (地图 == 230000000) {
            传送(地图,11);
            //天空之城
        } else if (地图 == 200000000) {
            传送(地图,36);
            //雪域集市
        } else if (地图 == 211000100) {
            传送(地图,9);
            //玩具城
        } else if (地图 == 220000000) {
            传送(地图,31);
            //地球防御本部
        } else if (地图 == 221000000) {
            传送(地图,11);
            //神木村
        } else if (地图 == 240000000) {
            传送(地图,17);
            //阿里安特
        } else if (地图 == 260000000) {
           传送(地图,22);
            //玛加提亚
        } else if (地图 == 261000000) {
            传送(地图,27);
            //武陵
        } else if (地图 == 250000000) {
            传送(地图,21);
            //百草堂
        } else if (地图 == 251000000) {
            传送(地图,6);
            //上海豫园
        } else if (地图 == 701000200) {
            传送(地图,15);
            //上海城市广场
        } else if (地图 == 701000100) {
            传送(地图,3);
            //水上市场
        } else if (地图 == 500000000) {
            传送(地图,13);
            //嵩山镇
        } else if (地图 == 702000000) {
            传送(地图,11);
            //中心商务区
        } else if (地图 == 540000000) {
            传送(地图,14);
            //驳船码头城
        } else if (地图 == 541000000) {
            传送(地图,16);
            //昭和商店街
        } else if (地图 == 801000300) {
            传送(地图,11);
            //新叶城
        } else if (地图 == 600000000) {
            传送(地图,39);
            //甘榜村
        } else if (地图 == 551000000) {
            传送(地图,4);
            //吉隆大都市
        } else if (地图 == 550000000) {
            传送(地图,6);
            //海盗中央走廊
        } else if (地图 == 120000200) {
            传送(地图,4);
        } else {
            cm.sendOk("传送点出错，默认为你回到射手村，已经为你重新配置该传送点。");
			cm.warp(100000000,0);
        }
    }
    cm.dispose();
}

function 传送( a, b) {
	var 类型 = 1;
    var 地图 = cm.getMapId();
	var 角色 = cm.getPlayer().id;
	cm.warp(910000000, 37);
	cm.设置传送点x(角色,类型,a);
	cm.设置传送点y(角色,类型,b);
}