/*
 蜗牛冒险岛(079)游戏服务端
 脚本：幸福村
 */
function start() {
    var 类型 = 8;
    var 地图 = cm.getMapId();
	var 角色 = cm.getPlayer().id;
    var 传送点 = cm.判断传送点x(角色, 类型);
    var 落脚点 = cm.判断传送点y(角色, 类型);
    if (地图 == 209000000) {
        if(传送点<=0){
			cm.warp(100000000,0);
			cm.sendOk("传送点出错，默认为你回到射手村，已经为你重新配置该传送点。");
		}else{
			cm.warp(传送点, 落脚点);
		}
		cm.设置传送点x(角色,类型,0);
		cm.设置传送点y(角色,类型,0);
    } else {
		//魔法密林
		if (地图 == 101000000) {
            传送(地图,0);
		//冰封雪域
        } else if (地图 == 211000000) {
            传送(地图,10);
		//玩具城
		} else if (地图 == 220000300) {
            传送(地图,2);
		//神木村
        } else if (地图 == 240000000) {
            传送(地图,9);
        } else {
            cm.warp(100000000, 0);
            cm.sendOk("传送点出错，默认为你回到射手村，已经为你重新配置该传送点。");
        }
    }
    cm.dispose();
}

function 传送( a, b) {
	var 类型 = 8;
    var 地图 = cm.getMapId();
	var 角色 = cm.getPlayer().id;
	cm.warp(209000000, 0);
	cm.设置传送点x(角色,类型,a);
	cm.设置传送点y(角色,类型,b);
}











