/*
 蜗牛冒险岛(079)游戏服务端
 脚本：旅馆
 */
function start() {
    var 类型 = 2;
    var 地图 = cm.getMapId();
	var 角色 = cm.getPlayer().id;
    var 传送点 = cm.判断传送点x(角色, 类型);
    var 落脚点 = cm.判断传送点y(角色, 类型);
    if (地图 == 749030000) {
        if(传送点<=0){
			cm.warp(100000000,0);
			cm.sendOk("传送点出错，默认为你回到射手村，已经为你重新配置该传送点。");
		}else{
			cm.warp(传送点, 落脚点);
		}
		cm.设置传送点x(角色,类型,0);
		cm.设置传送点y(角色,类型,0);
    } else {
        //射手村
        if (地图 == 100000000) {
            传送(地图,27);
        //废弃都市
        } else if (地图 == 103000000) {
            传送(地图,44);
        //天空之城
        } else if (地图 == 200000000) {
            传送(地图,6);
		 //玩具城
        } else if (地图 == 220000000) {
            传送(地图,9);
        } else {
            cm.warp(100000000, 4);
            cm.sendOk("传送点出错，默认为你回到射手村，已经为你重新配置该传送点。");
        }
    }
    cm.dispose();
}

function 传送( a, b) {
	var 类型 = 2;
    var 地图 = cm.getMapId();
	var 角色 = cm.getPlayer().id;
	cm.warp(749030000, 4);
	cm.设置传送点x(角色,类型,a);
	cm.设置传送点y(角色,类型,b);
}