var ÌÒ»¨ ="#fMap/MapHelper/weather/rose/4#";
var ½ğ·ãÒ¶ ="#fMap/MapHelper/weather/maple/2#";
var ºì·ãÒ¶ ="#fMap/MapHelper/weather/maple/1#";
status = -1;
var itemList = Array(
//Array(1402014, 10, 1, 1), //ÎÂ¶È¼Æ
//Array(1382045, 100, 1, 1), //»ğÁéÖé³¤ÕÈ
//Array(1382046, 100, 1, 1), //¶¾ÁéÖé³¤ÕÈ
//Array(1382047, 100, 1, 1), //±ùÁéÖé³¤ÕÈ
//Array(1382048, 100, 1, 1), //À×ÁéÖé³¤ÕÈ
Array(1122017, 5, 1, 1), //¾«Áéµõ×¹
//Array(2028004, 20, 1, 1), //ÉñÃØÊ±×°×øÆïËæ»úÏä
Array(4031504, 100, 1, 1),//À¶É«
//Array(4031505, 300, 1, 1),//³ÈÉ«
//Array(4031506, 200, 1, 1),//ÂÌÉ«
Array(2046913, 100, 1, 1), //ËŞÃü
Array(2613000, 300, 1, 1), //ĞÇ»ğ
Array(4000463, 200, 1, 1), //¹úÇì
Array(4310143, 300, 1, 1), //BOSSbi 
Array(4310009, 50, 1, 1), //10ĞÇ
//Array(2041139, 300, 1, 1), //½äÖ¸
Array(4011008, 50, 1, 1), //ï®
Array(4011007, 50, 1, 1), //ÔÂÊ¯
//Array(2070005, 400, 1, 1), //½ğÇ®ïÚ
//Array(2070006, 300, 1, 1), //³İÂÖïÚ
//Array(4170012, 200, 1, 1), //±Ø³É±Ò
Array(2049100, 400, 1, 1), //»ìãç¾í
Array(4001165, 300, 1, 1), //Ì«ÑôÉñµÄ´Í¸£
Array(4310057, 300, 1, 1), //ÅÜÉÌ¼ÍÄî±Ò
Array(4031456, 300, 1, 1), //·ãÒ¶Öé
//Array(4001129, 300, 1, 1), //Ã°ÏÕµº¼ÍÄî±Ò
Array(4002000, 300, 1, 1), //ÓÊÆ±
Array(4002001, 300, 1, 1), //ÓÊÆ±
Array(4002002, 300, 1, 1), //ÓÊÆ±
Array(4002003, 300, 1, 1), //ÓÊÆ±
Array(3010465, 300, 1, 1), //ÔÂÁÁÍä
Array(3010705, 300, 1, 1), //Ò¬×ÓÊ÷É³Ì²ÒÎ
Array(3010738, 300, 1, 1), //ÊÙË¾ÒÎ
Array(3013000, 300, 1, 1), //Å¯Å¯×À
Array(3012016, 300, 1, 1), //·ãÒ¶¼ÍÄîµÊ
Array(3012019, 300, 1, 1), //¶ñÁé¸½ÉíµÄÍŞÍŞÒÎ×Ó
Array(3012030, 300, 1, 1), //º£µÁµÄ·ıÂ²
Array(3012025, 300, 1, 1), //ÀËÂşÇïÇ§
Array(3012024, 300, 1, 1), //ÖíÖíµÊ
Array(3015144, 400, 1, 1), //¿ÕÆøÉ³·¢
Array(3015155, 400, 1, 1), //Ä§Å®µÄ·ÉÉ¨°Ñ
Array(3010044, 400, 1, 1), //Í¬Ò»ºìÉ¡ÏÂ
Array(3015132, 400, 1, 1), //Ê¥µ®Ê÷ÒÎ×Ó
Array(3010409, 400, 1, 1), //ÍÃ×Ó¼ÍÄî°æÒÎ×Ó
Array(3010054, 400, 1, 1), //ºôààºôàà´²
Array(4010000, 500, 1, 1), //¿ó
Array(4010001, 500, 1, 1), //¿ó
Array(4010002, 500, 1, 1), //¿ó
Array(4010003, 500, 1, 1), //¿ó
Array(4010004, 500, 1, 1), //¿ó
Array(4010005, 500, 1, 1), //¿ó
Array(4010006, 500, 1, 1), //¿ó
Array(4020000, 500, 1, 1), //¿ó
Array(4020001, 500, 1, 1), //¿ó
Array(4020002, 500, 1, 1), //¿ó
Array(4020003, 500, 1, 1), //¿ó
Array(4020004, 500, 1, 1), //¿ó
Array(4020005, 500, 1, 1), //¿ó
Array(4020006, 500, 1, 1), //¿ó
Array(4020007, 500, 1, 1), //¿ó
Array(4020008, 500, 1, 1), //¿ó
Array(4004000, 500, 1, 1), //Ë®¾§
Array(4004001, 500, 1, 1), //Ë®¾§
Array(4004002, 500, 1, 1), //Ë®¾§
Array(4004003, 500, 1, 1), //Ë®¾§
Array(4004004, 400, 1, 1), //Ë®¾§
//Array(4251202, 200, 1, 1), //Ë®¾§
Array(2022530, 200, 1, 1),//Ë«±¶±¬ÂÊ
Array(2450000, 200, 1, 1) //Ë«±¶BUFF




);

function start() {
	if (cm.canHold(1002677,1) == false || cm.canHold(2290017,1) == false || cm.canHold(4001126,1) == false){
	cm.sendOk("ÇëÈ·±£±³°üÓĞ³ä×ãµÄ¿Õ¼ä£¡");
    cm.dispose();	
	}else{
    action(1, 0, 0);
}}

function action(mode, type, selection) {
    if (mode == 1) {
        status++;
    } else {
        if (status == 0) {
            cm.sendOk("ÔÙ¼ûµÃ°ÑÓÍ¡£");
            cm.dispose();
        }
        status--;
    }
	if (status == 0) {
		if(cm.haveItem(2022034,10)) {
			var str1 = "\r\n";	
			for (var i = 0; i < itemList.length; i++){
				str1 += "#v"+itemList[i][0]+"#";
			}
			cm.sendYesNo(""+ºì·ãÒ¶+""+ºì·ãÒ¶+""+ºì·ãÒ¶+""+ºì·ãÒ¶+""+ºì·ãÒ¶+""+ºì·ãÒ¶+""+ºì·ãÒ¶+""+ºì·ãÒ¶+""+ºì·ãÒ¶+""+ºì·ãÒ¶+""+ºì·ãÒ¶+""+ºì·ãÒ¶+""+ºì·ãÒ¶+""+ºì·ãÒ¶+""+ºì·ãÒ¶+""+ºì·ãÒ¶+""+ºì·ãÒ¶+"\r\n              #r»¶Ó­À´µ½ÔÂÔÂÃ°ÏÕµº¶ËÎç½Ú³é½±#k\r\n"+ºì·ãÒ¶+""+ºì·ãÒ¶+""+ºì·ãÒ¶+""+ºì·ãÒ¶+""+ºì·ãÒ¶+""+ºì·ãÒ¶+""+ºì·ãÒ¶+""+ºì·ãÒ¶+""+ºì·ãÒ¶+""+ºì·ãÒ¶+""+ºì·ãÒ¶+""+ºì·ãÒ¶+""+ºì·ãÒ¶+""+ºì·ãÒ¶+""+ºì·ãÒ¶+""+ºì·ãÒ¶+""+ºì·ãÒ¶+"\r\n\r\n          #rÃ¿´Î³é½±ÏûºÄ#v2022034#*1£¬µ±Ç°ÓµÓĞ:#v2022034#*#c2022034#\r\n\r\n                   #b¶ËÎç½Ú³é½±½±³ØÈçÏÂ\r\n" + str1);
		} else {
			var str1 = "\r\n";	
			for (var i = 0; i < itemList.length; i++){
				str1 += "#v"+itemList[i][0]+"#";
			}
			cm.sendOk(""+ºì·ãÒ¶+""+ºì·ãÒ¶+""+ºì·ãÒ¶+""+ºì·ãÒ¶+""+ºì·ãÒ¶+""+ºì·ãÒ¶+""+ºì·ãÒ¶+""+ºì·ãÒ¶+""+ºì·ãÒ¶+""+ºì·ãÒ¶+""+ºì·ãÒ¶+""+ºì·ãÒ¶+""+ºì·ãÒ¶+""+ºì·ãÒ¶+""+ºì·ãÒ¶+""+ºì·ãÒ¶+""+ºì·ãÒ¶+"\r\n              #r»¶Ó­À´µ½ÔÂÔÂÃ°ÏÕµº¶ËÎç½Ú³é½±#k\r\n"+ºì·ãÒ¶+""+ºì·ãÒ¶+""+ºì·ãÒ¶+""+ºì·ãÒ¶+""+ºì·ãÒ¶+""+ºì·ãÒ¶+""+ºì·ãÒ¶+""+ºì·ãÒ¶+""+ºì·ãÒ¶+""+ºì·ãÒ¶+""+ºì·ãÒ¶+""+ºì·ãÒ¶+""+ºì·ãÒ¶+""+ºì·ãÒ¶+""+ºì·ãÒ¶+""+ºì·ãÒ¶+""+ºì·ãÒ¶+"\r\n\r\n          #rÃ¿´Î³é½±ÏûºÄ#v2022034#*10£¬µ±Ç°ÓµÓĞ:#v2022034#*#c2022034#\r\n\r\n                   #b¶ËÎç½Ú³é½±½±³ØÈçÏÂ\r\n" + str1);
			cm.dispose();
		}
	} else if (status == 1){	
		var chance = Math.floor(Math.random() * 500);
		var finalitem = Array();
		for (var i = 0; i < itemList.length; i++) {
			if (itemList[i][1] >= chance) {
				finalitem.push(itemList[i]);
			}
		}
		if (finalitem.length != 0) {
			var item;
			var random = new java.util.Random();
			var finalchance = random.nextInt(finalitem.length);
			var itemId = finalitem[finalchance][0];
			var quantity = finalitem[finalchance][2];
			var notice = finalitem[finalchance][3];
			item = cm.gainGachaponItem(itemId, quantity, "¶ËÎç½Ú³é½±", notice);
			if (item != -500) {
				cm.gainItem(2022034, -10);
				cm.sendOk("Äã»ñµÃÁË#b#t"+item+"#*"+quantity+"#k£¬¹§Ï²Äã£¡");
			} else {
				cm.sendOk("ÇëÄãÈ·ÈÏ±³°üµÄ×°±¸£¬ÏûºÄ£¬ÆäËûÀ¸ÊÇ·ñÓĞ×ã¹»µÄ¿Õ¼ä£¡");
			}
			cm.safeDispose();
		} else {
			cm.sendOk("ÄãÊ²Ã´¶¼³éµ½£¬·Ç³£ÒÅº¶£¡");
			cm.safeDispose();
        }
    }
}
