status = -1;
var head = "#fUI/UIWindow2.img/Quest/quest_info/summary_icon/summary#\r\n";
var icon = "#fUI/UIWindow2.img/QuestAlarm/BtQ/normal/0#";
var Star = "#fEffect/CharacterEff/1112904/2/1#";
/***************************************/
var cost = 10;  //每次消耗的元宝
var itemList = Array(
Array(1003797, 25, 1, 3), //高贵战士头盔 - (无描述)
Array(1003798, 25, 1, 3), //高贵流丹维奇帽 - (无描述)
Array(1003799, 25, 1, 3), //高贵游侠贝雷帽 - (无描述)
Array(1003800, 25, 1, 3), //高贵刺客软帽 - (无描述)
Array(1003801, 25, 1, 3), //高贵流浪者帽 - (无描述)
Array(1042254, 25, 1, 3), //鹰眼战士盔甲 - (无描述)
Array(1042255, 25, 1, 3), //鹰眼丹维奇长袍 - (无描述)
Array(1042256, 25, 1, 3), //鹰眼游侠斗篷 - (无描述)
Array(1042257, 25, 1, 3), //鹰眼刺客衬衣 - (无描述)
Array(1042258, 25, 1, 3), //鹰眼流浪者外衣 - (无描述)
Array(1062165, 25, 1, 3), //魔术师战士短裤 - (无描述)
Array(1062166, 25, 1, 3), //魔术师丹维奇短裤 - (无描述)
Array(1002845, 25, 1, 3), //魔术师丹维奇短裤 - (无描述)
Array(1062167, 25, 1, 3), //魔术师游侠短裤 - (无描述)
Array(1062168, 25, 1, 3), //魔术师刺客短裤 - (无描述)
Array(1062169, 25, 1, 3),  //魔术师流浪者短裤 - (无描述)
Array(2432069, 15, 1, 3),
Array(1102481, 10, 1, 3), // 暴君西亚戴斯披风 // (无描述)
Array(1102482, 10, 1, 3), // 暴君赫尔梅斯披风 // (无描述)
Array(1102483, 10, 1, 3), // 暴君凯伦披风 // (无描述)
Array(1102484, 10, 1, 3), // 暴君利卡昂披风 // (无描述)
Array(1102485, 10, 1, 3), // 暴君阿尔泰披风 // (无描述)
Array(1072743, 10, 1, 3), // 暴君西亚戴斯靴 // (无描述)
Array(1702457, 10, 1, 3), // 暴君西亚戴斯靴 // (无描述)
Array(1702459, 10, 1, 3), // 暴君西亚戴斯靴 // (无描述)
Array(1702508, 10, 1, 3), // 暴君西亚戴斯靴 // (无描述)
Array(1072744, 10, 1, 3), // 暴君赫尔梅斯靴 // (无描述)
Array(1702352, 10, 1, 3), // 暴君西亚戴斯靴 // (无描述)
Array(1702303, 10, 1, 3), // 暴君西亚戴斯靴 // (无描述)
Array(1702451, 10, 1, 3), // 暴君西亚戴斯靴 // (无描述)
Array(1072745, 10, 1, 3), // 暴君凯伦靴 // (无描述)
Array(1072746, 10, 1, 3), // 暴君利卡昂靴 // (无描述)
Array(1072747, 10, 1, 3), // 暴君阿尔泰靴 // (无描述)
Array(1132174, 10, 1, 3), // 暴君西亚戴斯腰带 // (无描述)
Array(1132175, 10, 1, 3), // 暴君赫尔梅斯腰带 // (无描述)
Array(1132176, 10, 1, 3), // 暴君凯伦腰带 // (无描述)
Array(1132177, 10, 1, 3),// 暴君利卡昂腰带 // (无描述)
Array(1132178, 10, 1, 3),// 暴君阿尔泰腰带 // (无描述)
Array(1082543, 10, 1, 3), // 暴君西亚戴斯手套 // (无描述)
Array(1082544, 10, 1, 3), // 暴君赫尔梅斯手套 // (无描述)
Array(1082545, 10, 1, 3), // 暴君凯伦手套 // (无描述)
Array(1082546, 10, 1, 3),// 暴君利卡昂手套 // (无描述)
Array(1082547, 10, 1, 3),// 暴君阿尔泰手套 // (无描述)
/*极真装备*/
Array(1032223, 30, 1, 3), // 最高级贝勒德耳环 // (无描述)
Array(1402037, 30, 1, 3), // 最高级贝勒德耳环 // (无描述)
Array(1113075, 30, 1, 3), // 最高级贝勒德戒指 // (无描述)
Array(1122267, 20, 1, 3), // 最高级贝勒德刻印吊坠 // (无描述)
Array(1132246, 30, 1, 3), // 最高级贝勒德刻印腰带 // (无描述)
Array(1032219, 30, 1, 3), // 遗忘之神话耳环 // (无描述)
Array(1022226, 30, 1, 3), // 独眼巨人之眼Lv.3 // (无描述)
Array(1102476, 30, 1, 3), // 诺巴西亚戴斯披风 // (无描述)
Array(1102477, 30, 1, 3), // 诺巴赫尔梅斯披风 // (无描述)
Array(1102478, 30, 1, 3), // 诺巴凯伦披风 // (无描述)
Array(1102479, 30, 1, 3), // 诺巴利卡昂披风 // (无描述)
Array(1102455, 30, 1, 3), // 诺巴阿尔泰披风 // (无描述)
Array(1072737, 30, 1, 3), // 诺巴西亚戴斯靴 // (无描述)
Array(1072738, 30, 1, 3), // 诺巴赫尔梅斯靴 // (无描述)
Array(1072739, 30, 1, 3), // 诺巴凯伦靴 // (无描述)
Array(1072740, 30, 1, 3), // 诺巴利卡昂靴 // (无描述)
Array(1072741, 30, 1, 3), // 诺巴阿尔泰靴 // (无描述)
Array(1132169, 30, 1, 3), // 诺巴西亚戴斯腰带 // (无描述)
Array(1132170, 20, 1, 3), // 诺巴赫尔梅斯腰带 // (无描述)
Array(1132171, 30, 1, 3), // 诺巴凯伦腰带 // (无描述)
Array(1132172, 30, 1, 3), // 诺巴利卡昂腰带 // (无描述)
Array(1132173, 30, 1, 3), // 诺巴阿尔泰腰带 // (无描述)
Array(1702202, 30, 1, 3), // 诺巴阿尔泰腰带 // (无描述)
Array(1702403, 30, 1, 3), // 诺巴阿尔泰腰带 // (无描述)
Array(1012134, 30, 1, 3), // 诺巴阿尔泰腰带 // (无描述)
Array(1102755, 30, 1, 3), // 诺巴阿尔泰腰带 // (无描述)
Array(1004126, 30, 1, 3), // 法弗纳天使手铳 // (无描述)
Array(1004597, 30, 1, 3), // 法弗纳死亡使者 // (无描述)
Array(1102359, 30, 1, 3), // 诺巴阿尔泰腰带 // (无描述)
Array(1082685, 30, 1, 3), // 诺巴阿尔泰腰带 // (无描述)
Array(1062074, 30, 1, 3), // 诺巴阿尔泰腰带 // (无描述)
Array(1702601, 30, 1, 3), // 诺巴阿尔泰腰带 // (无描述)
/*绝版椅子*/
Array(3015006, 20, 1, 3),
Array(3015001, 20, 1, 3),
Array(3010520, 20, 1, 3),
Array(3015401, 20, 1, 3),
Array(3015405, 20, 1, 3),
Array(3010681, 20, 1, 3),
Array(3015419, 20, 1, 3),
Array(3010788, 20, 1, 3),
Array(3010783, 20, 1, 3),
Array(3015000, 20, 1, 3),
Array(3015006, 20, 1, 3),
Array(3015234, 20, 1, 3),
Array(3015236, 20, 1, 3),
Array(3015060, 20, 1, 3),
Array(3015058, 20, 1, 3),
Array(3012031, 20, 1, 3),
Array(3012027, 20, 1, 3),
Array(3015112, 15, 1, 3),
Array(3015227, 15, 1, 3),
Array(3015439, 15, 1, 3),
Array(3015659, 15, 1, 3),
Array(3015564, 15, 1, 3),
Array(3015565, 15, 1, 3),
Array(3015566, 15, 1, 3),
Array(3015567, 15, 1, 3),
Array(1004126, 20, 1, 3), // 法弗纳天使手铳 // (无描述)
Array(1004597, 15, 1, 3), // 法弗纳死亡使者 // (无描述)
Array(1004598, 15, 1, 3), // 法弗纳精神之刃 // (无描述)
Array(1102841, 15, 1, 3), // 法弗纳精神之刃 // (无描述)
Array(1051452, 15, 1, 3), // 法弗纳精神之刃 // (无描述)
Array(1042036, 20, 1, 3), // 法弗纳精神之刃 // (无描述)
Array(1042037, 20, 1, 3), // 法弗纳精神之刃 // (无描述)
Array(1102964, 20, 1, 3), // 法弗纳精神之刃 // (无描述)
Array(1003919, 15, 1, 3), // 法弗纳精神之刃 // (无描述)
Array(3015971, 10, 1, 3), // 法弗纳精神之刃 // (无描述)
Array(3015568, 15, 1, 3),
Array(1322051, 15, 1, 3),
Array(1402044, 15, 1, 3),
Array(3015569, 10, 1, 3),
Array(3015570, 10, 1, 3),
Array(3015571, 20, 1, 3),
Array(3016101, 20, 1, 3), 
Array(3010680, 25, 1, 3),
Array(3010689, 35, 1, 3),
Array(3010738, 35, 1, 3),
Array(3010736, 35, 1, 3),
Array(3010737, 35, 1, 3),
Array(3010735, 30, 1, 3),
Array(1051152, 30, 1, 3),
Array(3010747, 30, 1, 3),
Array(3010748, 30, 1, 3),
Array(3010717, 30, 1, 3),
Array(3010718, 30, 1, 3),
Array(3010700, 30, 1, 3),
Array(3010761, 20, 1, 3),
Array(3010070, 20, 1, 3),
Array(3010760, 20, 1, 3),
Array(3010767, 20, 1, 3),
Array(3015845, 20, 1, 3),
//Array(3015847, 20, 1, 3),
Array(3015858, 20, 1, 3),
Array(3015857, 20, 1, 3),
Array(3015859, 20, 1, 3),
Array(3015860, 20, 1, 3),
Array(3015861, 20, 1, 3),
Array(3015865, 20, 1, 3),
Array(3015898, 20, 1, 3),
Array(3015901, 20, 1, 3),
Array(3010795, 30, 1, 3),
Array(3010794, 20, 1, 3),
Array(3010799, 20, 1, 3),
Array(3018085, 20, 1, 3),
Array(3018084, 30, 1, 3),
Array(3018083, 30, 1, 3),
Array(3010821, 20, 1, 3),
Array(3010822, 20, 1, 3),
Array(3010823, 20, 1, 3),
Array(3010836, 20, 1, 3),
Array(3010838, 20, 1, 3),
Array(3010845, 20, 1, 3),
Array(3010848, 20, 1, 3),
Array(3010849, 20, 1, 3),
Array(3010877, 20, 1, 3),
Array(3010935, 20, 1, 3),
Array(3010946, 20, 1, 3),
Array(3010955, 20, 1, 3),
Array(3010980, 20, 1, 3),
Array(3012027, 20, 1, 3),
Array(3012020, 20, 1, 3),
Array(3015009, 20, 1, 3),
Array(3015037, 20, 1, 3),
Array(3015032, 20, 1, 3),
Array(3015029, 20, 1, 3),
Array(3015091, 20, 1, 3),
Array(3015092, 20, 1, 3),
Array(3015089, 20, 1, 3),
Array(3015197, 20, 1, 3),
Array(3015211, 20, 1, 3),
Array(3015257, 30, 1, 3),
Array(3015258, 30, 1, 3),
Array(3015303, 30, 1, 3),
Array(3015302, 30, 1, 3),
Array(3015332, 20, 1, 3),
Array(3015330, 20, 1, 3),
Array(1312203, 3, 1, 3),
Array(1322255, 3, 1, 3),
Array(3015370, 20, 1, 3),
Array(3015369, 20, 1, 3),
Array(3015376, 20, 1, 3),
Array(3015521, 20, 1, 3),
Array(3015518, 20, 1, 3),
Array(3012010, 20, 1, 3),
Array(3015597, 20, 1, 3),
Array(3015587, 20, 1, 3),
Array(3015586, 20, 1, 3),
Array(3015665, 20, 1, 3),
Array(3015675, 20, 1, 3),
Array(3015691, 20, 1, 3),
Array(3015693, 20, 1, 3),
Array(3015712, 20, 1, 3),
Array(3015716, 20, 1, 3),
Array(3015725, 20, 1, 3)
);

var itemList3 = Array(
Array(3015778, 20, 1, 3),
Array(3012032, 20, 1, 3),
Array(3013009, 20, 1, 3),
Array(3015007, 20, 1, 3),
Array(3015430, 20, 1, 3),
Array(3014011, 10, 1, 3),
Array(3015571, 20, 1, 3),
Array(3015447, 20, 1, 3),
Array(3015235, 20, 1, 3),
Array(3015234, 20, 1, 3),
Array(3015236, 20, 1, 3),
Array(3015263, 20, 1, 3),
Array(3015111, 20, 1, 3),
Array(3015156, 20, 1, 3),
Array(3015058, 20, 1, 3),
Array(3015225, 15, 1, 3),
Array(3015517, 15, 1, 3),
Array(3015443, 15, 1, 3),
Array(3015235, 10, 1, 3),
Array(1702303, 20, 1, 3),
Array(1702352, 30, 1, 3),
Array(1702508, 20, 1, 3),
Array(1702534, 20, 1, 3),
Array(3015272, 10, 1, 3),
Array(1112964, 10, 1, 3),
Array(3015811, 20, 1, 3),
Array(2430888, 20, 1, 3),
Array(2436162, 20, 1, 3), // 漩涡手套 // (无描述)
Array(2435712, 10, 1, 3), // 漩涡手套 // (无描述)
Array(1702603, 40, 1, 3), // 诺巴阿尔泰腰带 // (无描述)
Array(1702602, 40, 1, 3), // 诺巴阿尔泰腰带 // (无描述)
Array(1702605, 40, 1, 3), // 诺巴阿尔泰腰带 // (无描述)
Array(1072531, 40, 1, 3), // 诺巴阿尔泰腰带 // (无描述)
Array(1702600, 40, 1, 3), // 诺巴阿尔泰腰带 // (无描述)
Array(1072808, 40, 1, 3), // 诺巴阿尔泰腰带 // (无描述)
Array(1042202, 40, 1, 3), // 诺巴阿尔泰腰带 // (无描述)
Array(1702209, 40, 1, 3), // 诺巴阿尔泰腰带 // (无描述)
Array(1702208, 40, 1, 3), // 诺巴阿尔泰腰带 // (无描述)
Array(1702212, 40, 1, 3), // 诺巴阿尔泰腰带 // (无描述)
Array(1702341, 40, 1, 3), // 诺巴阿尔泰腰带 // (无描述)
Array(1702459, 40, 1, 3), // 诺巴阿尔泰腰带 // (无描述)
Array(1702305, 40, 1, 3), // 诺巴阿尔泰腰带 // (无描述)
Array(3015526, 40, 1, 3), // 诺巴阿尔泰腰带 // (无描述)
Array(3010690, 20, 1, 3), // 诺巴阿尔泰腰带 // (无描述)
Array(3015599, 20, 1, 3), // 诺巴阿尔泰腰带 // (无描述)
Array(3015837, 20, 1, 3), // 诺巴阿尔泰腰带 // (无描述)
Array(1012131, 40, 1, 3), // 诺巴阿尔泰腰带 // (无描述)
Array(1072779, 40, 1, 3), // 诺巴阿尔泰腰带 // (无描述)
Array(1702616, 40, 1, 3), // 诺巴阿尔泰腰带 // (无描述)
Array(1702606, 40, 1, 3), // 诺巴阿尔泰腰带 // (无描述)
Array(3015788, 35, 1, 3),
Array(3015797, 45, 1, 3),
Array(3015800, 45, 1, 3),
Array(1202208, 50, 1, 3),
Array(1202207, 50, 1, 3),
Array(1202206, 50, 1, 3),
Array(1202214, 50, 1, 3),
Array(2614069, 2, 1, 3),
Array(2614067, 10, 1, 3),
Array(3015804, 35, 1, 3),
Array(1672064, 25, 1, 3),
Array(1672065, 25, 1, 3),
Array(1672067, 25, 1, 3),
Array(1672069, 25, 1, 3),
Array(1672073, 25, 1, 3),
Array(1672076, 25, 1, 3),
Array(1672077, 25, 1, 3),
Array(1672078, 25, 1, 3),
Array(1102910, 25, 1, 3),
Array(1672080, 20, 1, 3),
Array(1672058, 20, 1, 3),
Array(1102968, 20, 1, 3),
Array(3015813, 40, 1, 3),
Array(1051151, 35, 1, 3),
Array(1073241, 35, 1, 3),
Array(1004709, 35, 1, 3),
Array(1073240, 30, 1, 3),
Array(1051152, 25, 1, 3),
Array(1702778, 20, 1, 3),
Array(2433830, 20, 1, 3),
Array(1103034, 20, 1, 3),
Array(1115011, 20, 1, 3),
Array(1112198, 20, 1, 3),
Array(1102926, 20, 1, 3),
Array(1053040, 20, 1, 3),
Array(1050128, 20, 1, 3),
Array(1115025, 20, 1, 3),
Array(1115114, 20, 1, 3),
Array(1051153, 20, 1, 3), // 咆哮老虎情景喇叭// (无描述)
Array(3015238, 30, 1, 3),
Array(1212120, 1, 1, 3),
Array(1222113, 1, 1, 3),
Array(1242121, 1, 1, 3),
Array(1702692, 30, 1, 3),
Array(1702702, 30, 1, 3),
Array(1702703, 30, 1, 3),
Array(1702704, 30, 1, 3),
Array(1702705, 30, 1, 3),
Array(1702706, 30, 1, 3),
Array(1702711, 30, 1, 3),
Array(1702714, 30, 1, 3),
Array(1702713, 30, 1, 3),
Array(1702715, 30, 1, 3),
Array(1252098, 1, 1, 3),
Array(3015339, 20, 1, 3),
Array(3015342, 20, 1, 3),
Array(1262039, 1, 1, 3),
Array(3015438, 15, 1, 3),
Array(1004125, 15, 1, 3),
Array(1004799, 15, 1, 3),
Array(1302343, 1, 1, 3),
Array(1002663, 20, 1, 3),
Array(1112120, 20, 1, 3),
Array(1112118, 20, 1, 3),
Array(1112119, 20, 1, 3),
Array(1332279, 1, 1, 3),
Array(1032034, 20, 1, 3),
Array(1112228, 20, 1, 3),
Array(1112229, 20, 1, 3),
Array(1112230, 20, 1, 3),
Array(1073144, 20, 1, 3),
Array(1342104, 1, 1, 3),
Array(3015998, 15, 1, 3),
Array(1362140, 3, 1, 3),
Array(3015997, 20, 1, 3),
Array(1372228, 3, 1, 3),
Array(3015996, 10, 1, 3),
Array(1382265, 3, 1, 3),
Array(1702709, 30, 1, 3),
Array(1702713, 30, 1, 3),
Array(1702714, 30, 1, 3),
Array(1702715, 30, 1, 3),
Array(1702716, 30, 1, 3),
Array(1702717, 30, 1, 3),
Array(1402259, 3, 1, 3),
Array(1702718, 30, 1, 3),
Array(1702719, 30, 1, 3),
Array(1702720, 30, 1, 3),
Array(1422189, 3, 1, 3),
Array(1702721, 30, 1, 3),
Array(1432218, 3, 1, 3),
Array(3018051, 10, 1, 3),
Array(1442274, 3, 1, 3),
Array(1702722, 30, 1, 3),
Array(1702725, 30, 1, 3),
Array(1702723, 30, 1, 3),
Array(1412181, 3, 1, 3),
Array(1702728, 30, 1, 3),
Array(1702727, 30, 1, 3),
Array(1472265, 3, 1, 3),
Array(3018053, 10, 1, 3),
Array(1492235, 3, 1, 3),
Array(2614024, 30, 1, 3),
Array(1452257, 3, 1, 3),
Array(3018050, 10, 1, 3),
Array(1522143, 3, 1, 3),
Array(1702726, 30, 1, 3),
Array(1702679, 30, 1, 3),
Array(1702684, 30, 1, 3),
Array(1532150, 3, 1, 3),
Array(3018024, 10, 1, 3),
Array(1542117, 3, 1, 3),
Array(2614024, 30, 1, 3),
Array(1552119, 3, 1, 3),
Array(1702669, 30, 1, 3),
Array(1582023, 3, 1, 3),
Array(1112183, 20, 1, 3),
Array(1112296, 20, 1, 3),
Array(1152198, 3, 1, 3),
Array(1004808, 3, 1, 3),
Array(3018025, 30, 1, 3),
Array(2614023, 30, 1, 3),
Array(1004810, 3, 1, 3),
Array(2614023, 30, 1, 3),
Array(1004811, 3, 1, 3),
Array(1702686, 30, 1, 3),
Array(1702687, 30, 1, 3),
Array(1004809, 3, 1, 3),
Array(1702688, 30, 1, 3),
Array(1004812, 3, 1, 3),
Array(1702779, 20, 1, 3),
Array(1102940, 3, 1, 3),
Array(1102941, 3, 1, 3),
Array(1702780, 20, 1, 3),
Array(1102942, 3, 1, 3),
Array(3018049, 10, 1, 3),
Array(1102943, 3, 1, 3),
Array(1702799, 20, 1, 3),
Array(1102944, 3, 1, 3),
Array(1042314, 20, 1, 3),
Array(1053063, 3, 1, 3),
Array(1115147, 20, 1, 3),
Array(1053064, 3, 1, 3),
Array(1042320, 20, 1, 3),
Array(1042333, 20, 1, 3),
Array(1042334, 20, 1, 3),
Array(1042336, 20, 1, 3),
Array(1053065, 3, 1, 3),
Array(1202160, 20, 1, 3),
Array(1202161, 20, 1, 3),
Array(1202162, 20, 1, 3),
Array(1202163, 20, 1, 3),
Array(1202164, 20, 1, 3),
Array(1053066, 3, 1, 3),
Array(1115057, 20, 1, 3),
Array(1053067, 3, 1, 3),
Array(1702801, 20, 1, 3),
Array(1073158, 3, 1, 3),
Array(1702801, 20, 1, 3),
Array(1073159, 3, 1, 3),
Array(1042337, 20, 1, 3),
Array(1042338, 20, 1, 3),
Array(1073160, 3, 1, 3),
Array(1702802, 20, 1, 3),
Array(1073161, 3, 1, 3),
Array(1102807, 30, 1, 3),
Array(2614002, 35, 1, 3), // 漩涡手套 // (无描述)
Array(2614002, 5, 3, 3), // 漩涡手套 // (无描述)
Array(2614001, 55, 3, 3), // 漩涡手套 // (无描述)
Array(1073162, 3, 1, 3),
Array(1004724, 30, 1, 3),
Array(1082695, 3, 1, 3),
Array(1053280, 20, 1, 3),
Array(1053281, 20, 1, 3),
Array(1115146, 20, 1, 3),
Array(1082696, 3, 1, 3),
Array(1053280, 20, 1, 3),
Array(1053281, 20, 1, 3),
Array(3018027, 20, 1, 3),
Array(1082697, 3, 1, 3),
Array(1702812, 20, 1, 3),
Array(1082698, 3, 1, 3),
Array(1702803, 20, 1, 3),
Array(1082699, 3, 1, 3),
Array(3018026, 25, 1, 3),
Array(1152196, 3, 1, 3),
Array(1112238, 20, 1, 3),
Array(1112135, 20, 1, 3),
Array(1152197, 3, 1, 3),
Array(1115058, 20, 1, 3),
Array(1152198, 3, 1, 3),
Array(1702813, 20, 1, 3),
Array(1152199, 3, 1, 3),
Array(1702814, 20, 1, 3),
Array(1152200, 3, 1, 3),
Array(1012438, 20, 1, 3) // 漩涡文身 // (无描述)
);

var itemList2 = Array(
Array(1022211, 25, 1, 3), // 漩涡眼镜 // (无描述)
Array(1032224, 25, 1, 3), // 漩涡耳环 // (无描述)
Array(1122269, 25, 1, 3), // 漩涡吊坠 // (无描述)
Array(1132247, 25, 1, 3), // 漩涡腰带 // (无描述)
Array(1152160, 25, 1, 3), // 漩涡护肩 // (无描述)
Array(1003976, 25, 1, 3), // 漩涡帽子 // (无描述)
Array(1102623, 25, 1, 3), // 漩涡披风 // (无描述)
Array(1082556, 25, 1, 3), // 漩涡手套 // (无描述)
Array(1702261, 25, 1, 3), // 漩涡眼镜 // (无描述)
Array(1402014, 25, 1, 3), // 漩涡耳环 // (无描述)
Array(1302080, 25, 1, 3), // 漩涡吊坠 // (无描述)
Array(1002863, 25, 1, 3), // 漩涡腰带 // (无描述)
Array(1003141, 25, 1, 3), // 漩涡护肩 // (无描述)
Array(1003269, 25, 1, 3), // 漩涡帽子 // (无描述)
Array(1103268, 25, 1, 3), // 漩涡披风 // (无描述)
Array(1082220, 20, 1, 3), // 漩涡手套 // (无描述)
Array(1003392, 20, 1, 3), // 漩涡眼镜 // (无描述)
Array(1002839, 20, 1, 3), // 漩涡耳环 // (无描述)
Array(1003588, 30, 1, 3), // 漩涡吊坠 // (无描述)
Array(1003597, 30, 1, 3), // 漩涡腰带 // (无描述)
Array(1115102, 20, 1, 3), // 暴君赫尔梅斯手套 // (无描述)
Array(1115104, 20, 1, 3), // 暴君凯伦手套 // (无描述)
Array(1702712, 20, 1, 3),// 暴君利卡昂手套 // (无描述)
Array(1003760, 20, 1, 3), // 漩涡护肩 // (无描述)
Array(1003758, 30, 1, 3), // 漩涡帽子 // (无描述)
Array(1103910, 20, 1, 3), // 漩涡披风 // (无描述)
Array(1004029, 20, 1, 3), // 漩涡手套 // (无描述)
Array(1004038, 50, 1, 3), // 漩涡眼镜 // (无描述)
Array(1004027, 50, 1, 3), // 漩涡耳环 // (无描述)
Array(1302080, 50, 1, 3), // 漩涡吊坠 // (无描述)
Array(1004028, 50, 1, 3), // 漩涡腰带 // (无描述)
Array(1003141, 50, 1, 3), // 漩涡护肩 // (无描述)
Array(1040194, 55, 1, 3), // 漩涡手套 // (无描述)
Array(1042118, 55, 1, 3), // 漩涡眼镜 // (无描述)
Array(1042164, 55, 1, 3), // 漩涡耳环 // (无描述)
Array(1042182, 55, 1, 3), // 漩涡吊坠 // (无描述)
Array(1042173, 55, 1, 3), // 漩涡腰带 // (无描述)
Array(3015694, 25, 1, 3), // 漩涡腰带 // (无描述)
Array(3015695, 25, 1, 3), // 漩涡腰带 // (无描述)
Array(1042120, 55, 1, 3), // 漩涡护肩 // (无描述)
Array(1042121, 55, 1, 3), // 漩涡帽子 // (无描述)
Array(1042172, 55, 1, 3), // 漩涡披风 // (无描述)
Array(1042183, 55, 1, 3), // 漩涡手套 // (无描述)
Array(1042208, 55, 1, 3), // 漩涡披风 // (无描述)
Array(1042315, 55, 1, 3), // 漩涡手套 // (无描述)
Array(1042316, 55, 1, 3), // 漩涡披风 // (无描述)
Array(1042350, 50, 1, 3), // 漩涡手套 // (无描述)
Array(1004027, 50, 1, 3), // 漩涡耳环 // (无描述)
Array(1302080, 50, 1, 3), // 漩涡吊坠 // (无描述)
Array(1004028, 50, 1, 3), // 漩涡腰带 // (无描述)
Array(1003141, 50, 1, 3), // 漩涡护肩 // (无描述)
Array(1004038, 50, 1, 3), // 漩涡眼镜 // (无描述)
Array(1004027, 50, 1, 3), // 漩涡耳环 // (无描述)
Array(1302080, 50, 1, 3), // 漩涡吊坠 // (无描述)
Array(1004028, 50, 1, 3), // 漩涡腰带 // (无描述)
Array(1003141, 50, 1, 3), // 漩涡护肩 // (无描述)
Array(1052669, 50, 1, 3), // 漩涡皇家外套 // (无描述)
Array(1072870, 30, 1, 3), // 漩涡鞋 // (无描述)
Array(1212089, 30, 1, 3), // 漩涡双头杖 // (无描述)
Array(1222084, 30, 1, 3), // 漩涡灵魂手铳 // (无描述)
Array(1232084, 30, 1, 3), // 漩涡恶魔剑 // (无描述)
Array(1242090, 20, 1, 3), // 漩涡锁链剑 // (无描述)
Array(1252033, 20, 1, 3), // 漩涡虎梳魔法棒 // (无描述)
Array(1302297, 20, 1, 3), // 漩涡剑 // (无描述)
Array(1312173, 50, 1, 3), // 漩涡斧 // (无描述)
Array(1322223, 50, 1, 3), // 漩涡锤 // (无描述)
Array(1332247, 50, 1, 3), // 漩涡匕首 // (无描述)
Array(1342090, 50, 1, 3), // 漩涡刀  // (无描述)
Array(1362109, 50, 1, 3), // 漩涡手杖 // (无描述)
Array(1372195, 50, 1, 3), // 漩涡短杖 // (无描述)
Array(1382231, 50, 1, 3), // 漩涡长杖 // (无描述)
Array(1402220, 50, 1, 3), // 漩涡双手剑 // (无描述)
Array(1412153, 50, 1, 3), // 漩涡双手战斧 // (无描述)
Array(1422158, 50, 1, 3), // 漩涡巨锤 // (无描述)
Array(1432187, 50, 1, 3), // 漩涡矛 // (无描述)
Array(1442242, 50, 1, 3), // 漩涡戟 // (无描述)
Array(1452226, 50, 1, 3), // 漩涡弓 // (无描述)
Array(1462213, 50, 1, 3), // 漩涡弩 // (无描述)
Array(1472235, 50, 1, 3), // 漩涡拳甲 // (无描述)
Array(1482189, 50, 1, 3), // 漩涡冲拳 // (无描述)
Array(1492199, 50, 1, 3), // 漩涡手铳 // (无描述)
Array(1522113, 50, 1, 3), // 漩涡双翼弩 // (无描述)
Array(1532118, 50, 1, 3), // 漩涡手炮 // (无描述)
Array(1542072, 50, 1, 3), // 漩涡武士之剑 // (无描述)
Array(1552072, 50, 1, 3), // 漩涡之风 // (无描述)
Array(1052537, 50, 1, 3), // 漩涡拳甲 // (无描述)
Array(1052201, 50, 1, 3), // 漩涡冲拳 // (无描述)
Array(1052200, 30, 1, 3), // 漩涡手铳 // (无描述)
Array(1051424, 50, 1, 3), // 漩涡双翼弩 // (无描述)
Array(1072337, 50, 1, 3), // 漩涡手炮 // (无描述)
Array(1073090, 50, 1, 3), // 漩涡武士之剑 // (无描述)
Array(1073091, 30, 1, 3), // 漩涡之风 // (无描述)
Array(1073091, 20, 1, 3), // 漩涡之风 // (无描述)
Array(1073092, 20, 1, 3), // 漩涡之风 // (无描述)
Array(2436114, 20, 1, 3), // 漩涡之风 // (无描述)
Array(1052846, 55, 1, 3), // 漩涡之风 // (无描述)
Array(2434007, 50, 1, 3), // 漩涡之风 // (无描述)
Array(2435712, 20, 1, 3), // 漩涡之风 // (无描述)
Array(2435153, 10, 1, 3), // 漩涡之风 // (无描述)
Array(1072278, 50, 1, 3), // 漩涡之风 // (无描述)
Array(3015059, 20, 1, 3), // 咆哮老虎情景喇叭// (无描述)
Array(3015014, 10, 1, 3), // 咆哮老虎情景喇叭// (无描述)
Array(1702302, 20, 1, 3), // 咆哮老虎情景喇叭// (无描述)
Array(3015972, 2, 1, 3), // 咆哮老虎情景喇叭// (无描述)
Array(1073109, 20, 1, 3), // 咆哮老虎情景喇叭// (无描述)
Array(1702357, 20, 1, 3), // 咆哮老虎情景喇叭// (无描述)
Array(1005045, 20, 1, 3), // 咆哮老虎情景喇叭// (无描述)
Array(1005046, 20, 1, 3), // 咆哮老虎情景喇叭// (无描述)
Array(1053247, 20, 1, 3), // 咆哮老虎情景喇叭// (无描述)
Array(1053242, 20, 1, 3), // 咆哮老虎情景喇叭// (无描述)
Array(1053155, 20, 1, 3), // 咆哮老虎情景喇叭// (无描述)
Array(1004878, 10, 1, 3), // 咆哮老虎情景喇叭// (无描述)
Array(1053116, 10, 1, 3), // 咆哮老虎情景喇叭// (无描述)
Array(1102975, 10, 1, 3), // 咆哮老虎情景喇叭// (无描述)
Array(3010879, 10, 1, 3), // 咆哮老虎情景喇叭// (无描述)
Array(1702750, 10, 1, 3), // 咆哮老虎情景喇叭// (无描述)
Array(1102818, 20, 1, 3), // 咆哮老虎情景喇叭// (无描述)
Array(1112196, 20, 1, 3), // 咆哮老虎情景喇叭// (无描述)
Array(1004756, 10, 1, 3), // 咆哮老虎情景喇叭// (无描述)
Array(1112956, 20, 1, 3), // 咆哮老虎情景喇叭// (无描述)
Array(1102842, 20, 1, 3), // 咆哮老虎情景喇叭// (无描述)
Array(1004332, 20, 1, 3), // 咆哮老虎情景喇叭// (无描述)
Array(1004386, 20, 1, 3), // 咆哮老虎情景喇叭// (无描述)
Array(1052911, 20, 1, 3), // 咆哮老虎情景喇叭// (无描述)
Array(3015973, 10, 1, 3), // 咆哮老虎情景喇叭// (无描述)
Array(2613064, 10, 1, 3), // 咆哮老虎情景喇叭// (无描述)
Array(2612076, 10, 1, 3), // 咆哮老虎情景喇叭// (无描述)
Array(2612077, 15, 1, 3), // 咆哮老虎情景喇叭// (无描述)
Array(2616074, 10, 1, 3), // 咆哮老虎情景喇叭// (无描述)
Array(2616075, 10, 1, 3), // 咆哮老虎情景喇叭// (无描述)
Array(2615043, 15, 1, 3), // 咆哮老虎情景喇叭// (无描述)
Array(2615044, 10, 1, 3), // 咆哮老虎情景喇叭// (无描述)
Array(3994075, 5, 100, 3), // 咆哮老虎情景喇叭// (无描述)
Array(2048821, 20, 1, 3), // 咆哮老虎情景喇叭// (无描述)
Array(2048822, 25, 1, 3), // 咆哮老虎情景喇叭// (无描述)
Array(1050418, 20, 1, 3), // 咆哮老虎情景喇叭// (无描述)
Array(1051487, 20, 1, 3), // 咆哮老虎情景喇叭// (无描述)
Array(2432206, 15, 1, 3), // 咆哮老虎情景喇叭// (无描述)
Array(2613000, 40, 1, 3), // 咆哮老虎情景喇叭// (无描述)
Array(2613001, 35, 1, 3), // 咆哮老虎情景喇叭// (无描述)
Array(2612010, 35, 1, 3), // 咆哮老虎情景喇叭// (无描述)
Array(1051150, 30, 1, 3),
Array(3015705, 5, 1, 3),
Array(1442039, 55, 1, 3), // 咆哮老虎情景喇叭// (无描述)
Array(2434996, 25, 1, 3), // 咆哮老虎情景喇叭// (无描述)
Array(1004156, 30, 1, 3), // 咆哮老虎情景喇叭// (无描述)
Array(1004157, 30, 1, 3), // 咆哮老虎情景喇叭// (无描述)
Array(1004211, 35, 1, 3), // 咆哮老虎情景喇叭// (无描述)
Array(3010813, 15, 1, 3), // 咆哮老虎情景喇叭// (无描述)
Array(1702675, 50, 1, 3), // 咆哮老虎情景喇叭// (无描述)
Array(2047818, 50, 1, 3), // 咆哮老虎情景喇叭// (无描述)
Array(2612010, 50, 1, 3), // 咆哮老虎情景喇叭// (无描述)
Array(2432206, 50, 1, 3), // 咆哮老虎情景喇叭// (无描述)
Array(2435824, 50, 1, 3), // 咆哮老虎情景喇叭// (无描述)
Array(2047818, 50, 1, 3), // 咆哮老虎情景喇叭// (无描述)
Array(2613000, 35, 1, 3), // 咆哮老虎情景喇叭// (无描述)
Array(2613001, 35, 1, 3), // 咆哮老虎情景喇叭// (无描述)
Array(2612010, 20, 1, 3), // 咆哮老虎情景喇叭// (无描述)
Array(3015378, 20, 1, 3), // 咆哮老虎情景喇叭// (无描述)
Array(1002721, 20, 1, 3), // 咆哮老虎情景喇叭// (无描述)
Array(2435824, 30, 1, 3), // 法弗纳皇刀正宗 // (无描述)
Array(3010894, 40, 1, 3), // 咆哮老虎情景喇叭// (无描述)
Array(3015788, 30, 1, 3), // 咆哮老虎情景喇叭// (无描述)
Array(3015787, 30, 1, 3), // 咆哮老虎情景喇叭// (无描述)
Array(3015075, 30, 1, 3), // 咆哮老虎情景喇叭// (无描述)
Array(3015912, 20, 1, 3), // 咆哮老虎情景喇叭// (无描述)
Array(3015036, 30, 1, 3), // 咆哮老虎情景喇叭// (无描述)
Array(3010843, 40, 1, 3), // 咆哮老虎情景喇叭// (无描述)
Array(3015873, 30, 1, 3), // 咆哮老虎情景喇叭// (无描述)
Array(1004403, 30, 1, 3), // 咆哮老虎情景喇叭// (无描述)
Array(1702736, 10, 1, 3), // 咆哮老虎情景喇叭// (无描述)
Array(3015600, 40, 1, 3), // 咆哮老虎情景喇叭// (无描述)
Array(3010820, 40, 1, 3), // 咆哮老虎情景喇叭// (无描述)
Array(3014019, 40, 1, 3), // 咆哮老虎情景喇叭// (无描述)
Array(3010842, 40, 1, 3), // 咆哮老虎情景喇叭// (无描述)
Array(3015873, 20, 1, 3), // 咆哮老虎情景喇叭// (无描述)
Array(3015408, 40, 1, 3), // 咆哮老虎情景喇叭// (无描述)
Array(3015642, 40, 1, 3), // 咆哮老虎情景喇叭// (无描述)
Array(3010690, 30, 1, 3), // 咆哮老虎情景喇叭// (无描述)
Array(2613050, 40, 1, 3), // 咆哮老虎情景喇叭// (无描述)
Array(2613051, 40, 1, 3), // 咆哮老虎情景喇叭// (无描述)
Array(2612061, 50, 1, 3), // 咆哮老虎情景喇叭// (无描述)
Array(2612062, 50, 1, 3), // 咆哮老虎情景喇叭// (无描述)
Array(2616061, 50, 1, 3), // 咆哮老虎情景喇叭// (无描述)
Array(2616062, 50, 1, 3), // 咆哮老虎情景喇叭// (无描述)
Array(2615031, 50, 1, 3), // 咆哮老虎情景喇叭// (无描述)
Array(2613050, 50, 1, 3), // 咆哮老虎情景喇叭// (无描述)
Array(2613051, 50, 1, 3), // 咆哮老虎情景喇叭// (无描述)
Array(2612061, 40, 1, 3), // 咆哮老虎情景喇叭// (无描述)
Array(2612062, 40, 1, 3), // 咆哮老虎情景喇叭// (无描述)
Array(2616061, 40, 1, 3), // 咆哮老虎情景喇叭// (无描述)
Array(2616062, 40, 1, 3), // 咆哮老虎情景喇叭// (无描述)
Array(2615031, 40, 1, 3), // 咆哮老虎情景喇叭// (无描述)
Array(2615032, 40, 1, 3), // 咆哮老虎情景喇叭// (无描述)
Array(2049376, 10, 1, 3), // 星之力20星强化券// (无描述)
Array(1082656, 20, 1, 3), // 法弗纳魔力源泉杖 // (无描述)
Array(2435048, 40, 1, 3), // 法弗纳魔力源泉杖 // (无描述)
Array(2432206, 40, 1, 3), // 法弗纳魔力源泉杖 // (无描述)
Array(3015970, 20, 1, 3), // 法弗纳精神之刃 // (无描述)
Array(1004599, 20, 1, 3), // 法弗纳精神之刃 // (无描述)
Array(1212063, 20, 1, 3), // 法弗纳魔力源泉杖 // (无描述)
Array(1222058, 20, 1, 3), // 法弗纳天使手铳 // (无描述)
Array(1232057, 20, 1, 3), // 法弗纳死亡使者 // (无描述)
Array(1242060, 20, 1, 3), // 法弗纳精神之刃 // (无描述)
Array(1702520, 20, 1, 3), // 法弗纳急速之刃 // (无描述)
Array(1102749, 20, 1, 3), // 法弗纳急速之刃 // (无描述)
Array(1242061, 20, 1, 3), // 法弗纳精神之刃 // (无描述)
Array(1103033, 20, 1, 3), // 法弗纳天使手铳 // (无描述)
Array(1052910, 20, 1, 3), // 法弗纳天使手铳 // (无描述)
Array(1103013, 20, 1, 3), // 法弗纳死亡使者 // (无描述)
Array(1103007, 20, 1, 3), // 法弗纳精神之刃 // (无描述)
Array(1702302, 20, 1, 3), // 法弗纳精神之刃 // (无描述)
Array(1103027, 20, 1, 3), // 法弗纳精神之刃 // (无描述)
Array(1002863, 20, 1, 3), // 法弗纳精神之刃 // (无描述)
Array(1252015, 20, 1, 3), // 法弗纳北极星魔法棒 // (无描述)
Array(1262016, 20, 1, 3), // 法弗纳ESP限制器 // (无描述)
Array(1302275, 20, 1, 3), // 法弗纳银槲之剑 // (无描述)
Array(1312153, 20, 1, 3), // 法弗纳双刃切肉斧 // (无描述)
Array(1322203, 20, 1, 3), // 法弗纳戈耳迪锤 // (无描述)
Array(1332225, 20, 1, 3), // 法弗纳大马士革剑 // (无描述)
Array(1342082, 20, 1, 3), // 法弗纳急速之刃 // (无描述)
Array(1102916, 20, 1, 3), // 法弗纳银槲之剑 // (无描述)
Array(1102919, 20, 1, 3), // 法弗纳双刃切肉斧 // (无描述)
Array(1102938, 20, 1, 3), // 法弗纳戈耳迪锤 // (无描述)
Array(1102860, 20, 1, 3), // 法弗纳大马士革剑 // (无描述)
Array(1102861, 20, 1, 3), // 法弗纳急速之刃 // (无描述)
Array(2435824, 20, 1, 3), // 法弗纳风翼弩 // (无描述)
Array(1362090, 20, 1, 3), // 法弗纳洞察手杖 // (无描述)
Array(1372177, 20, 1, 3), // 法弗纳魔力夺取者 // (无描述)
Array(1382208, 20, 1, 3), // 法弗纳魔冠之杖 // (无描述)
Array(1302196, 20, 1, 3), // 法弗纳忏悔之剑 // (无描述)
Array(1412135, 20, 1, 3), // 法弗纳战斗切肉斧 // (无描述)
Array(1422140, 20, 1, 3), // 法弗纳闪电锤 // (无描述)
Array(1432167, 20, 1, 3), // 法弗纳贯雷枪 // (无描述)
Array(1442223, 10, 1, 3), // 法弗纳半月宽刃斧 // (无描述)
Array(1452205, 10, 1, 3), // 法弗纳追风者 // (无描述)
Array(1462193, 10, 1, 3), // 法弗纳风翼弩 // (无描述)
Array(2430640, 10, 1, 3), // 法弗纳风翼弩 // (无描述)
Array(1472214, 10, 1, 3), // 法弗纳危险之手 // (无描述)
Array(1482168, 10, 1, 3), // 法弗纳巨狼之爪 // (无描述)
Array(1492179, 10, 1, 3), // 法弗纳左轮枪 // (无描述)
Array(2432206, 10, 1, 3), // 法弗纳左轮枪 // (无描述)
Array(2612076, 10, 3, 3), // 法弗纳左轮枪 // (无描述)
Array(1112199, 10, 1, 3), // 法弗纳左轮枪 // (无描述)
Array(1115015, 10, 3, 3), // 法弗纳左轮枪 // (无描述)
Array(1522094, 10, 1, 3), // 法弗纳双风翼弩 // (无描述)
Array(1532098, 10, 1, 3), // 法弗纳荣耀炮 // (无描述)
Array(1542063, 10, 1, 3), // 法弗纳皇刀正宗 // (无描述))
Array(2435824, 10, 2, 3), // 法弗纳皇刀正宗 // (无描述)
Array(1552063, 10, 1, 3) // 法弗纳煌扇蓝姬 // (无描述)
);
function start() {
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == 1) {
        status++;
    } else {
        if (status == 0) {
            cm.sendOk("不想使用吗？…我的肚子里有各类#b奇特座椅或卷轴、装备、新奇道具#k哦！");
            cm.dispose();
        }
        status--;

    }
    if (status == 0) {
        var txt = Star + Star + Star + Star + Star + Star + Star + Star + Star + Star + Star + Star + Star + Star + Star + Star + Star + Star + Star + Star + Star + "\r\n";
        txt += "#d想抽奖吗？精品道具入谁家？我这里有150-160不等高级道具（不抽中不扣除元宝 ）\r\n";
        txt += "魔方 卷轴 奇特座椅 限量时装 等新奇道具 [ #r还在等待吗#d ]\r\n\r\n#k";
        txt += "#d[ #r#h ##d ] 玩家元宝：#r" + cm.getRMB() + "　#b[ 20 元宝抽一回 #d ]\r\n#k";
        txt += "#b#L0#开始抽奖 [ 可抽 #r" + parseInt(cm.getRMB() / cost) + "#b 次 ]\t\t#r☆奖品图鉴如下☆#l#k\r\n\r\n";
        txt += Star + Star + Star + Star + Star + Star + Star + Star + Star + Star + Star + Star + Star + Star + Star + Star + Star + Star + Star + Star + Star + "\r\n";
        txt += "#i3018083##i3018084##i3018085##i3018074##i3018091##i2614069##i26140671005116##i1005119##i1005117##i1005118##i1005120##i1005146##i1005147##i1005148##i3018049##i3018050##i3018051##i3018052##i3018053##i3018024##i3018025##i3018026##i3018027##i1053280##i1005060##i1005064##i1005090##i1005091##i1005095##i1005096##i1005097##i1005098##i1005099##i1005102##i1005103##i1115057##i1115146##i1115058##i1115147##i1702779##i1702780##i1702801##i1702791##i1702803##i1702802##i1702812##i1702813##i1702814##i3015996##i3015997##i3015998##i1702669##i1702692##i1702693##i1702702##i1702706##i1702711##i1702705##i1702713##i1702714##i1702715##i1702716##i1702719##i1702720##i1702723##i1702728##i1702727##i1702729##i1042336##i1042337##i1042338##i1042333##i1042334##i1042314##i1202161##i1202162##i1202163##i1202164##i1202160##i1202165##i1112296##i1112183##i1004799##i1004125##i3015438##i2433830##i1702733##i1102968##i1004724##i1102807##i1115011##i1112198##i1002663##i1112120##i1112118##i1112119##i1032034##i1112228##i1112229##i1112964##i1102910##i1073241##i1073240##i1702675##i1050418##i1051487##i1112135##i1112238##i1702778##i1103034##i1004756##i1053040##i1102926##i1073144##i1115025##i1115114##i1112199##i1115015##i1052846##i1004156##i1004157##i1004211##i1702736##i3015971##i3010853##i3015970##i3015972##i3015973##i13015971##i3010879##i1702520##i1102749##i1073109##i1005045##i1005046##i1053247##i1053242##i1004878##i1102975##i1053116##i1702750##i1112196##i1004884##i1112956##i1102842##i1004386##i1004332##i1052910##i1052911##i3015823##i3015482##i3016204##i2431980##i2432206##i2436162##i2436114##i2434007##i2435153##i2430683##i1082565##i2022531##i2022530##i1002721##i1002845##i1050133##i1050134##i1050457##i1050458##i1051150##i1051152##i1051153##i1051151##i1004126##i1004597##i1004598##i1004599##i3015845##i3015847##i3015858##i3015857##i3015859##i3015860##i3015861##i3015865##i3015898##i3015901##i1115102##i1115014##i1702712##i1702305##i1702352##i1702209##i1702208##i1702459##i1702212##i1702403##i1702382##i1702600##i1702601##i1702603##i1702605##i1062074##i1072529##i1072531##i1072808##i1072779##i1082685##i1102359##i1102755##i1012134##i1702202##i1082685##i1004403##i3015705##i3014020##i3010980##i3010965##i3010739##i3010756##i3015756##i3015526##i3010690##i3015667##i3015599##i3015541##i3015837##i3010894##i3015059##i3015787##i3010820##i3015642##i3010843##i3014019##i3015873##i3015075##i3015451##i3010842##i3015600##i3015408##i3015788##i3015748##i3016100##i3016101##i3015002##i3015059##i3010813##i3015820##i3015378##i3015694##i3015695##i3015014##i3015419##i3015401##i3015405##i3014011##i3015006##i3010783##i3010788##i3010520##i3010681##i3012031##i3012032##i3010621##i3012027##i30105051##i3015058##i3015060##i3015111##i3015112##i3015156##i3015227##i3015225##i3015234##i3015238##i3015263##i30152727##i3015304##i3015349##i3015447##i3015443##i3015439##i3015431##i3015517##i3015564##i3015565##i3015566##i3015567##i3015568##i3015569##i3015670##i3015671##i3015672##i3015656##i3015695##i3015661##i3015665##i3015689##i3015710##i3015711##i3015757##i3015760##i3015763##i3015800##i3015799##i3015796##i3015811##i3015869##i3015863##i3015865##i3015866##i3015867##i3015193##i5150040##i5152053##i1402044##i1442039##i1322051##i1402014##i1402037##i1702261##i1302080##i1002863##i1702508##i1702352##i1702303####i1702302##i1003141##i1003269##i1003268##i1003220##i1003392##i1002839##i1003588##i1003597##i1003760##i1003758##i1003910##i1004029##i1004038##i1004027##i1004028##i1040194##i1042182##i1042183##i1042187##i1042202##i1042204##i1042208##i1042315##i1042316##i1042350##i1050100##i1050127##i1051098##i1051140##i1052537##i1052201##i1052200##i1051424##i1072337##i1073090##i1073091##i1073092##i1072278##i1402169##i5062009##i4009439##i4009453##i5062024##i2430640##i2435824##i4002000##i4002002##i1003797##i1003798##i1003799##i1003800##i1003801##i1042254##i1042255##i1042256##i1042257##i1042258##i1062165##i1102481##i1102482##i1102483##i1102484##i1102485##i1072743##i1072744##i1072745##i1072746##i1072747##i1222058##i1232057##i1242060##i1242061##i1302275##i1312153##i1322203##i1332225##i1342082##i1362090##i1372177##i1382208##i2613064##i1212120##i1222113##i1232113##i1242121##i124242122##i1252098##i1262039##i1302219##i1302343##i1312203##i1322156##i1322255##i1332279##i1342104##i1362006##i1362140##i1372059##i1372228##i1382265##i1402074##i1402259##i1412181##i1422189##i1442274##i1452090##i1452257##i1462243##i1472069##i1472144##i1472265##i1482052##i1482221##i1492235##i1522143##i1532150##i1542117##i1552119##i1702620##i2613065##i2612076##i2612077##i2616074##i2616075##i2615043##i2615044##i2048821##i2048822##ii1402196";
        cm.sendSimple(txt);
    } else if (status == 1) {
        if (selection == 0) {
            if (cm.getRMB() < cost) {
                cm.sendOk("你好像没有" + cost + " 元宝");
                cm.dispose();
                return;
            }
            var chance = Math.floor(Math.random() * 70);
            var finalitem = Array();
        for (var i = 0; i < itemList.length; i++) {
            if (itemList[i][1] >= chance) {
                finalitem.push(itemList[i]);
            }
        }
        for (var i = 0; i < itemList2.length; i++) {
            if (itemList2[i][1] >= chance) {
                finalitem.push(itemList2[i]);
            }
        }
        for (var i = 0; i < itemList3.length; i++) {
            if (itemList3[i][1] >= chance) {
                finalitem.push(itemList3[i]);
            }
        }
        if (finalitem.length != 0) {
                var item;
                var random = new java.util.Random();
                var finalchance = random.nextInt(finalitem.length);
                var itemId = finalitem[finalchance][0];
                var quantity = finalitem[finalchance][2];
                var notice = finalitem[finalchance][3];
                item = cm.gainGachaponItem(itemId, quantity, "元宝抽奖宝箱", notice);
                if (item != -20) {
                    cm.gainRMB(-20);
		    cm.addHyPay(-20);
                    cm.sendOk("你获得了 #b#z" + item + "##k " + quantity + "个。");
                } else {
                    cm.sendOk("请你确认在背包的装备，消耗，其他窗口中是否有一格以上的空间。");
                }
                cm.safeDispose();
            } else {
				cm.gainRMB(-0);
                cm.sendOk("今天的运气可真差，什么都没有拿到");
                cm.safeDispose();
            }
        }
    }
}