/*
 ZEVMS冒险岛(079)游戏服务端
 脚本：飞天猪-魔法密林
 对应的蛋：4170001
 */
var 城镇 = "魔法密林";
var status = 0;
//物品ID，抽奖概率，物品数量，(0/不广播，1广播)
var itemList =
        Array(	
				Array(2290125,5,1,1),//30勇士
			Array(1132242,200,1,1),//革命腰带
			Array(1003946,20,1,1),//革命帽子
			Array(1102612,30,1,1),//革命披风
			Array(1082540,30,1,1),//革命手套
			//Array(1052647,50,1,1),//革命战斗服
			Array(1052647,30,1,1),//革命战斗服
			Array(1122262,200,1,1),//革命吊坠
			Array(1072853,100,1,1),//革命鞋子
			Array(2070006,200,1,1),//齿轮
			Array(2070007,250,1,1),//月牙
			Array(1132243,50,1,1),//低级贝勒德刻印腰带
			Array(1132244,20,1,1),//中级贝勒德刻印腰带
			Array(1132245,10,1,1),//高级贝勒德刻印腰带
			Array(1132246,10,1,1),//最高级贝勒德刻印腰带
			Array(1122264,50,1,1),//低级贝勒德刻印吊坠
			Array(1122265,20,1,1),//中级贝勒德刻印吊坠
			Array(1122266,10,1,1),//高级贝勒德刻印吊坠
			Array(1122267,10,1,1),//最高级贝勒德刻印吊坠
			Array(1032220,30,1,1),//低级贝勒德耳环
			Array(1032221,20,1,1),//中级贝勒德耳环
			Array(1032222,10,1,1),//高级贝勒德耳环
			Array(1032223,10,1,1),//最高级贝勒德耳环
			Array(1113072,20,1,1),//低级贝勒德戒指
			Array(1113073,20,1,1),//中级贝勒德戒指
			Array(1113074,10,1,1),//高级贝勒德戒指
			Array(1113075,10,1,1),//最高级贝勒德戒指
			Array(1112405,100,1,1),//全属性5左右戒指
			Array(1112404,200,1,1),//极光戒指
			//Array(1112426,200,1,1),//全属性1戒指
			Array(1112425,200,1,1),//全属性2戒指
			Array(1112424,200,1,1),//
			Array(1112423,200,1,1),//
			Array(1112422,200,1,1),//
			Array(1112421,200,1,1),//
			Array(1112402,200,1,1),//
			Array(1092074,100,1,1),//至尊不速之客战士盾
			Array(1092079,10,1,1),//至尊不速之客法师盾
			Array(1092084,20,1,1),//至尊不速之客飞侠盾
			Array(1302147,20,1,1),//至尊不速之客单手剑
			Array(1312062,20,1,1),//至尊不速之客单手斧
			Array(1322090,20,1,1),//至尊不速之客单手钝器
			Array(1332120,20,1,1),//至尊不速之客短剑-运
			Array(1332125,20,1,1),//至尊不速之客短剑-力
			Array(1342033,20,1,1),//至尊不速之客刀
			Array(1372078,20,1,1),//至尊不速之客短杖
			Array(1382099,20,1,1),//至尊不速之客长杖
			Array(1402090,20,1,1),//至尊不速之客双手剑
			Array(1412062,20,1,1),//至尊不速之客双手斧
			Array(1422063,20,1,1),//至尊不速之客双手斧
			Array(1432081,20,1,1),//至尊不速之客枪
			Array(1442111,20,1,1),//至尊不速之客矛
			Array(1452106,20,1,1),//至尊不速之客弓
			Array(1462091,20,1,1),//至尊不速之客弩
			Array(1472117,20,1,1),//至尊不速之客拳套
			Array(1482079,50,1,1),//至尊不速之客指节
			Array(1492079,50,1,1),//至尊不速之客刀
			Array(1342033,50,1,1),//至尊不速之客短枪
			Array(1132040,200,1,1),//至尊
Array(2290000,800,1,1),
			Array(3010044,600,1,1), //红伞椅子
			Array(3010036,600,1,1), //秋千
			Array(3010049,600,1,1), //学房子
			Array(3010110,600,1,1), //熊
			Array(3010131,600,1,1), //熊猫
			Array(1022129,600,1,1), //眼睛
			Array(3012001,600,1,1), //篝火 
			Array(3012002,600,1,1), //浴桶
			Array(3012003,600,1,1), //爱心
			Array(3010013,600,1,1), //遮阳椅
			Array(3010018,600,1,1), //椰子树
			Array(3010021,600,1,1), //暖暖桌
			Array(3010024,600,1,1), //玩具熊
			Array(3010025,600,1,1), //5周年枫叶纪念
			Array(3010026,600,1,1), //恶灵附身
			Array(3010034,600,1,1), //假期红
			Array(3010035,600,1,1), //假期蓝
			Array(3010043,600,1,1), //魔女扫把
			Array(3010051,600,1,1), //沙漠兔兔1
			Array(3010052,600,1,1), //沙漠兔兔2
			Array(3010054,600,1,1), //呼噜床
			Array(3010057,600,1,1), //血色玫瑰
			Array(3010058,600,1,1), //世界末日
			Array(3010063,600,1,1), //月亮星星
			Array(3010068,600,1,1), //露水椅子
			Array(3010069,600,1,1), //大黄蜂
			Array(3010071,600,1,1), //神兽椅子
			Array(3010075,600,1,1), //音乐狂
			Array(3010075,600,1,1), //大熊猫
			Array(3010079,600,1,1), //肥猫
			Array(3010085,600,1,1), //鬼娃娃椅子
			Array(3010096,600,1,1), //恐龙化石
			Array(3010099,600,1,1), //北极熊椅子
			Array(3010109,600,1,1), //暖炉椅子
			Array(3010110,600,1,1), //白熊
			Array(3010129,600,1,1), //酋长宝座
			Array(3010139,600,1,1), //私密空间
			Array(3010140,600,1,1), //早日康复
			Array(3010147,600,1,1), //龙蛋椅子
			Array(3010149,600,1,1), //风扇
			Array(3010151,600,1,1), //无人岛
			Array(3010151,600,1,1), //三角张峰
			Array(3010169,600,1,1), //求领养
			Array(3010172,600,1,1), //星空椅子
			Array(3010175,600,1,1), //名画家椅子
			Array(3010193,600,1,1), //炼金瓶
			Array(3010195,600,1,1), //无价之宝
			Array(3010195,600,1,1), //泡泡浴缸
			Array(3010289,600,1,1), //老奶奶读通话
			Array(3010293,600,1,1), //恶灵椅子
			Array(3010403,600,1,1), //音乐会
			Array(3010410,600,1,1), //珍妮
			Array(3010411,600,1,1), //双鱼
			Array(3010412,600,1,1), //双塔
			Array(3010428,600,1,1), //水晶
			Array(3010437,600,1,1), //魔法书
			Array(3010438,600,1,1), //音符
			Array(3010453,600,1,1), //兔子
			Array(3010454,600,1,1), //爱心云朵
			Array(3010462,600,1,1), //天文台
			Array(3010494,600,1,1), //TV椅子
			Array(3010505,600,1,1), //看球赛
			Array(3010515,600,1,1), //奇石椅子
			Array(3010609,600,1,1), //不是在做梦
			Array(3010622,600,1,1), //丹真
			Array(3010632,600,1,1), //印第安
			Array(3010633,600,1,1), //印第安
			Array(3010659,600,1,1), //巴士
			Array(3010716,600,1,1), //超级蘑菇
			Array(3010729,600,1,1), //孤独男子
			Array(3010730,600,1,1), //电视椅子
			Array(3010738,600,1,1), //闪电三人组
			Array(3010739,600,1,1), //雪人香波
			Array(3010753,600,1,1), //玫瑰鸟笼
			Array(3010767,600,1,1), //雪人椅子
			Array(3010760,600,1,1), //古代浴池
			Array(3010876,600,1,1), //人鱼
			Array(3010879,600,1,1), //繁星
			Array(3010937,600,1,1), //异界
			Array(3010938,600,1,1), //异界
			Array(3010939,600,1,1), //异界
			Array(3010946,600,1,1), //森林伙伴
			Array(3012007,600,1,1), //石狮
			Array(3012008,600,1,1), //稻荷神社
			Array(3012011,600,1,1), //火锅
			Array(3012022,600,1,1), //寿司
			Array(3015053,600,1,1), //三重杨
			Array(3015120,600,1,1), //枕头大战
			Array(3015264,600,1,1), //美味厨房
			Array(3015158,600,1,1), //印第安
			Array(3010291,600,1,1), //病床
			Array(3010428,600,1,1), //水晶
			Array(3010492,600,1,1), //首脑
			Array(3010435,600,1,1), //千年狐狸
			Array(3010494,600,1,1), //TV
			Array(3010511,600,1,1), //公园
			Array(3010512,600,1,1), //半半
			Array(3010589,600,1,1), //充电
			Array(3010600,600,1,1), //福星
			Array(3010601,600,1,1), //竹篮
			Array(3010620,600,1,1), //泄愤
			Array(3010664,600,1,1), //进化
			Array(3010678,600,1,1), //还加吨
			Array(3010680,600,1,1), //公主
			Array(3010739,600,1,1), //香波
			Array(3010744,600,1,1), //积木
			Array(3010795,600,1,1), //栖息
			Array(3010806,600,1,1), //放飞
			Array(3010894,600,1,1), //咖啡
			Array(3012030,600,1,1), //公主
			Array(3015100,600,1,1), //公主
			Array(3015183,600,1,1), //公主
			Array(3015312,600,1,1), //公主
			Array(3012011,600,1,1), //火锅
Array(1032026, 500, 1, 1), //黄水晶耳环
Array(1032027, 500, 1, 1), //黑水晶耳环
Array(1032028, 500, 1, 1), //红水晶耳环
Array(1032035, 500, 1, 1), //枫叶耳环
Array(1032040, 500, 1, 1), //枫叶型耳环
Array(1032041, 500, 1, 1), //枫叶型耳环
Array(1032042, 500, 1, 1), //枫叶型耳环
Array(1032047, 500, 1, 1), //可乐耳环
Array(1002391, 600, 1, 0), //海盗头巾(绿)
Array(1002392, 600, 1, 0), //海盗头巾(红)
Array(1002393, 600, 1, 0), //海盗头巾(粉)
Array(1002394, 600, 1, 0), //海盗头巾(灰)
Array(1002395, 600, 1, 0), //海盗头巾(紫)
Array(1002418, 100, 1, 0), //废报纸头盔
Array(1002436, 600, 1, 0), //长老斯坦之帽
Array(1002452, 600, 1, 0), //黑星白头巾
Array(1002453, 600, 1, 0), //白星黑头巾
Array(1002454, 600, 1, 0), //红星黑头巾
Array(1002455, 600, 1, 0), //黑星红头巾
Array(1002492, 600, 1, 0), //白色棒球帽
Array(1002554, 600, 1, 0), //武艺头绳
Array(1002562, 600, 1, 0), //青苹果帽
Array(1002622, 600, 1, 0), //水兵帽
Array(1002677, 300, 1, 1), //玩具匠人帽
Array(1002699, 300, 1, 1), //南瓜帽子
//------披风------
Array(1102040, 300, 1, 1), //浪人披风(黄)
Array(1102041, 300, 1, 1), //浪人披风(粉)
Array(1102042, 300, 1, 1), //浪人披风(紫)
Array(1102043, 300, 1, 1), //浪人披风(褐)
Array(1102140, 400, 1, 1), //卡帕莱特披风
Array(1102147, 420, 1, 1), //玩具匠人披风
Array(1102172, 400, 1, 1), //永恒不灭披风
Array(1102174, 400, 1, 1), //工作人员披风
Array(1102166, 400, 1,1), //枫叶披风
Array(1102167, 400, 1, 1), //枫叶披风
Array(1102168, 400, 1, 1), //枫叶披风
Array(1082145, 300, 1, 1), //工地手套(黄)
Array(1082146, 300, 1, 1), //工地手套(红)
Array(1082147, 300, 1, 1), //工地手套(蓝)
Array(1082148, 300, 1, 1), //工地手套(紫)
Array(1082149, 300, 1, 1), //工地手套(褐)
Array(1082150, 300, 1, 1), //工地手套(灰)
Array(1082175, 300, 1, 0), //马绍尔手套(赤)
Array(1082176, 300, 1, 0), //马绍尔手套(青)
Array(1082177, 300, 1, 0), //马绍尔手套(紫
Array(1082178, 300, 1, 0), //马绍尔手套(桃)
Array(1082179, 300, 1, 0), //马绍尔手套(黄)
Array(1082234, 300, 1, 1), //永恒定边手套
Array(1082235, 300, 1, 1), //永恒逍遥手套
Array(1082236, 300, 1, 1), //永恒白云手套
Array(1082237, 300, 1, 1), //永恒探云手套
Array(1082238, 300, 1, 1), //永恒抚浪手套
Array(1082239, 300, 1, 1), //重生定边手套
Array(1082240, 300, 1, 1), //重生逍遥手套
Array(1082241, 300, 1, 1), //重生白云手套
Array(1082242, 300, 1, 1), //重生探云手套
Array(1082243, 300, 1, 1), //重生抚浪手套
//-------140级巨匠装备-------
Array(1032200, 400, 1, 1), //
Array(1012396, 400, 1, 1), //
Array(1012397, 400, 1, 1), //
Array(1012398, 400, 1, 1), //
Array(1012399, 400, 1, 1), //
Array(1012401, 400, 1, 1), //
Array(1012402, 400, 1, 1), //
Array(1012403, 400, 1, 1), //
Array(1012404, 400, 1, 1), //
Array(1113067, 400, 1, 1), //
Array(1113063, 400, 1, 1), //
Array(1113055, 400, 1, 1), //
//-------150级法弗纳装备-----
Array(1402196, 300, 1, 1), //
Array(1412135, 300, 1, 1), //
Array(1422140, 300, 1, 1), //
Array(1432167, 300, 1, 1), //
Array(1442223, 300, 1, 1), //
Array(1452205, 300, 1, 1), //
Array(1462193, 300, 1, 1), //
Array(1472214, 300, 1, 1), //
Array(1482168, 300, 1, 1), //
Array(1492179, 300, 1, 1), //
Array(1382208, 300, 1, 1), //
Array(1302275, 300, 1, 1), //
Array(1332225, 300, 1, 1), //
//-------150级暴君-----
Array(1132174, 300, 1, 1), //
Array(1132175, 300, 1, 1), //
Array(1132176, 300, 1, 1), //
Array(1132177, 300, 1, 1), //
Array(1132178, 300, 1, 1), //
Array(1102481, 300, 1, 1), //
Array(1102482, 300, 1, 1), //
Array(1102483, 300, 1, 1), //
Array(1102484, 300, 1, 1), //
Array(1102485, 300, 1, 1), //
Array(1082543, 300, 1, 1), //
Array(1082544, 300, 1, 1), //
Array(1082545, 300, 1, 1), //
Array(1082546, 300, 1, 1), //
Array(1082547, 300, 1, 1), //
Array(1072743, 300, 1, 1), //
Array(1072744, 300, 1, 1), //
Array(1072745, 300, 1, 1), //
Array(1072746, 300, 1, 1), //
Array(1072747, 300, 1, 1), //
//-------150级高贵系列-----
Array(1003797, 300, 1, 1), //
Array(1003798, 300, 1, 1), //
Array(1003799, 300, 1, 1), //
Array(1003800, 300, 1, 1), //
Array(1003801, 300, 1, 1), //
Array(1042254, 300, 1, 1), //
Array(1042255, 300, 1, 1), //
Array(1042256, 300, 1, 1), //
Array(1042257, 300, 1, 1), //
Array(1042258, 300, 1, 1), //
Array(1062165, 300, 1, 1), //
Array(1062166, 300, 1, 1), //
Array(1062167, 300, 1, 1), //
Array(1062168, 300, 1, 1), //
Array(1062169, 300, 1, 1), //
//-------160级埃苏莱布-----
Array(1402251, 250, 1, 1), //
Array(1412177, 250, 1, 1), //
Array(1422184, 250, 1, 1), //
Array(1432214, 250, 1, 1), //
Array(1442268, 250, 1, 1), //
Array(1452252, 250, 1, 1), //
Array(1462239, 250, 1, 1), //
Array(1472261, 250, 1, 1), //
Array(1482216, 250, 1, 1), //
Array(1492231, 250, 1, 1), //
Array(1332274, 250, 1, 1), //
Array(1302333, 250, 1, 1), //
Array(1382259, 250, 1, 1), //
//-------160级埃苏莱布防具-----
Array(1004422, 250, 1, 1), //
Array(1004423, 250, 1, 1), //
Array(1004424, 250, 1, 1), //
Array(1004425, 250, 1, 1), //
Array(1004426, 250, 1, 1), //
Array(1102775, 250, 1, 1), //
Array(1102794, 250, 1, 1), //
Array(1102795, 250, 1, 1), //
Array(1102796, 250, 1, 1), //
Array(1102797, 250, 1, 1), //
Array(1082636, 250, 1, 1), //
Array(1082637, 250, 1, 1), //
Array(1082638, 250, 1, 1), //
Array(1082639, 250, 1, 1), //
Array(1082640, 250, 1, 1), //
Array(1052882, 250, 1, 1), //
Array(1052887, 250, 1, 1), //
Array(1052888, 250, 1, 1), //
Array(1052889, 250, 1, 1), //
Array(1052890, 250, 1, 1), //
Array(1073030, 250, 1, 1), //
Array(1073032, 250, 1, 1), //
Array(1073033, 250, 1, 1), //
Array(1073034, 250, 1, 1), //
Array(1073035, 250, 1, 1), //
			Array(1122081,200,1,1),//1代项链
			Array(1122082,200,1,1),//2代项链
			Array(1122083,200,1,1),//3
			Array(1122084,200,1,1),//末代
			Array(1122085,200,1,1),//至尊
			//Array(1122083,50,1,1),//3
			//Array(1122083,50,1,1),//3
			//Array(1122083,50,1,1),//3
			//Array(1122083,50,1,1),//3
			//Array(1122083,50,1,1),//3			
			//Array(2049002,200,1,1),//白医5
			//Array(2049001,300,1,1),//白医3
			Array(2049000,200,1,1),//白医1
			Array(2040006,200,1,1),//头盔防御必成
			Array(2040007,200,1,1),//体力必成
			Array(2040303,50,1,1),//耳环智力必成
			Array(2040403,200,1,1),//上衣防御必成
			Array(2040506,50,1,1),//全身敏捷必称
			Array(2040603,300,1,1),//裤裙防御必成
			Array(2040709,30,1,1),//鞋子敏捷必成
			Array(2040710,200,1,1),//跳跃必成
			Array(2040711,300,1,1),//速度必成
			Array(2040806,50,1,1),//手套敏捷必成
			Array(2040903,300,1,1),//盾牌防御必成
			Array(2041024,300,1,1),//披风MF必成
			Array(2041025,200,1,1),//披风WF必成
			Array(5570000,200,1,1),//金锤子
			Array(1132053,200,1,1),//坚韧极限
			Array(1132063,200,1,1),	
			Array(1132073,200,1,1),
			Array(1132083,200,1,1),//幸运极限
		Array(1122110,300,1,1),//超级枫叶系列
		Array(1082313,300,1,1),
		Array(1332143,200,1,1),
		Array(1342038,330,1,1),
		Array(1372095,200,1,1),
		Array(1382119,200,1,1),
		Array(1402105,300,1,1),
		Array(1442131,300,1,1),
		Array(1452124,200,1,1),
		Array(1462112,300,1,1),
		Array(1472135,200,1,1),
		Array(1482097,300,1,1),
		Array(1492096,200,1,1),
			
		Array(1302030,300,1,1),//枫叶系列
		Array(1332025,300,1,1),
		Array(1382012,300,1,1),
		Array(1412011,330,1,1),
		Array(1422014,300,1,1),
		Array(1432012,300,1,1),
		Array(1442024,300,1,1),
		Array(1452022,300,1,1),
		Array(1462019,300,1,1),
		Array(1472032,300,1,1),
		Array(1482021,300,1,1),
		Array(1492021,300,1,1),
		Array(1402037,200,1,1),//龙背
		Array(1372035,300,1,1),//4短属性
		Array(1372036,300,1,1),
		Array(1372037,300,1,1),
		Array(1372038,300,1,1),
		Array(1382045,200,1,1),//四长属性
		Array(1382046,200,1,1),
		Array(1382047,200,1,1),
		Array(1382048,200,1,1),
		Array(1382049,100,1,1),//四大属性
		Array(1382050,100,1,1),
		Array(1382051,100,1,1),
		Array(1382052,100,1,1),
		
		
		Array(2049100,300,1,1),//混沌
			Array(2340000,50,1,1),//祝福卷轴
			Array(2040914,100,1,1),//盾牌攻击卷轴  
			Array(2040810,151,1),
			Array(2040811,100,1,1),
			Array(2040916,150,1,1),
			Array(2040917,150,1,1),
			Array(2043004,150,1,1),
			Array(2043005,150,1,1),
			Array(2043104,150,1,1),
			Array(2043105,150,1,1),
			Array(2043204,150,1,1),
			Array(2043205,150,1,1),
			Array(2043304,150,1,1),
			Array(2043305,150,1,1),
			Array(2044004,150,1,1),
			Array(2044005,100,1,1),
			Array(2044104,100,1,1),
			Array(2044105,100,1,1),
			Array(2044204,100,1,1),
			Array(2044205,100,1,1),
			Array(2044304,100,1,1),
			Array(2044305,100,1,1),
			Array(2044404,100,1,1),
			Array(2044405,100,1,1),
			Array(2044504,100,1,1),
			Array(2044505,100,1,1),
			Array(2044604,100,1,1),
			Array(2044605,100,1,1),
			Array(2044704,100,1,1),
			Array(2044903,100,1,1),
			Array(2044904,100,1,1),
			Array(2043704,100,1,1),
			Array(2043705,100,1,1),
			Array(2043804,100,1,1),
			Array(2043805,300,1,1),
			Array(1002419,200,1,1),//枫叶帽
			Array(1002677,150,1,1),//玩具匠人帽
			Array(1002798,200,1,1),//年糕1002798
			Array(1002743,150,1,1),//海洋之帽
			Array(1002939,300,1,1),//安全帽						
			Array(1082149,300,1,1),//工地手套(褐) 		 
			Array(1102042,250,1,1),//浪人披风(紫) 
			Array(1102041,200,1),//浪人披风(粉)			
			Array(1102086,300,1,1),//蓝色盖亚披风
			Array(1102084,300,1,1),//粉红盖亚披风		
			Array(1012070,300,1,1),//雪糕+攻
			Array(1012071,200,1,1),//雪糕全属性
			Array(1012072,300,1,1),//狐猴
			Array(1012073,300,1,1),//狐猴
			Array(1022060,100,1,1),//狐猴
			Array(1022067,100,1,1),//黑狐猴
			Array(1012056,100,1,1),//狗狗鼻子1012056		  
			Array(1402063,100,1,1),//樱花伞
			Array(1302058,100,1,1),//枫叶伞			
			Array(1092022,100,1,1),//调色板盾牌					
			Array(1302063,200,1,1),//燃烧的火焰刀
			Array(1302106,200,1,1),//燃烧的冰焰刀
			Array(1302080,200,1,1),//冒险岛小灯泡
			Array(1302085,200,1,1),//叉子
			Array(1302087,200,1,1),//火炬
			Array(1382015,200,1,1),//毒蘑菇
			Array(1382016,200,1,1),//香菇
			Array(1402044,300,1,1),//南瓜灯笼
			Array(1302061,300,1,1),//蔓藤鞭子
			Array(1422030,300,1,1),//粉红海豹抱枕
			Array(1422031,300,1),//蓝色海豹抱枕
			Array(1432046,200,1,1),//圣诞树手杖
			Array(1432013,100,1,1),//南瓜枪
        	Array(1302024,100,1,1),//废报纸武器
        	Array(1322051,300,1,1),//七夕
        	Array(1402014,30,1,1),//温度计
        	Array(1402029,100,1,1),//鬼刺狼牙棒
        	Array(1422011,200,1,1),//酒瓶
        	Array(1332053,200,1,1),//野外烧烤
        	Array(1372017,200,1,1),//领路灯
		    Array(1442039,50,1,1),//冻冻鱼
        	Array(1302019,200,1,1),//无名剑
        	Array(1332021,100,1,1),//乌龙茶
        	//Array(1302128,200,1,1),//火柴	
        	//Array(1302084,300,1,1),//火柴
        	Array(1402013,200,1,1),//白日剑
			Array(1302036,200,1,1),//枫叶小旗
			Array(1302049,200,1,1),//光线鞭
				//---戒指
			Array(1112688,100,1,1),            
			Array(1112138,100,1,1),
            Array(1112245,100,1,1),
            Array(1112584,100,1,1),
			Array(1112591,100,1,1),            
			Array(1112592,100,1,1),
            Array(1112596,100,1,1),
            Array(1112597,100,1,1),
			Array(1112662,100,1,1),            
			Array(1112663,100,1,1),
            Array(1113016,100,1,1),
            Array(1113017,100,1,1),
			Array(1112795,100,1,1),            
			Array(1112782,100,1,1),
            Array(1112783,100,1,1),
            Array(1112784,100,1,1),
			Array(1112725,100,1,1),            
			Array(1112729,100,1,1),
            Array(1112730,100,1,1),
            Array(1112732,100,1,1),
			Array(1112733,100,1,1),            
			Array(1112734,100,1,1),
            Array(1112920,100,1,1),
            Array(1112738,100,1,1),
			Array(1112745,100,1,1),            
			Array(1113003,100,1,1),
            Array(1113020,100,1,1),
            Array(1113038,100,1,1),
			Array(1113077,100,1,1),
            Array(1113096,100,1,1),
			
			Array(1112570,300,1,1),
            Array(1112794,200,1,1),
            Array(1112789,200,1,1),
            Array(1112675,200,1,1),
            Array(1112682,200,1,1),
            Array(1112683,200,1,1),
            Array(1112712,200,1,1),
            Array(1112721,200,1,1),
            Array(1112723,200,1,1),
            Array(1112735,200,1,1),
			Array(1112736,200,1,1),
            Array(1112739,200,1,1),
            Array(1112740,200,1,1),
            Array(1112742,200,1,1),
            Array(1112743,200,1,1),
            Array(1112748,200,1,1),            
			Array(1112747,200,1,1),
            Array(1112751,200,1,1),
            Array(1112752,200,1,1),            
			Array(1112761,200,1,1),
            Array(1112758,200,1,1),
            Array(1112759,200,1,1),            
			Array(1112760,200,1,1),
            Array(1113028,200,1,1),
            Array(1113039,200,1,1),            
			Array(1113040,200,1,1),
            Array(1113064,200,1,1),
            Array(1113048,200,1,1),
		    Array(1113065,200,1,1),            
			Array(1113066,200,1,1),
            Array(1113067,200,1,1),
            Array(1113069,200,1,1),            
			Array(1113071,200,1,1),
            Array(1113076,200,1,1),
            Array(1113081,200,1,1),
			Array(1113082,200,1,1),            
			Array(1113087,200,1,1),
            Array(1113089,200,1,1),
            Array(1113095,200,1,1),            
			Array(1113149,200,1,1),
            Array(1113170,200,1,1),
            Array(1113034,200,1,1),
			Array(1113178,80,1,1),
			Array(1112400,300,1,1),//
			Array(1112401,300,1,1),//
			Array(1112402,300,1,1),//
			Array(1112403,300,1,1),//	


						
			
			//-----椅子-----
			//  Array(3010788,100,1,1),
			//Array(3010681,100,1,1),
			//Array(3010416,100,1,1),
			//Array(3010417,100,1,1),
		   // Array(3010043,200,1,1),//魔女的飞扫把
		    Array(3015051,50,1,1),//巨无霸国际巨星
		   // Array(3015183,200,1,1),//绿水灵背景椅子
		    //Array(3015096,200,1,1),//羊羊幻想牧场椅子
		    //Array(3010180,300,1,1),//HP椅子
		    Array(3010009,10,1,1),//粉色爱心马桶
		    //Array(3010028,100,1,1),//老海盗椅子
		    //Array(3012006,300,1,1),//风吹稻香
        	//Array(3010013,100,1,1),//悠长假期
        	//Array(3010014,300,1,1),//月亮弯
        	//Array(3010018,300,1,1),//椰子树沙滩椅
        	//Array(3010025,300,1,1),//枫叶纪念凳
        	//Array(3012001,300,1,1),//篝火
        	//Array(3012002,100,1,1),//浴桶---
        	Array(3010073,100,1,1),//PB克缤
        	//Array(3010049,300,1,1),//雪房子
        	//Array(3010068,300,1,1),//露水椅子
        	Array(3010070,100,1,1),//巨无霸品克缤
        	//rray(3010095,100,1,1),//石头人座椅
//-----后期植入椅子-----
        	//Array(3010898,100,1,1),//迷你神兽椅子
        	//Array(3010465,100,1,1),//可爱音符椅子
        	//Array(3010460,100,1,1),//爆竹椅子
        	//Array(3010450,100,1,1),//艾莉珍椅子
        	//Array(3010455,100,1,1),//扎昆的帝王椅子
        	//Array(3010456,100,1,1),//杜鹃花椅子
        	//Array(3010458,100,1,1),//翻滚兔子椅子
        	//Array(3010863,300,1,1),//愤怒的美发师椅子
        	//Array(3010447,100,1,1),//睡觉小鸟椅子
        	//Array(3010446,100,1,1),//皮肤皇后椅子
        	//Array(3010448,100,1,1),//泡泡浴椅子
        	//Array(3010434,100,1,1),//热带夏日椅子
        	//Array(3010428,100,1,1),//水晶椅子
        	//Array(3010409,100,1,1),//粽子椅子
      	    //Array(3010094,100,1,1),//漂漂猪椅子-----------------------
        	//Array(3010411,100,1,1),//鱼尾狮椅子
        	//Array(3010085,300,1,1),//鬼娃娃椅子
        	//Array(3010077,100,1,1),//猫头鹰椅子
        	//Array(3010053,300,1,1),//兔子纪念版椅子
        	//Array(3010151,200,1,1),//无人岛椅子
        	//Array(3015415,300,1,1),//猴子椅子
        	//Array(3010142,300,1,1),//水族馆椅子
        	//Array(3010144,100,1,1),//七夕椅子
        	//Array(3015430,100,1,1),//年兽椅子
        	//Array(3010117,100,1,1),//魔法书椅子
        	//Array(3015424,100,1,1),//超级饺子椅子
        	//Array(3015428,100,1,1),//和猴子一起放烟花椅子
        	//Array(3015427,100,1,1),//和猴子一起玩麻将椅子
        	//Array(3010804,100,1,1),//军人月妙拜年椅子
        	//Array(3015045,300,1,1),//羊绒咩咩椅子--------------
        	//Array(3010375,300,1,1),//奥妙的超级药水椅子
        	//Array(3015057,300,1,1),//烟花绽放椅子
        	//Array(3010373,300,1,1),//云朵洗手间椅子
        	//Array(3010799,300,1,1),//坟墓幽灵椅子
        	//Array(3010737,300,1,1),//动物英雄团椅子
        	//Array(3010734,100,1,1),//猫箱椅子
        	//Array(3010738,300,1,1),//闪电三人组椅子
        	//Array(3010740,100,1,1),//圣诞树椅子
        	//Array(3010365,100,1,1),//休彼德蔓的古代石掌椅子
        	//Array(3010306,100,1,1),//生如夏花椅子
        	//Array(3010301,300,1,1),//高级HP药水椅子
        	//Array(3010188,100,1,1),//班·雷昂椅子
        	//Array(3010186,100,1,1),//兔子椅子
        	//Array(3010184,300,1,1),//冰钓椅子
         	//Array(3010173,300,1,1),//万圣节塔罗椅子
        	//Array(3010175,300,1,1),//名画家椅子
        	//Array(3010195,100,1,1),//无价之宝椅子
        	//Array(3010210,100,1,1),//草莓冰淇淋月饼椅子--------------
        	//Array(3010224,300,1,1),//年糕冰淇淋椅子
        	//Array(3010036,300,1,1),//浪漫秋千
        	//Array(3010044,300,1,1),//同一红伞下
        	//Array(3010111,100,1,1),//虎虎生威
        	//Array(3010115,100,1,1),//熊宝宝床
        	//Array(3010126,300,1,1),//蝙蝠魔王座
        	//Array(3010313,300,1,1),//粉红扎昆椅子
        	//Array(3010128,300,1,1),//黑龙王座
        	//Array(3010133,300,1,1),//帐篷椅
        	//Array(3010152,200,1,1),//黄三角帐篷椅
        	//Array(3010291,300,1,1),//早日康复床
        	//Array(3010172,300,1,1),//星空椅子
        	//Array(3010168,300,1,1),//友谊万岁椅子
        	//Array(3010185,100,1,1),//小伙伴品克缤
        	//Array(3010622,100,1,1),//我的好友丹珍之椅
        	//Array(3010453,300,1,1),//兔子乘风椅
        	//Array(3010493,300,1,1),//那就是我--------------------------------
        	//Array(3010527,300,1,1),//深海章鱼
        	//Array(3010531,300,1,1),//小企鹅合唱团
        	//Array(3010565,300,1,1),//我的女皇椅子
        	//Array(3010587,300,1,1),//时间胶囊
        	//Array(3010609,300,1,1),//不是在做梦
        	//Array(3010608,300,1,1),//完美的名画椅子
        	//Array(3010661,300,1,1),//欢乐相框椅子
        	//Array(3010678,300,1,1),//海加顿之安息
        	//Array(3010739,300,1,1),//雪人香波椅子
        	//Array(3010744,300,1,1),//冒险岛的砖头朋友们
        	//Array(3010752,300,1,1),//玫瑰鸟笼
        	//Array(3010756,300,1,1),//新年招财猫椅子
        	//Array(3010767,300,1,1),//雪人椅子
        	//Array(3010760,300,1,1),//古代浴池椅子
        	//Array(3010795,300,1,1),//森林中休息处
        	//Array(3010806,300,1,1),//桃樱芳菲椅
        	//Array(3010848,300,1,1),//红地毯主人公椅子
        	Array(3012024,50,1,1)//沙滩排球椅子
                );

function start() {
    status = -1;
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == 1) {
        status++;
    } else {
        if (status == 0) {
            cm.sendOk("你没有 " + cm.显示物品(5220040) + " ？");
            cm.dispose();
        }
        status--;
    }
    if (status == 0) {
        if (cm.haveItem(5220040, 1)) {
            var str1 = "";
            for (var i = 0; i < itemList.length; i++) {
                str1 += "#v" + itemList[i][0] + "#";
            }
            cm.sendYesNo("我是#b"+城镇+"#k的飞天猪，你好 #b#h ##k 给我 " + cm.显示物品(5220040) + " 就可以抽奖了。");
        } else {
            var str1 = "\r\n";
            for (var i = 0; i < itemList.length; i++) {
                str1 += "#v" + itemList[i][0] + "#";
            }
            cm.sendOk("我是#b"+城镇+"#k的飞天猪，你没有 " + cm.显示物品(5220040) + " ! 等你有了在来找我把。");
            cm.safeDispose();
        }
    } else if (status == 1) {
        var chance = Math.floor(Math.random() * +100);
        var finalitem = Array();
        for (var i = 0; i < itemList.length; i++) {
            if (itemList[i][1] >= chance) {
                finalitem.push(itemList[i]);
            }
        }
        if (finalitem.length != 0) {
            if (finalitem.length == 0) {
                return 1;
            }
            var item;
            var random = new java.util.Random();
            var finalchance = random.nextInt(finalitem.length);
            var itemId = finalitem[finalchance][0];
            var quantity = finalitem[finalchance][2];
            var notice = finalitem[finalchance][3];
            item = cm.gainGachaponItem(itemId, quantity, "飞天猪", notice);
            if (item != -1) {
                cm.gainItem(5220040, -1);
                cm.sendOk("你获得了 " + cm.显示物品(item) + " x #b"+quantity+"#k");
            } else {
                cm.sendOk("请你确认在背包的装备，消耗，其他窗口中是否有一格以上的空间。");
            }
            cm.safeDispose();
        } else {
            cm.sendOk("今天的运气可真差，什么都没有拿到。");
            cm.safeDispose();
        }
        cm.safeDispose();
    }
}