var status = 0;
var itemList =   
Array(   
			Array(4000463,10,1,1),//国庆币
			Array(5150038,10,1,1),//超级明星5000016
			Array(5150040,100,1,1),//皇家1032026
			Array(5000016,10,1,1),//云豹
			Array(4002000,300,1,1),//邮票
			Array(4002001,100,1,1),//邮票
			Array(4002002,100,1,1),//邮票
			Array(4002003,100,1,1),//邮票
			/*Array(4031559,100,1,1),//汉斯邮票4031559
			Array(4031560,100,1,1),//邮票4031559
			Array(4251200,10,1,1),//下等五彩水晶
			Array(4251201,10,1,1),//中等五彩水晶
			Array(4251202,10,1,1),//高等五彩水晶4004000*/
			Array(4004000,2000,1,1),//矿
			Array(4004001,2000,1,1),//矿
			Array(4004002,2000,1,1),//矿
			Array(4004003,2000,1,1),//矿
			Array(4004004,700,1,1),//矿4031179
			Array(4031179,300,1,1),//D片
			Array(4001017,300,1,1),//火眼
			Array(2340000,10,1,1),//祝福卷轴
			Array(2040914,10,1,1),//盾牌攻击卷轴  
			Array(2040915,10,1,1),//头盔攻击卷轴
			Array(2040025,10,1,1),//头盔智力卷轴  
			Array(2040026,100,1,1),//腰带力量卷轴  
			Array(2041302,10,1,1),
			Array(2041301,100,1,1),//腰带敏捷卷轴
			Array(2041307,10,1,1),  
			Array(2041308,10,1,1),
			Array(2041304,100,1,1),//腰带智力卷轴  
			Array(2041305,10,1,1),
			Array(2041310,100,1,1),//腰带运气卷轴  
			Array(2041311,10,1,1),
			/*Array(4004000,700,1,1),//矿
			Array(4004001,700,1,1),//矿
			Array(4004002,700,1,1),//矿
			Array(4004003,700,1,1),//矿*/
			Array(2040810,200,1),//诅咒系列
			Array(2040811,100,1,1),
			Array(2040916,150,1,1),
			Array(2040917,150,1,1),
			Array(2043004,150,1,1),
			Array(2043005,150,1,1),
			Array(2043104,150,1,1),
			Array(2043105,150,1,1),
			Array(2043204,150,1,1),
			Array(2043205,150,1,1),
			Array(2043304,150,1,1),
			Array(2043305,150,1,1),
			Array(2044004,150,1,1),
			Array(2044005,100,1,1),
			Array(2044104,100,1,1),
			Array(2044105,100,1,1),
			Array(2044204,100,1,1),
			Array(2044205,100,1,1),
			Array(2044304,100,1,1),
			Array(2044305,100,1,1),
			Array(2044404,100,1,1),
			Array(2044405,100,1,1),
			Array(2044504,100,1,1),
			Array(2044505,100,1,1),
			Array(2044604,100,1,1),
			Array(2044605,100,1,1),
			Array(2044704,100,1,1),
			Array(2044903,100,1,1),
			Array(2044904,100,1,1),
			Array(2043704,100,1,1),
			Array(2043705,100,1,1),
			Array(2043804,100,1,1),
			Array(2043805,300,1,1),
			Array(1302030,300,1,1),//枫叶系列
			Array(1332025,300,1,1),
			Array(1382012,300,1,1),
			Array(1412011,330,1,1),
			Array(1422014,300,1,1),
			Array(1432012,300,1,1),
			Array(1442024,300,1,1),
			Array(1452022,300,1,1),
			Array(1462019,300,1,1),
			Array(1472032,300,1,1),
			Array(1482021,300,1,1),
			Array(1492021,300,1,1),
			Array(1032026,10,1,1),//黄水晶
			Array(1032028,200,1,1),//红水晶
			Array(1002419,1000,1,1),//枫叶帽
			Array(1002677,150,1,1),//玩具匠人帽
			Array(1002798,1000,1,1),//年糕1002798
			Array(1002743,150,1,1),//海洋之帽
			Array(1002939,10,1,1),//安全帽
			Array(1002391,1000,1,1),//海盗头巾(绿) 
			Array(1002392,1000,1,1),//海盗头巾(红) 
			Array(1002393,1000,1,1),//海盗头巾(粉) 
			Array(1002394,1000,1,1),//海盗头巾(灰) 
			Array(1002395,1000,1,1),//海盗头巾(紫)
			Array(1002585,1000,1,1),//蓝色烤栗贩帽子
			Array(1002586,1000,1,1),//紫色烤栗贩帽子
			Array(1002587,1000,1,1),//黑色烤栗贩帽子
			Array(1082002,1000,1,1),//工地手套
			Array(1082145,500,1,1),//工地手套(黄) 
			Array(1082146,500,1,1),//工地手套(红) 
			Array(1082147,500,1,1),//工地手套(蓝) 
			Array(1082148,500,1,1),//工地手套(紫) 
			Array(1082149,10,1,1),//工地手套(褐) 
			Array(1082150,300,1,1),//工地手套(灰)1472063 
			Array(1472063,300,1,1),//魔法手套
			Array(1102040,300,1,1),//浪人披风(黄) 
			Array(1102043,300,1,1),//浪人披风(褐)  
			Array(1102042,10,1,1),//浪人披风(紫) 
			Array(1102041,10,1,1),//浪人披风(粉)
			Array(1102085,1000,1,1),//黄色盖亚披风
			Array(1102086,10,1,1),//蓝色盖亚披风
			Array(1102084,10,1,1),//粉红盖亚披风
			Array(1102079,1000,1,1),//破旧的红色披风
			Array(1102081,1000,1,1),//破旧的黄色披风
			Array(1102082,500,1,1),//破旧的黑色披风
			Array(1102211,1000,1,1),//战神的披风
			Array(1072262,500,1,1),//黑色桃乐斯皮鞋
			Array(1072264,500,1,1),//银色桃乐斯皮鞋
			Array(1072369,300,1,1),//1072369绿水灵鞋子
			Array(1012070,10,1,1),//雪糕+攻
			Array(1012071,100,1,1),//雪糕全属性
			Array(1012072,500,1,1),//狐猴
			Array(1012073,1000,1,1),//狐猴
			Array(1022060,100,1,1),//狐猴
			Array(1022067,100,1,1),//黑狐猴
			Array(1012056,100,1,1),//狗狗鼻子1012056
			Array(1012161,10,1,1),//发光的鼻子
			Array(1022066,500,1,1),//蓝海星眼镜
			Array(1050100,50,1,1),//浴袍1050100
			Array(1050127,50,1,1),//浴袍1050100
			Array(1051098,50,1,1),//浴袍1050100
			Array(1051140,50,1,1),//浴袍1050100
			Array(1402063,10,1,1),//樱花伞
			Array(1302058,100,1,1),//枫叶伞
			Array(1302026,50,1,1),//伞1302026
			Array(1302027,1000,1,1),//伞1302026
			Array(1302028,1000,1,1),//伞1302026
			Array(1302029,300,1,1),//伞1302026
			Array(1302071,1000,1,1),//粉色游泳圈
			Array(1322021,1000,1,1),//游泳圈
			Array(1322022,500,1,1),//游泳圈
			Array(1322023,1000,1,1),//游泳圈
			Array(1322024,300,1,1),//游泳圈
			Array(1442054,1000,1,1),//滑板
			Array(1442055,300,1,1),//滑板
			Array(1442056,100,1,1),//滑板
			Array(1442057,10,1,1),//滑板
			Array(1442046,50,1,1),//超级滑板
			Array(1432016,300,1,1),//滑板1432016
			Array(1432017,10,1,1),//滑板1432016
			Array(1432018,10,1,1),//滑板1432016
			Array(1442012,1000,1,1),//雪板0
			Array(1442013,1000,1,1),//雪板12
			Array(1442014,1000,1,1),//雪板24
			Array(1442015,700,1,1),//雪板36
			Array(1442016,100,1,1),//雪板48
			Array(1442017,80,1,1),//雪板60
			Array(1442021,1000,1,1),//黄拖把
			Array(1442022,80,1,1),//白拖把
			Array(1442023,700,1,1),//黑拖把
			Array(2370008,2000,1,1),//经验书2370008
			Array(2370009,2000,1,1),//经验书2370008
			Array(2370010,2000,1,1),//经验书2370008
			Array(2370011,2000,1,1),//经验书2370008
			Array(2370012,2000,1,1),//经验书2370008
			Array(2370000,200,1,1),//经验书10W
			Array(2370001,500,1,1),//经验书5W
			Array(2370002,700,1,1),//经验书3W
			Array(2370003,2000,1,1),//经验书2W
			Array(2370004,2000,1,1),//经验书
			Array(2370005,2000,1,1),//经验书
			Array(2370006,2000,1,1),//经验书
			Array(2370007,2000,1,1),//经验书
			Array(1302037,100,1,1),//小号
			Array(5390006,100,1,1),//咆哮喇叭5390006
			Array(5390000,300,1,1),//喇叭5390006
			Array(5390001,300,1,1),//喇叭5390006
			Array(5390002,300,1,1),//喇叭5390006
			Array(5390003,300,1,1),//喇叭5390006
			Array(5390004,300,1,1),//喇叭5390006
			Array(5390005,300,1,1),//喇叭5390006
			Array(1092022,10,1,1),//调色板盾牌
			Array(1072238,100,1,1),//紫色钉鞋
			Array(1072239,10,1,1),//黄色钉鞋
			Array(1002663,500,1,1),//七七帽子
			Array(1302063,10,1,1),//燃烧的火焰刀
			Array(1302106,10,1,1),//燃烧的冰焰刀
			Array(1302080,100,1,1),//回顾冒险岛小灯泡
			Array(1302085,100,1,1),//叉子
			Array(1302087,1000,1,1),//火炬
			Array(1382015,10,1,1),//毒蘑菇
			Array(1382016,10,1,1),//香菇
			Array(1402044,10,1,1),//南瓜灯笼
			Array(1302061,100,1,1),//蔓藤鞭子
			Array(1422030,10,1,1),//粉红海豹抱枕
			Array(1422031,10,1,1),//蓝色海豹抱枕
			Array(1432046,300,1,1),//圣诞树手杖
			Array(1432013,100,1,1),//南瓜枪
        	Array(1302024,500,1,1),//废报纸武器
        	Array(1322051,300,1,1),//七夕
        	Array(1402014,10,1,1),//温度计
        	Array(1402029,100,1,1),//鬼刺狼牙棒
        	Array(1422011,300,1,1),//酒瓶
        	Array(1332053,10,1,1),//野外烧烤
        	Array(1372017,100,1,1),//领路灯
			Array(5570000,100,1,1),//金锤子
        	Array(1422036,100,1,1),//玩具锤子
			Array(1302021,1000,1,1),//玩具锤子1302021
        	Array(1322027,300,1,1),//平底锅
        	Array(1442039,300,1,1),//冻冻鱼
        	Array(1302019,100,1,1),//无名剑
        	Array(1332021,300,1,1),//乌龙茶
        	Array(1302128,1000,1,1),//火柴	
        	Array(1302084,1000,1,1),//火柴
        	Array(1402013,100,1,1),//白日剑
			Array(1302036,300,1,1),//枫叶小旗
			Array(1302049,100,1,1),//光线鞭
			Array(1302001,1000,1,1),//锯子
			Array(1312012,500,1,1),//呼啦圈
			Array(1322006,1000,1,1),//钢管
			Array(1422011,300,1,1),//清酒
			Array(1432039,100,1,1),//钓鱼竿
			Array(2000005,100,1,1),//超级药水
			Array(2000004,500,1,1),//药水
			Array(2210005,500,1,1),//提摩
			Array(2210010,500,1,1),//女超		
        	Array(3010112,500,1,1),
			Array(1702246,100,1,1),//幽魂武器	
        	Array(1702248,100,1,1),//圣诞鹿武器	
        	Array(1702278,100,1,1),//枫之武器	
        	Array(1702305,100,1,1),//胡萝卜武器
        	Array(1702335,100,1,1),//炼金师的武器	
        	Array(1702392,100,1,1),//黑暗小恶魔武器	
        	Array(1702393,100,1,1),//蛇年武器	
        	Array(1702372,100,1,1),//圣杯武器
        	Array(1702408,100,1,1),//纪念日专用武器	
        	Array(1702401,100,1,1),//兔子胡萝卜武器
        	Array(1702459,100,1,1),//棉花糖武器
        	Array(1702460,100,1,1),//星星武器	
        	Array(1702499,300,1,1),//林之灵武器	
        	Array(1702550,100,1,1),//桃太郎武器	
        	Array(1702538,100,1,1),//露珠武器	
        	Array(1702508,100,1,1),//草莓牛奶武器
        	Array(1702588,100,1,1),//黑猫玩具武器	
        	Array(1702598,100,1,1),//枫叶武器	
        	Array(1702597,100,1,1),//七七贝壳武器	
        	Array(1702579,100,1,1),//水晶喵喵武器	
        	Array(1702576,100,1,1),//啪嗒啪嗒打糕武器	
        	Array(1702660,100,1,1),//调皮雪人武器	
        	Array(1702669,100,1,1),//公主日记武器	
        	Array(1702617,100,1,1),//七七莲花武器	
        	Array(1702637,100,1,1),//音乐律动武器箱
        	Array(1702625,100,1,1),//爱情蓝鸟武器
        	Array(1472063,100,1,1),//魔法手套
        	Array(1062073,300,1,1),//特别南瓜裤(米)点
        	Array(1062074,300,1,1),//特别南瓜裤(黑褐)点
//-----椅子-----
		    Array(3010043,100,1,1),//魔女的飞扫把
		    Array(3015051,10,1,1),//巨无霸国际巨星
		    Array(3015183,10,1,1),//绿水灵背景椅子
		    Array(3015096,10,1,1),//羊羊七七牧场椅子
		    Array(3010180,1000,1,1),//HP椅子
		    Array(3010009,10,1,1),//粉色爱心马桶
		    Array(3010028,100,1,1),//老海盗椅子
		    Array(3012006,50,1,1),//风吹稻香
        	Array(3010013,10,1,1),//悠长假期
        	Array(3010014,500,1,1),//月亮弯
        	Array(3010018,1000,1,1),//椰子树沙滩椅
        	Array(3010025,1000,1,1),//枫叶纪念凳
        	Array(3012001,1000,1,1),//篝火
        	Array(3012002,100,1,1),//浴桶---
        	Array(3010073,10,1,1),//PB克缤
        	Array(3010049,50,1,1),//雪房子
        	Array(3010068,50,1,1),//露水椅子
        	Array(3010070,10,1,1),//巨无霸品克缤
        	Array(3010095,100,1,1),//石头人座椅
//-----后期植入椅子-----
        	Array(3010898,100,1,1),//迷你神兽椅子
        	Array(3010465,100,1,1),//可爱音符椅子
        	Array(3010460,100,1,1),//爆竹椅子
        	Array(3010450,100,1,1),//艾莉珍椅子
        	Array(3010455,100,1,1),//扎昆的帝王椅子
        	Array(3010456,100,1,1),//杜鹃花椅子
        	Array(3010458,100,1,1),//翻滚兔子椅子
        	Array(3010863,50,1,1),//愤怒的美发师椅子
        	Array(3010447,100,1,1),//睡觉小鸟椅子
        	Array(3010446,100,1,1),//皮肤皇后椅子
        	Array(3010448,100,1,1),//泡泡浴椅子
        	Array(3010434,100,1,1),//热带夏日椅子
        	Array(3010428,100,1,1),//水晶椅子
        	Array(3010409,100,1,1),//粽子椅子
      	    Array(3010094,100,1,1),//漂漂猪椅子-----------------------
        	Array(3010411,100,1,1),//鱼尾狮椅子
        	Array(3010085,50,1,1),//鬼娃娃椅子
        	Array(3010077,100,1,1),//猫头鹰椅子
        	Array(3010053,50,1,1),//兔子纪念版椅子
        	Array(3010151,200,1,1),//无人岛椅子
        	Array(3015415,50,1,1),//猴子椅子
        	Array(3010142,50,1,1),//水族馆椅子
        	Array(3010144,100,1,1),//七夕椅子
        	Array(3015430,100,1,1),//年兽椅子
        	Array(3010117,100,1,1),//魔法书椅子
        	Array(3015424,100,1,1),//超级饺子椅子
        	Array(3015428,100,1,1),//和猴子一起放烟花椅子
        	Array(3015427,100,1,1),//和猴子一起玩麻将椅子
        	Array(3010804,100,1,1),//军人月妙拜年椅子
        	Array(3015045,50,1,1),//羊绒咩咩椅子--------------
        	Array(3010375,50,1,1),//奥妙的超级药水椅子
        	Array(3015057,50,1,1),//烟花绽放椅子
        	Array(3010373,50,1,1),//云朵洗手间椅子
        	Array(3010799,50,1,1),//坟墓幽灵椅子
        	Array(3010737,50,1,1),//动物英雄团椅子
        	Array(3010734,100,1,1),//猫箱椅子
        	Array(3010738,50,1,1),//闪电三人组椅子
        	Array(3010740,100,1,1),//圣诞树椅子
        	Array(3010365,100,1,1),//休彼德蔓的古代石掌椅子
        	Array(3010306,100,1,1),//生如夏花椅子
        	Array(3010301,50,1,1),//高级HP药水椅子
        	Array(3010188,100,1,1),//班·雷昂椅子
        	Array(3010186,100,1,1),//兔子椅子
        	Array(3010184,50,1,1),//冰钓椅子
         	Array(3010173,50,1,1),//万圣节塔罗椅子
        	Array(3010175,50,1,1),//名画家椅子
        	Array(3010195,100,1,1),//无价之宝椅子
        	Array(3010210,100,1,1),//草莓冰淇淋月饼椅子--------------
        	Array(3010224,300,1,1),//年糕冰淇淋椅子
        	Array(3010036,50,1,1),//浪漫秋千
        	Array(3010044,50,1,1),//同一红伞下
        	Array(3010111,100,1,1),//虎虎生威
        	Array(3010115,100,1,1),//熊宝宝床
        	Array(3010126,50,1,1),//蝙蝠魔王座
        	Array(3010313,50,1,1),//粉红扎昆椅子
        	Array(3010128,50,1,1),//黑龙王座
        	Array(3010133,50,1,1),//帐篷椅
        	Array(3010152,200,1,1),//黄三角帐篷椅
        	Array(3010291,50,1,1),//早日康复床
        	Array(3010172,50,1,1),//星空椅子
        	Array(3010168,50,1,1),//友谊万岁椅子
        	Array(3010185,100,1,1),//小伙伴品克缤
        	Array(3010622,100,1,1),//我的好友丹珍之椅
        	Array(3010453,50,1,1),//兔子乘风椅
        	Array(3010493,50,1,1),//那就是我--------------------------------
        	Array(3010527,50,1,1),//深海章鱼
        	Array(3010531,50,1,1),//小企鹅合唱团
        	Array(3010565,50,1,1),//我的女皇椅子
        	Array(3010587,50,1,1),//时间胶囊
        	Array(3010609,50,1,1),//不是在做梦
        	Array(3010608,50,1,1),//回顾的名画椅子
        	Array(3010661,50,1,1),//欢乐相框椅子
        	Array(3010678,50,1,1),//海加顿之安息
        	Array(3010739,50,1,1),//雪人香波椅子
        	Array(3010744,50,1,1),//回顾冒险岛的砖头朋友们
        	Array(3010752,50,1,1),//玫瑰鸟笼
        	Array(3010756,50,1,1),//新年招财猫椅子
        	Array(3010767,50,1,1),//雪人椅子
        	Array(3010760,50,1,1),//古代浴池椅子
        	Array(3010795,50,1,1),//森林中休息处
        	Array(3010806,50,1,1),//桃樱芳菲椅
        	Array(3010848,50,1,1),//红地毯主人公椅子
        	Array(3012024,50,1,1)//沙滩排球椅子
);

function start() {
	status = -1;
	action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == 1) {
        status++;
    } else {
        if (status == 0) {
           selStr = "#e#r该玩具箱可以获得以下物品，99%获得\r\n\#b是否消耗 #g1#r个#b#v5220000#\r\n来一发？#n#k\r\n";
		   for (i = 0; i < itemList.length; i++) {
                selStr += "#d#v" + itemList[i][0] + "#";
            }
			
			cm.sendOk(selStr);
            cm.dispose();
        }
        status--;
    }
    if (status == 0) {
		selStr = "\r\n";
		   for (i = 0; i < itemList.length; i++) {
                selStr += "#d#v" + itemList[i][0] + "#";
            }
        if (cm.haveItem(5220000, 1)) {
            cm.sendYesNo("只要你有#v5220000#，就可以随机可以获得以下物品，99%获得\r\n\#b是否消耗 #g1#r个#b#v5220000#\r\n来一发？?"+selStr);
        } else {
            cm.sendOk("只要你有#v5220000#，就可以随机获得以下物品，99%获得\r\n\#b是否消耗 #g1#r个#b#v5220000#\r\n来一发？?"+selStr);
            cm.safeDispose();
        }
    } else if (status == 1) {
        var chance = Math.floor(Math.random() * 600);
        var finalitem = Array();
        for (var i = 0; i < itemList.length; i++) {
            if (itemList[i][1] >= chance) {
                finalitem.push(itemList[i]);
            }
        }
			if (finalitem.length != 0) {
            var item;
            var random = new java.util.Random();
            var finalchance = random.nextInt(finalitem.length);
            var itemId = finalitem[finalchance][0];
            var quantity = finalitem[finalchance][2];
            var notice = finalitem[finalchance][3];
            item = cm.gainGachaponItem(itemId, quantity, "快乐百宝箱", notice);
            if (item != -1) {
                cm.gainItem(5220000, -1);
                cm.sendOk("你获得了 #b#t" + item + "##k " + quantity + "个。");
            } else {
                cm.sendOk("你确实有#b#v5310000##k吗？如果是，请你确认在背包的装备，消耗，其他窗口中是否有一格以上的空间。");
            }
            cm.safeDispose();
        } else {
            cm.sendOk("今天的运气可真差，什么都没有拿到。");
            cm.gainItem(5220000, -1);
			cm.gainItem(4001322,1);
            cm.safeDispose();
        }
    }
}
