/*
 
 对应的蛋：4170001
 */
var 蛋 = 5220040;
var status = 0;
//物品ID，抽奖概率，物品数量，(0/不广播，1广播)
var itemList = Array(
  Array(2290000, 800, 1, 1),

  Array(2280005, 200, 1, 1), //枫叶耳环
  Array(2280006, 200, 1, 1), //枫叶型耳环
  Array(2280007, 300, 1, 1), //枫叶型耳环
  Array(2280008, 300, 1, 1), //枫叶型耳环
  Array(2280003, 300, 1, 1), //黑水晶耳环
  Array(2280004, 300, 1, 1), //红水晶耳环
  Array(2280005, 200, 1, 1), //枫叶耳环
  Array(2280006, 200, 1, 1), //枫叶型耳环
  Array(2280007, 300, 1, 1), //枫叶型耳环
  Array(2280008, 300, 1, 1), //枫叶型耳环
  Array(2280009, 400, 1, 1), //枫叶型耳环

  Array(3010044, 600, 1, 1), //红伞椅子
  Array(3010036, 600, 1, 1), //秋千
  Array(3010049, 600, 1, 1), //学房子
  Array(3010110, 600, 1, 1), //熊
  Array(3010131, 600, 1, 1), //熊猫
  Array(1022129, 600, 1, 1), //眼睛
  Array(3012001, 600, 1, 1), //篝火
  //Array(3012002,600,1,1), //浴桶
  Array(3012003, 600, 1, 1), //爱心
  Array(3010013, 600, 1, 1), //遮阳椅
  Array(3010018, 600, 1, 1), //椰子树
  Array(3010021, 600, 1, 1), //暖暖桌
  Array(3010024, 600, 1, 1), //玩具熊
  //Array(3010025,500,1,1), //5周年枫叶纪念
  Array(3010026, 600, 1, 1), //恶灵附身

  Array(3015100, 600, 1, 1), //公主
  Array(3015183, 600, 1, 1), //公主
  Array(3015312, 600, 1, 1), //公主
  Array(3012011, 600, 1, 1), //火锅
  Array(1002622, 600, 1, 0), //水兵帽
  Array(1002677, 800, 1, 1), //玩具匠人帽
  Array(1002699, 800, 1, 1), //南瓜帽子
  //------披风------
  Array(1102040, 400, 1, 1), //浪人披风(黄)
  Array(1102041, 500, 1, 1), //浪人披风(粉)
  Array(1102042, 500, 1, 1), //浪人披风(紫)
  Array(1102043, 800, 1, 1), //浪人披风(褐)
  Array(1102140, 800, 1, 1), //卡帕莱特披风
  Array(1102147, 820, 1, 1), //玩具匠人披风
  Array(1102172, 700, 1, 1), //永恒不灭披风
  Array(1102174, 800, 1, 1), //工作人员披风
  Array(1102166, 700, 1, 1), //枫叶披风
  Array(1102167, 800, 1, 1), //枫叶披风
  Array(1102168, 800, 1, 1), //枫叶披风
  Array(1082145, 700, 1, 1), //工地手套(黄)
  Array(1082146, 800, 1, 1), //工地手套(红)
  Array(1082147, 700, 1, 1), //工地手套(蓝)
  Array(1082148, 800, 1, 1), //工地手套(紫)
  Array(1082149, 700, 1, 1), //工地手套(褐)
  Array(1082150, 900, 1, 1), //工地手套(灰)
  Array(1082175, 800, 1, 0), //马绍尔手套(赤)
  Array(1082176, 700, 1, 0), //马绍尔手套(青)
  Array(1082177, 600, 1, 0), //马绍尔手套(紫
  Array(1082178, 800, 1, 0), //马绍尔手套(桃)
  Array(1082179, 600, 1, 0), //马绍尔手套(黄)
  Array(1082234, 200, 1, 1), //永恒定边手套
  Array(1082235, 200, 1, 1), //永恒逍遥手套
  Array(1082236, 200, 1, 1), //永恒白云手套
  Array(1082237, 200, 1, 1), //永恒探云手套
  Array(1082238, 200, 1, 1), //永恒抚浪手套
  Array(1082239, 100, 1, 1), //重生定边手套
  Array(1082240, 100, 1, 1), //重生逍遥手套
  Array(1082241, 100, 1, 1), //重生白云手套
  Array(1082242, 100, 1, 1), //重生探云手套
  Array(1082243, 100, 1, 1), //重生抚浪手套
  Array(1322021, 600, 1, 0), //黑游泳圈
  Array(1322022, 600, 1, 0), //红花纹游泳圈
  Array(1322023, 600, 1, 0), //蓝花纹游泳圈
  Array(1322024, 600, 1, 0), //紫游泳圈
  Array(1322025, 600, 1, 0), //救命游泳圈
  Array(1322026, 600, 1, 0), //彩虹游泳圈
  Array(1322027, 100, 1, 0), //米伽勒的平底锅
  Array(1322051, 600, 1, 1), //七夕
  Array(1322052, 600, 1, 0), //狂龙地锤
  Array(1322054, 600, 1, 0), //枫叶地震锤
  Array(1322055, 600, 1, 0), //枫叶3年旗
  Array(1322056, 600, 1, 0), //粉色花边游泳圈
  Array(1322060, 100, 1, 1), //永恒惊破天
  Array(1322061, 100, 1, 1), //重生惊破天
  Array(1322071, 600, 1, 0), //采矿铁锹
  Array(1332032, 100, 1, 0), //圣诞树
  Array(1332055, 100, 1, 0), //枫叶锁魄铗
  Array(1332056, 100, 1, 0), //枫叶追魂刺
  Array(1332057, 100, 1, 0), //枫叶3年旗
  Array(1332073, 100, 1, 1), //永恒狂鲨锯
  Array(1332074, 100, 1, 1), //永恒断首刃
  Array(1332075, 100, 1, 1), //重生狂鲨锯
  Array(1332076, 100, 1, 1), //重生断首刃
  Array(1372030, 100, 1, 0), //天使之翼
  Array(1372031, 100, 1, 1), //圣贤短杖
  Array(1372032, 100, 1, 1), //佘太君龙杖
  Array(1372033, 100, 1, 1), //圣贤短杖
  Array(1372034, 100, 1, 0), //枫叶仙姬杖
  Array(1372035, 100, 1, 1), //火灵珠短杖
  Array(1372036, 100, 1, 1), //毒灵珠短杖
  Array(1372037, 100, 1, 1), //冰灵珠短杖
  Array(1372038, 100, 1, 1), //雷灵珠短杖
  Array(1372039, 100, 1, 1), //爆炎之杖
  Array(1372040, 100, 1, 1), //剧毒之杖
  Array(1372041, 100, 1, 1), //寒冰之杖
  Array(1372042, 100, 1, 1), //狂雷之杖
  Array(1372044, 100, 1, 1), //永恒蝶翼杖
  Array(1372045, 100, 1, 1), //重生蝶翼杖
  Array(1382057, 100, 1, 1), //永恒冰轮杖
  Array(1382059, 100, 1, 1), //重生冰轮杖
  Array(1402014, 300, 1, 1), //温度计
  Array(1402037, 150, 1, 1), //龙背刃
  Array(1402039, 300, 1, 0), //枫叶枭首剑
  Array(1402040, 300, 1, 0), //枫叶3年旗
  Array(1402041, 300, 1, 0), //粉色花边游泳圈
  Array(1402044, 300, 1, 0), //南瓜灯笼
  Array(1402046, 100, 1, 1), //永恒玄冥剑
  Array(1402047, 100, 1, 1), //重生玄冥剑
  Array(1412000, 800, 1, 0), //双手斧
  Array(1412001, 800, 1, 0), //铁斧
  Array(1412002, 800, 1, 0), //钢铁斧
  Array(1412003, 800, 1, 0), //太阳之斧
  Array(1412004, 800, 1, 0), //绿蛇刀
  Array(1412005, 800, 1, 0), //格斗斧
  Array(1412006, 800, 1, 0), //重型巨斧
  Array(1412007, 800, 1, 0), //光明斧
  Array(1412008, 800, 1, 0), //雷电斧
  Array(1412009, 800, 1, 0), //大力神之斧
  Array(1412021, 800, 1, 0), //龙魂祭
  Array(1412022, 600, 1, 0), //太阳之斧
  Array(1412023, 600, 1, 0), //光明斧
  Array(1412024, 600, 1, 0), //雷电斧
  Array(1412025, 600, 1, 0), //大力神之斧
  Array(1412026, 600, 1, 0), //炼狱魔龙斧
  Array(1412033, 100, 1, 1), //永恒碎鼋斧
  Array(1412034, 100, 1, 1), //重生碎鼋斧
  Array(1422011, 1000, 1, 0), //酒瓶
  Array(1422012, 600, 1, 0), //雷神之锤
  Array(1422013, 600, 1, 0), //狮子之魂
  Array(1422014, 1000, 1, 0), //枫叶锤
  Array(1422015, 1000, 1, 0), //黄金锤
  Array(1422028, 1000, 1, 0), //金龙轰天锤
  Array(1422029, 1000, 1, 0), //枫叶轰天镗
  Array(1422030, 800, 1, 0), //粉红海豹抱枕
  Array(1422031, 900, 1, 0), //蓝色海豹抱枕
  Array(1422032, 1000, 1, 0), //枫叶3年旗
  Array(1422033, 1000, 1, 0), //粉色花边游泳圈
  Array(1422036, 1000, 1, 0), //玩具匠人的锤子
  Array(1422037, 200, 1, 1), //永恒威震天
  Array(1422038, 400, 1, 1), //重生威震天
  Array(1432010, 500, 1, 0), //奥丁手戟
  Array(1432011, 600, 1, 0), //寒冰破魔枪
  Array(1432012, 800, 1, 0), //枫叶枪
  Array(1432013, 800, 1, 0), //南瓜枪
  Array(1432014, 900, 1, 0), //海神叉
  Array(1432015, 900, 1, 0), //红色滑雪板
  Array(1432016, 900, 1, 0), //橙色滑雪板
  Array(1432017, 900, 1, 0), //绿色滑雪板
  Array(1432018, 900, 1, 0), //蓝色滑雪板
  Array(1432023, 800, 1, 1), //奥丁手戟
  Array(1432030, 800, 1, 1), //红莲落神枪
  Array(1432034, 700, 1, 0), //银龙枪
  Array(1432035, 700, 1, 1), //奥丁手戟
  Array(1432037, 700, 1, 0), //枫叶大将旗
  Array(1432038, 800, 1, 1), //盘龙七冲枪
  Array(1432039, 700, 1, 0), //钓鱼竿
  Array(1432040, 700, 1, 0), //枫叶钻天枪
  Array(1432047, 600, 1, 1), //永恒显圣枪
  Array(1452025, 700, 1, 1), //蓝色梅杜斯
  Array(1452026, 700, 1, 1), //黑色梅杜斯
  //------药水------
  Array(2022245, 850, 5, 0), //心跳停止糖
  Array(2340000, 50, 1, 0), //祝福卷轴
  Array(2049100, 600, 1, 1), //混沌卷轴60%
  Array(1122058, 800, 1, 1), //休彼德蔓的混沌项链
  Array(1132004, 800, 1, 1), //黑贺腰带
  Array(1132010, 500, 1, 1), //黄金猪猪腰带
  Array(1132011, 500, 1, 1), //黄金猪猪腰带
  Array(1132012, 500, 1, 1), //法老的腰带
  Array(1132013, 500, 1, 1), //不灭的法老腰带
  Array(1122074, 500, 1, 1), //枫叶吊坠
  Array(1122075, 500, 1, 1), //黄金枫叶魔法吊坠
  Array(1002390, 500, 1, 1), //真扎昆头盔
  Array(1002418, 500, 1, 1), //废报纸头盔
  Array(1002419, 500, 1, 1), //枫叶帽
  Array(1112763, 50, 1, 1), //S级力量宝石戒指
  Array(1112767, 50, 1, 1), //S级运气宝石戒指
  Array(1112771, 50, 1, 1), //S级智慧宝石戒指
  Array(1112775, 50, 1, 1), //S级敏捷宝石戒指
  Array(1113070, 100, 1, 1), //真红之环
  Array(1112563, 100, 1, 1),
  Array(1112563, 100, 1, 1),
  Array(1112563, 100, 1, 1),
  Array(1112569, 100, 1, 1),
  Array(1112574, 100, 1, 1),
  Array(1112584, 100, 1, 1),
  Array(1112586, 100, 1, 1),
  Array(1112597, 50, 1, 1),
  Array(1112495, 50, 1, 1),
  Array(1112657, 200, 1, 1),
  Array(1112659, 200, 1, 1),
  Array(1112438, 200, 1, 1),
  Array(1112439, 200, 1, 1),
  Array(1112662, 100, 1, 1),
  Array(1112663, 100, 1, 1),
  Array(1112664, 200, 1, 1),
  Array(1112782, 100, 1, 1),
  Array(1112783, 100, 1, 1),
  Array(1112784, 100, 1, 1),
  Array(1112785, 100, 1, 1),
  Array(1112786, 100, 1, 1),
  Array(1122104, 100, 1, 1),
  Array(1122148, 100, 1, 1),
  Array(1122149, 100, 1, 1),
  Array(1122150, 100, 1, 1),
  Array(1092109, 100, 1, 1),
  Array(1092110, 100, 1, 1),
  Array(1092111, 100, 1, 1),
  Array(1032142, 100, 1, 1),
  Array(1122197, 100, 1, 1),
  Array(1132152, 100, 1, 1),
  Array(1112738, 100, 1, 1),
  Array(1052460, 100, 1, 1),
  Array(1082432, 100, 1, 1),
  Array(1072664, 100, 1, 1),
  Array(1003540, 100, 1, 1),
  Array(1302224, 100, 1, 1),
  Array(1312115, 100, 1, 1),
  Array(1322161, 100, 1, 1),
  Array(1332192, 100, 1, 1),
  Array(1342070, 100, 1, 1),
  Array(1402150, 100, 1, 1),
  Array(1382167, 100, 1, 1),
  Array(1412103, 100, 1, 1),
  Array(1422106, 100, 1, 1),
  Array(1432137, 100, 1, 1),
  Array(1442181, 100, 1, 1),
  Array(1452168, 100, 1, 1),
  Array(1462157, 100, 1, 1),
  Array(1472178, 100, 1, 1),
  Array(1482139, 100, 1, 1),
  Array(1472178, 100, 1, 1),
  Array(1022129, 400, 1, 1), //精灵眼镜
  Array(1022232, 90, 1, 1), //布莱克缤童
  Array(1012474, 100, 1, 1), //10周年大赏枫叶脸饰
  Array(1122015, 300, 1, 1), //枫叶围巾
  Array(1122077, 300, 1, 1), //黄金枫叶魔法吊坠
  Array(1012318, 300, 1, 1), //9周年枫叶
  Array(1102481, 10, 1, 1), //暴君
  Array(1102482, 10, 1, 1),
  Array(1452302, 10, 1, 1),
  Array(1302310, 10, 1, 1),
  Array(1402307, 20, 1, 1),
  Array(1382234, 20, 1, 1),
  Array(1432152, 20, 1, 1),
  Array(1442182, 30, 1, 1),
  Array(1102483, 30, 1, 1),
  Array(1102484, 30, 1, 1),
  Array(1102485, 30, 1, 1), //暴君
  Array(1082543, 30, 1, 1),
  Array(1082544, 30, 1, 1),
  Array(1082545, 30, 1, 1),
  Array(1082546, 30, 1, 1),
  Array(1082547, 10, 1, 1), //暴君
  Array(1072743, 10, 1, 1),
  Array(1072744, 10, 1, 1),
  Array(1072745, 10, 1, 1),
  Array(1072746, 10, 1, 1),
  Array(1072747, 10, 1, 1),
  Array(1132174, 10, 1, 1),
  Array(1132175, 10, 1, 1),
  Array(1132176, 10, 1, 1),
  Array(1132177, 10, 1, 1),
  //Array(1132178, 300, 1, 1),//暴君
  Array(1472178, 30, 1, 1), //恐怖
  Array(1012170, 300, 1, 1),
  Array(1012171, 300, 1, 1),
  Array(1012172, 300, 1, 1),
  Array(1012173, 60, 1, 1),
  Array(1012174, 30, 1, 1), //恐怖
  //Array(1132243, 100, 1, 1),//低级贝勒德
  //Array(1132244, 50, 1, 1),
  //Array(1132245, 300, 1, 1),
  //Array(1132246, 300, 1, 1),
  //Array(1122264, 100, 1, 1),
  //Array(1122265, 50, 1, 1),
  //Array(1122266, 300, 1, 1),
  //Array(1122267, 300, 1, 1),
  Array(1032220, 100, 1, 1),
  //Array(1032221, 50, 1, 1),
  //Array(1402309, 50, 1, 1),//神器
  //Array(1402310, 50, 1, 1),//神器
  //Array(1402311, 50, 1, 1),//神器
  //Array(1402312, 50, 1, 1),//神器
  //Array(1402313, 50, 1, 1),//神器
  //Array(1402315, 50, 1, 1),//神器
  //Array(1402316, 50, 1, 1),//神器
  //Array(1402328, 50, 1, 1),//神器
  //Array(1402329, 50, 1, 1),//神器
  //Array(1402330, 20, 1, 1),//神器
  //Array(1402330, 20, 1, 1),//神器
  //Array(1432154, 10, 1, 1),//神器
  //Array(1432155, 20, 1, 1),//神器
  //Array(1432156, 50, 1, 1),//神器
  //Array(1452303, 150, 1, 1),//神器304G
  //Array(1032222, 300, 1, 1),
  //Array(1032223, 300, 1, 1),
  Array(1402214, 600, 1, 1),
  Array(1382226, 600, 1, 1),
  Array(1432182, 600, 1, 1),
  Array(1452220, 600, 1, 1),
  Array(1462208, 600, 1, 1),
  Array(1472230, 600, 1, 1),
  Array(1482183, 600, 1, 1),
  Array(1492194, 600, 1, 1), //红武
  Array(2043003, 100, 1, 1), //必成
  Array(2043103, 100, 1, 1),
  Array(2043203, 100, 1, 1),
  Array(2043303, 100, 1, 1),
  Array(2043703, 100, 1, 1),
  Array(2043803, 100, 1, 1),
  Array(2044003, 100, 1, 1),
  Array(2044019, 100, 1, 1),
  Array(2044103, 100, 1, 1),
  Array(2044203, 100, 1, 1),
  Array(2044303, 100, 1, 1),
  Array(2044403, 100, 1, 1),
  Array(2044503, 100, 1, 1),
  Array(2044603, 100, 1, 1),
  Array(2044703, 100, 1, 1),
  Array(2044815, 100, 1, 1),
  Array(2044908, 100, 1, 1), //必成
  Array(2040874, 300, 1, 1), //暴风手套卷
  Array(2040875, 300, 1, 1), //暴风手套卷
  Array(1372177, 10, 1, 1), //FFN套
  Array(1302275, 10, 1, 1),
  Array(1312153, 10, 1, 1),
  Array(1322203, 10, 1, 1),
  Array(1332225, 10, 1, 1),
  Array(1402196, 10, 1, 1),
  Array(1412135, 10, 1, 1),
  Array(1432167, 10, 1, 1),
  Array(1442223, 10, 1, 1),
  Array(1452205, 10, 1, 1),
  Array(1462193, 10, 1, 1),
  //-------160级埃苏莱布-----
  Array(1402251, 150, 1, 1), //
  Array(1412177, 150, 1, 1), //
  Array(1422184, 150, 1, 1), //
  Array(1432214, 150, 1, 1), //
  Array(1442268, 150, 1, 1), ///
  Array(1452252, 150, 1, 1), //
  Array(1462239, 150, 1, 1), //
  Array(1472261, 150, 1, 1), //
  Array(1482216, 150, 1, 1), //
  Array(1492231, 150, 1, 1), //
  Array(1332274, 150, 1, 1), //
  Array(1302333, 150, 1, 1), //
  Array(1382259, 150, 1, 1), //
  //-------160级埃苏莱布防具-----
  Array(1004422, 150, 1, 1), //
  Array(1004423, 150, 1, 1), //
  Array(1004424, 150, 1, 1),
  Array(1004425, 150, 1, 1),
  Array(1004426, 150, 1, 1),
  Array(1102775, 150, 1, 1),
  Array(1102794, 150, 1, 1),
  Array(1102795, 150, 1, 1),
  Array(1102796, 150, 1, 1),
  Array(1102797, 150, 1, 1),
  Array(1082636, 150, 1, 1),
  Array(1082637, 150, 1, 1),
  Array(1082638, 150, 1, 1),
  Array(1082639, 150, 1, 1),
  Array(1082640, 150, 1, 1),
  Array(1052882, 150, 1, 1),
  Array(1052887, 150, 1, 1),
  Array(1052888, 150, 1, 1),
  Array(1052889, 150, 1, 1),
  Array(1052890, 150, 1, 1),
  Array(1073030, 150, 1, 1),
  Array(1073032, 150, 1, 1),
  Array(1073033, 150, 1, 1),
  Array(1073034, 150, 1, 1),
  Array(1073035, 150, 1, 1), //
  Array(1472214, 50, 1, 1),
  Array(1482168, 50, 1, 1),
  Array(1092049, 100, 1, 1),
  Array(2070006, 200, 1, 1), //齿轮
  Array(2070007, 100, 1, 1), //月牙
  Array(2070005, 300, 1, 1), //金钱
  Array(1492179, 20, 1, 1), //FFN武器
  Array(1003797, 10, 1, 1), //FFN
  Array(1003798, 20, 1, 1), //FFN
  Array(1003799, 10, 1, 1), //FFN
  Array(1003800, 20, 1, 1), //FFN
  Array(1003801, 10, 1, 1), //FFN
  Array(1042254, 20, 1, 1), //FFN
  Array(1042255, 10, 1, 1), //FFN
  Array(1042256, 20, 1, 1), //FFN
  Array(1042257, 10, 1, 1), //FFN
  Array(1042258, 20, 1, 1), //FFN
  Array(1062165, 30, 1, 1), //FFN
  Array(1062166, 20, 1, 1), //FFN
  Array(1062167, 30, 1, 1), //FFN
  Array(1062168, 20, 1, 1), //FFN
  Array(1062169, 10, 1, 1), //FFN
  Array(2044703, 100, 1, 1),
  Array(1492149, 600, 1, 1)
);

function start() {
  status = -1;
  action(1, 0, 0);
}

function action(mode, type, selection) {
  if (mode == 1) {
    status++;
  } else {
    if (status == 0) {
      cm.sendOk("你没有 " + cm.显示物品(5220000) + " ？");
      cm.dispose();
    }
    status--;
  }
  if (status == 0) {
    if (cm.haveItem(5220000, 1)) {
      var str1 = "";
      for (var i = 0; i < itemList.length; i++) {
        str1 += "#v" + itemList[i][0] + "#";
      }
      cm.sendYesNo(
        "欢迎光临，1张" +
          cm.显示物品(5220000) +
          "抽一次，运气好能抽到极品装备哦#r\r\nPS：通过《快乐百宝箱》获得#k，\r\n下面展示#r部分抽奖样品#k！#r<每样物品只展示一种！！>\r\n    #v1402214##v1092022##v1402014##v1402037##v1002799##v1302087##v1442039##v1302063##v1302106##v1113070##v1112763##v1112767##v1112771##v1112775##v1332225##v1402196##v1372177##v1022129##v1022232##v1012474##v1122015##v1122077##v1012318##v1012174##v1003799##v1062166##v1003798##v1042255##v1132178##v1102481##v1072743##v1082543##v2043003##v2040874##v2040875##v2340000##v2049170##v2049129##v2049000##v2070005##v2070006##v2070007##v2070011##v3010131##v3012001##v3010018##v3010025##v3010043##v3010070##v3015051##v3012002##v3010760##v3010071##v3010601##v3012011##v3010744#"
      );
    } else {
      var str1 = "\r\n";
      for (var i = 0; i < itemList.length; i++) {
        str1 += "#v" + itemList[i][0] + "#";
      }
      cm.sendOk(
        "抽一次奖需要1张" +
          cm.显示物品(5220000) +
          "抽一次，你背包里有足够的#b" +
          cm.显示物品(5220000) +
          "#k吗，运气好能抽到极品装备哦#r\r\nPS：通过《快乐百宝箱》获得#k，\r\n下面展示#r部分抽奖样品#k！#r<每样物品只展示一种！！>\r\n#v1402214##v1092022##v1402014##v1402037##v1002799##v1302087##v1442039##v1302063##v1302106##v1113070##v1112763##v1112767##v1112771##v1112775##v1332225##v1402196##v1372177##v1022129##v1022232##v1012474##v1122015##v1122077##v1012318##v1012174##v1003799##v1062166##v1003798##v1042255##v1132178##v1102481##v1072743##v1082543##v2043003##v2040874##v2040875##v2340000##v2049170##v2049129##v2049000##v2070005##v2070006##v2070007##v2070011##v3010131##v3012001##v3010018##v3010025##v3010043##v3010070##v3015051##v3012002##v3010760##v3010071##v3010601##v3012011##v3010744#"
      );
      cm.safeDispose();
    }
  } else if (status == 1) {
    var chance = Math.floor(Math.random() * 800);
    var finalitem = Array();
    for (var i = 0; i < itemList.length; i++) {
      if (itemList[i][1] >= chance) {
        finalitem.push(itemList[i]);
      }
    }
    if (finalitem.length != 0) {
      if (finalitem.length == 0) {
        return 1;
      }
      var item;
      var random = new java.util.Random();
      var finalchance = random.nextInt(finalitem.length);
      var itemId = finalitem[finalchance][0];
      var quantity = finalitem[finalchance][2];
      var notice = finalitem[finalchance][3];
      item = cm.gainGachaponItem(itemId, quantity, "快乐百宝箱", notice);
      if (item != -1) {
        cm.gainItem(5220000, -1);
        cm.sendOk("你获得了 " + cm.显示物品(item) + " x #b" + quantity + "#k");
      } else {
        cm.sendOk(
          "请你确认在背包的装备，消耗，其他窗口中是否有一格以上的空间。"
        );
      }
      cm.safeDispose();
    } else {
      cm.sendOk("今天的运气可真差，什么都没有拿到。");
      cm.safeDispose();
    }
    cm.safeDispose();
  }
}
