/*
 抽奖副本
 */
        var status = 0;
var psrw = Array(
        Array(2049373, 1),//星之力10星强化券
        Array(2049373, 1),//星之力10星强化券
        Array(2049373, 1),//星之力10星强化券
        Array(2049383, 1),//星之力14星强化券
        Array(2049371, 1),//星之力17星强化券
        Array(2614005, 1),//百万
		Array(2614005, 1),//百万
		Array(2614005, 1),//百万
		Array(2614005, 1),//百万
		Array(2614005, 1),//百万
		Array(2614005, 1),//百万
		Array(2614005, 1),//百万
		Array(2614005, 1),//百万
		Array(2614005, 1),//百万
		Array(2614005, 1),//百万
		Array(2614005, 1),//百万
		Array(2614005, 1),//百万
		Array(2614005, 1),//百万
		Array(2614005, 1),//百万
		Array(2614005, 1),//百万
		Array(2614005, 1),//百万
		Array(2614005, 1),//百万
		Array(2614005, 1),//百万
		Array(2614005, 1),//百万
		Array(2614005, 1),//百万
        Array(2614005, 1),//百万
        Array(2614005, 1),//百万
        Array(2614005, 1),//百万
        Array(2614005, 1),//百万,
        Array(2049025, 1),//白医
        Array(2049025, 1),//白医
        Array(4031997, 1),//蘑菇金
        Array(4031997, 1),//蘑菇金
        Array(4031997, 1),//蘑菇金
        Array(4031997, 1),//蘑菇金
        Array(4031997, 1),//蘑菇金
        Array(4031997, 1),//蘑菇金
        Array(4000463, 5),//中介
		Array(4000463, 5),//中介
		Array(4000463, 5),//中介
		Array(4000463, 5),//中介
		Array(4000463, 5),//中介
		Array(4000463, 5),//中介
		Array(4000463, 5),//中介
		Array(4000463, 5),//中介
		Array(4000463, 5),//中介
		Array(4000463, 5),//中介
		Array(4000463, 5),//中介
		Array(4000463, 6),//中介
		Array(4000463, 6),//中介
		Array(4000463, 7),//中介
		Array(4000463, 7),//中介
		Array(4000463, 7),//中介
		Array(4000463, 7),//中介
		Array(4000463, 7),//中介
		Array(4000463, 7),//中介
		Array(4000463, 7),//中介
		Array(4000463, 7),//中介
		Array(4000463, 7),//中介
		Array(4000463, 7),//中介
		Array(4000463, 7),//中介
		Array(4000463, 8),//中介
		Array(4000463, 8),//中介
		Array(4000463, 20),//中介
		Array(2614057, 1),//千万
        Array(2049323, 1),//无损
		Array(2049323, 1),//无损
		Array(2049323, 1),//无损
		Array(2049323, 2),//无损
		Array(2049323, 5),//无损
		Array(2049323, 5),//无损
		Array(2049323, 5),//无损
		Array(2049323, 5),//无损
		Array(2049323, 5),//无损
		Array(2049323, 5),//无损
		Array(2049323, 5),//无损
		Array(2049323, 5),//无损
		Array(2049323, 5),//无损
		Array(2049323, 5),//无损
		Array(2049323, 5),//无损
		Array(2049323, 5),//无损
		Array(2049323, 5),//无损
		Array(2049323, 5),//无损
		Array(2049323, 5),//无损
		Array(2049323, 5),//无损
		Array(2049323, 5),//无损
		Array(2049323, 5),//无损
		Array(2049323, 5),//无损
		Array(2049323, 5),//无损
		Array(2049323, 5),//无损
		Array(2049323, 5),//无损
		Array(2049323, 5),//无损
		Array(2049323, 5),//无损
		Array(2049323, 5),//无损
		Array(2049323, 5),//无损
		Array(2049323, 5),//无损
		Array(2049323, 5),//无损
		Array(2049323, 5),//无损
		Array(2049323, 5),//无损
		Array(2049323, 5),//无损
		Array(2049323, 5),//无损
		Array(2049323, 7),//无损
		Array(2049323, 20),//无损
		Array(2049116, 2),//强混
		Array(2049116, 2),//强混
		Array(2049116, 2),//强混
		Array(2049116, 2),//强混
		Array(2049116, 2),//强混
		Array(2049116, 2),//强混
		Array(2049116, 2),//强混
		Array(2049116, 2),//强混
		Array(2049116, 2),//强混
		Array(2049116, 2),//强混
		Array(2049116, 2),//强混
		Array(2049116, 2),//强混
		Array(2049116, 5),//强混
		Array(2049116, 5),//强混
		Array(2049116, 5),//强混
		Array(2049116, 5),//强混
		Array(2049116, 5),//强混
		Array(2049116, 5),//强混
		Array(2049116, 5),//强混
		Array(2049116, 20),//强混
		Array(2049600, 3),//还原
		Array(2049600, 3),//还原
		Array(2049600, 3),//还原
		Array(2049600, 3),//还原
		Array(2049600, 3),//还原
		Array(2049600, 3),//还原
		Array(2049600, 3),//还原
		Array(2049600, 3),//还原
		Array(2049600, 3),//还原
		Array(2049600, 3),//还原
		Array(2049600, 3),//还原
		Array(2049600, 3),//还原
		Array(2049600, 3),//还原
		Array(2049600, 7),//还原
		Array(2049600, 20),//还原
        //Array(1003801, 1),				 //高贵流浪者帽-海盗
        //Array(1003800, 1),                //高贵刺客软帽-飞侠
       // Array(1003797, 1),                //高贵战士头盔-战士
       // Array(1003799, 1),                //高贵游侠贝雷帽-弓
		Array(2049600, 3),//还原
		Array(2049600, 3),//还原
		Array(2049600, 3),//还原
		Array(2049600, 3),//还原
		Array(2049600, 3),//还原
		Array(2049600, 3),//还原
		Array(2049600, 3),//还原
		Array(2049600, 3),//还原
		Array(2049600, 3),//还原
		Array(2049600, 3),//还原
       // Array(1003798, 1),                //高贵流丹维奇帽-法
       // Array(1042255, 1),                //鹰眼丹维奇长袍-法
       // Array(1042254, 1),                //鹰眼战士盔甲-战士
       // Array(1042257, 1),                //鹰眼刺客衬衣-飞侠
       // Array(1042256, 1),                //鹰眼游侠斗篷-弓箭
        //Array(1042258, 1),                //鹰眼流浪者外衣-海
		Array(2049116, 2),//强混
		Array(2049116, 2),//强混
		Array(2049116, 2),//强混
		Array(2049116, 2),//强混
		Array(2049116, 2),//强混
		Array(2049116, 2),//强混
		Array(2049116, 2),//强混
		Array(2049116, 2),//强混
		Array(2049116, 2),//强混
		Array(2049116, 2),//强混
		Array(2049116, 2),//强混
		Array(2049116, 2),//强混
		Array(2049116, 2),//强混
		Array(2049116, 2),//强混
		Array(2049116, 2),//强混
		Array(2049116, 2),//强混
		Array(2049116, 2),//强混
		Array(2049116, 2),//强混
		Array(2049116, 2),//强混
		Array(2049116, 2),//强混
		Array(2049116, 2),//强混
		Array(2049116, 2),//强混
		Array(2048749, 1),//火花
		Array(2048749, 1),//火花
		Array(2048749, 1),//火花
		Array(2048749, 1),//火花
		Array(2048749, 1),//火花
		Array(2048749, 1),//火花
		Array(2048749, 1),//火花
		Array(2048749, 1),//火花
		Array(2048749, 1),//火花
		Array(2048749, 1),//火花
		Array(2048749, 1),//火花
		Array(2048749, 1),//火花
		Array(2048749, 1),//火花
		Array(2048749, 1),//火花
		Array(2048749, 1),//火花
		Array(2048749, 1),//火花
		Array(2048749, 1),//火花
		Array(2048749, 1),//火花
		Array(2048749, 1),//火花
		Array(2048749, 1),//火花
		Array(2048749, 1),//火花
		Array(2048749, 1),//火花
		Array(2048749, 1),//火花
       // Array(1062168, 1),                //魔术师刺客短裤  -飞侠
       // Array(1062169, 1),                //魔术师流浪者短裤-海盗
       // Array(1062166, 1),                //魔术师丹维奇短裤-魔法
       // Array(1062167, 1),                //魔术师游侠短裤-弓箭手
       // Array(1062165, 1),                //魔术师战士短裤  -战士
		Array(1232119, 1),//天照的猛岚剑
		Array(1302349, 1),//天照的从云剑
		Array(1312209, 1),//天照的天月斧
		Array(1322261, 1),//天照的金刚杵
		Array(1402265, 1),//天照的御魂剑
		Array(1432224, 1),//天照的灭风戟
		Array(2049323, 1),//天照的天羽羽嶄
		Array(1542124, 1),//天照的村正
		Array(1452263, 1),//大山的火魂弓
		Array(1462249, 1),//大山的通莲弓
		Array(1422149, 1),//大山的双龙闪弩
		Array(1242134, 1),//月夜见尊的天雷剑
		Array(1332286, 1),//月夜见尊的斩杀刀
		Array(1342109, 1),//月夜见尊的斩死刀
		Array(1362146, 1),//月夜见尊的惨鬼杖
		Array(1472271, 1),//月夜见尊的惨魔拳
		Array(1222119, 1),//素盏乌尊的渱击炮
		Array(1482229, 1),//素盏乌尊的惨血熊千
		Array(1492241, 1),//手枪
		Array(1532154, 1),//大炮
		Array(1212126, 1),//双头杖
		Array(1252102, 1),//灵魂棒
		Array(1262046, 1),//esp
		Array(1372234, 1),//短杖
		Array(1382271, 1),//长杖
		Array(1552126, 1)//扇子
        );
var rand = Math.floor(Math.random() * psrw.length);

function start() {
    status = -1;
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (status == 0 && mode == 0) {
        cm.dispose();
        return;
    }
    if (mode == 1) {
        status++;
    } else {
        status--;
    }
    if (status == 0) {
        cm.askYesNo("牛逼了，既然你已经打败妖僧，请务必获取妖僧掉落物 #r#t2430513##k，我会赠送您一份小礼物。");
    } else if (status == 1) {
        if (cm.haveItem(2430513, 1) == false) {
            cm.sendOk("你没有1个#v2430513##z2430513#");
            cm.dispose();
        } else if (cm.getSpace(1) < 1 && cm.getSpace(2) < 1 && cm.getSpace(3) < 1 && cm.getSpace(4) < 1 && cm.getSpace(5) < 1) {
            cm.sendOk("你保证你背包的每一栏都有空位");
            cm.dispose();
        } else {
            var ii = cm.getItemInfo();
            cm.gainItem(psrw[rand][0], +psrw[rand][1]); //随机这个道具
            cm.removeAll(2430513); //减少1个使用的这个道具
            cm.warp(101050000);
            cm.gainItem(2432205, 1);//升级药水
            cm.gainItem(5062024, 10);//三角魔法
            cm.gainItem(4031997, 10);//蘑菇金币
            cm.setBossLog("Heros");
            cm.sendOk("获取了 #v" + psrw[rand][0] + "# " + psrw[rand][1] + "个，#b升级药水#k1个，#b蘑菇金币#k10个，#b三角魔方#k10个。");
            cm.worldSpouseMessage(0x0C, "『武林妖僧』" + " : " + "[" + cm.getChar().getName() + "]获得了" + psrw[rand][1] + "个<" + ii.getName(psrw[rand][0]) + ">,快去挑战吧");
            cm.dispose();
        }
    }
}

