/*
 *  @功能：    BOSS次数查询
 *  @作者：    彩虹工作室
 *  @时间：    2017年1月18日
 */
var ico = "#fUI/SoulUI.img/DungeonMap/icon/dungeonItem/0#";//"+ttt3+"//美化圆
var boss = Array(
	Array("无尽000-020层      ", "无尽之塔000-020层", "进阶扎昆", 1, 3),
	Array("无尽020-040层      ", "无尽之塔020-040层", "进阶扎昆", 1, 3),
	Array("无尽040-060层      ", "无尽之塔040-060层", "进阶扎昆", 1, 3),
	Array("无尽060-080层      ", "无尽之塔060-080层", "进阶扎昆", 1, 3),
	Array("无尽080-100层      ", "无尽之塔080-100层", "进阶扎昆", 1, 3),
	Array("无尽100-120层      ", "无尽之塔100-120层", "进阶扎昆", 1, 3),
	Array("无尽120-140层      ", "无尽之塔120-140层", "进阶扎昆", 1, 3),
	Array("无尽140-160层      ", "无尽之塔140-160层", "进阶扎昆", 1, 3),
	Array("无尽160-180层      ", "无尽之塔160-180层", "进阶扎昆", 1, 3),
	Array("无尽180-200层      ", "无尽之塔180-200层", "进阶扎昆", 1, 3),
	Array("帝国副本           ", "帝国副本", "进阶扎昆", 1, 3),
	Array("神话副本           ", "神话副本", "进阶扎昆", 1, 3),
	Array("普通航海           ", "普通 航海王", "进阶扎昆", 1, 3),
	Array("困难航海           ", "困难 航海王", "进阶扎昆", 2, 3),
	Array("火焰狼             ", "火焰狼", "进阶扎昆", 3, 3),
    Array("钻机               ", "钻机", "进阶扎昆", 1, 3),
    Array("品克缤             ", "混沌品克缤", "进阶扎昆", 1, 3),
    Array("森兰丸             ", "森兰丸", "进阶扎昆", 1, 3),
    Array("武陵图腾           ", "武陵图腾", "进阶扎昆", 1, 3),
    Array("希纳斯             ", "希纳斯", "进阶扎昆", 3, 3),
    Array("浓姬               ", "浓姬", "进阶扎昆", 1, 3),
    Array("腥血女王           ", "进阶腥血女王", "进阶扎昆", 1, 3),
    Array("皮埃尔             ", "进阶皮埃尔", "进阶扎昆", 1, 3),
    Array("半半               ", "进阶半半", "进阶扎昆", 1, 3),
    Array("贝伦               ", "进阶贝伦", "进阶扎昆", 1, 3),
    Array("贝勒德             ", "贝勒德", "进阶扎昆", 1, 3),
    Array("斯乌               ", "斯乌[远征队]", "进阶扎昆", 1, 3),
    Array("麦格纳斯           ", "麦格纳斯[进阶]", "进阶扎昆", 1, 3),
    Array("桃乐丝             ", "桃乐丝", "进阶扎昆", 1, 3),
    Array("戴米安             ", "戴米安", "进阶扎昆", 1, 3),
    Array("觉醒希拉           ", "觉醒希拉", "进阶扎昆", 1, 3),
    Array("路西德             ", "路西德[进阶]", "进阶扎昆", 1, 3),
    Array("觉醒威尔           ", "威尔", "进阶扎昆", 1, 3),
    Array("阿勒玛             ", "阿勒玛", "进阶扎昆", 1, 3),
    Array("乌鲁斯             ", "乌鲁斯", "进阶扎昆", 1, 3),
    Array("年兽               ", "庆典年兽", "进阶扎昆", 3, 3),
    Array("至暗魔晶           ", "至暗魔晶", "进阶扎昆", 1, 3),
    Array("敦凯尔             ", "敦凯尔", "进阶扎昆", 1, 3),
    Array("黑魔法师           ", "黑魔法师", "进阶扎昆", 1, 3),
    Array("挑战心魔           ", "挑战心魔", "进阶扎昆", 1, 3),
    Array("两只狮子           ", "两只狮子", "进阶扎昆", 1, 3),
    Array("外星入侵           ", "外星入侵", "进阶扎昆", 1, 3)
	
)
var boss1 = [
    ["扎昆", "普通扎昆", "进阶扎昆", 3, 3]
]

function start() {
    var text = "\t#fs18##d#e以下是您今日副本剩余挑战次数\r\n#fs12##b#n\r\n";
    for (var i = 0; i < boss.length; i++) {
        var element = boss[i];
        text += "#fs15##k" + "  " + ico + element[0] + "   剩余" + "(#b" + (element[3] - cm.getPQLog(element[1])) + "#k/#r" + element[3] + "#k次)\r\n"
    }
    cm.sendOk(text);
    cm.dispose();
}