/*


 */
var 城镇 = "魔法密林";
var status = 0;
//物品ID，抽奖概率，物品数量，(0/不广播，1广播)
var itemList =
        Array(	
			Array(1032026, 500, 1, 1), //黄水晶耳环
Array(2280003, 300, 1, 1), //黑水晶耳环
Array(2280004, 300, 1, 1), //红水晶耳环
Array(2280005, 200, 1, 1), //枫叶耳环
Array(2280006, 200, 1, 1), //枫叶型耳环
Array(2280007, 300, 1, 1), //枫叶型耳环
Array(2280008, 300, 1, 1), //枫叶型耳环
Array(2280009, 400, 1, 1), //枫叶型耳环
Array(2280010, 500, 1, 1), //枫叶型耳环
Array(2280012, 500, 1, 1), //枫叶型耳环
Array(2280013, 500, 1, 1), //枫叶型耳环
Array(2280014, 500, 1, 1), //枫叶型耳环
Array(2280015, 500, 1, 1), //枫叶型耳环
Array(2280016, 500, 1, 1), //枫叶型耳环
Array(2290126, 500, 1, 1), //枫叶型耳环
Array(2290127, 500, 1, 1), //枫叶型耳环
Array(2290128, 500, 1, 1), //枫叶型耳环
Array(2290129, 500, 1, 1), //枫叶型耳环
Array(2290130, 500, 1, 1), //枫叶型耳环
Array(2290131, 500, 1, 1), //枫叶型耳环
Array(2290132, 500, 1, 1), //枫叶型耳环
Array(2290133, 500, 1, 1), //枫叶型耳环
Array(2290134, 500, 1, 1), //枫叶型耳环
Array(2280013, 500, 1, 1), //枫叶型耳环
Array(2280014, 500, 1, 1), //枫叶型耳环
Array(2280015, 500, 1, 1), //枫叶型耳环
Array(2280016, 500, 1, 1), //枫叶型耳环
Array(2290126, 500, 1, 1), //枫叶型耳环
Array(2280003, 300, 1, 1), //黑水晶耳环
Array(2280004, 300, 1, 1), //红水晶耳环
Array(2280005, 200, 1, 1), //枫叶耳环
Array(2280006, 200, 1, 1), //枫叶型耳环
Array(2280007, 300, 1, 1), //枫叶型耳环
Array(2280008, 300, 1, 1), //枫叶型耳环
Array(2280009, 400, 1, 1), //枫叶型耳环
Array(2280010, 500, 1, 1), //枫叶型耳环
Array(2280012, 500, 1, 1), //枫叶型耳环
Array(2280013, 500, 1, 1), //枫叶型耳环
Array(2280014, 500, 1, 1), //枫叶型耳环
Array(2280015, 500, 1, 1), //枫叶型耳环
Array(2280016, 500, 1, 1), //枫叶型耳环
Array(2290126, 500, 1, 1), //枫叶型耳环
Array(2290127, 500, 1, 1), //枫叶型耳环
Array(2290128, 500, 1, 1), //枫叶型耳环
Array(2280003, 300, 1, 1), //黑水晶耳环
Array(2280004, 300, 1, 1), //红水晶耳环
Array(2280005, 200, 1, 1), //枫叶耳环
Array(2280006, 200, 1, 1), //枫叶型耳环
Array(2280007, 300, 1, 1), //枫叶型耳环
Array(2280008, 300, 1, 1), //枫叶型耳环
Array(2280009, 400, 1, 1), //枫叶型耳环
Array(2280010, 500, 1, 1), //枫叶型耳环
Array(2280012, 500, 1, 1), //枫叶型耳环
Array(2280013, 500, 1, 1), //枫叶型耳环
Array(2280014, 500, 1, 1), //枫叶型耳环
Array(2280015, 500, 1, 1), //枫叶型耳环
Array(2280016, 500, 1, 1), //枫叶型耳环
Array(2290126, 500, 1, 1), //枫叶型耳环
Array(2290127, 500, 1, 1), //枫叶型耳环
Array(2290128, 500, 1, 1), //枫叶型耳环
Array(2290127, 500, 1, 1), //枫叶型耳环
Array(2290128, 500, 1, 1), //枫叶型耳环
Array(2290129, 500, 1, 1), //枫叶型耳环
Array(2290130, 500, 1, 1), //枫叶型耳环
Array(2290131, 500, 1, 1), //枫叶型耳环
Array(2290132, 500, 1, 1), //枫叶型耳环
Array(2290133, 500, 1, 1), //枫叶型耳环
Array(2290134, 500, 1, 1), //枫叶型耳环
Array(2290135, 500, 1, 1), //枫叶型耳环
Array(2290136, 500, 1, 1), //枫叶型耳环
Array(2290137, 500, 1, 1), //枫叶型耳环
Array(2290138, 500, 1, 1), //枫叶型耳环
Array(2280013, 500, 1, 1), //枫叶型耳环
Array(2280014, 500, 1, 1), //枫叶型耳环
Array(2280015, 500, 1, 1), //枫叶型耳环
Array(2280016, 500, 1, 1), //枫叶型耳环
Array(2290126, 500, 1, 1), //枫叶型耳环
Array(2290127, 500, 1, 1), //枫叶型耳环
Array(2290128, 500, 1, 1), //枫叶型耳环
Array(2290129, 500, 1, 1), //枫叶型耳环
Array(2290130, 500, 1, 1), //枫叶型耳环
Array(2290131, 500, 1, 1), //枫叶型耳环
Array(2290132, 500, 1, 1), //枫叶型耳环
Array(2290133, 500, 1, 1), //枫叶型耳环
Array(2290134, 500, 1, 1), //枫叶型耳环
Array(2290135, 500, 1, 1), //枫叶型耳环
Array(2290136, 500, 1, 1), //枫叶型耳环
Array(2290137, 500, 1, 1), //枫叶型耳环
Array(2290138, 500, 1, 1), //枫叶型耳环
Array(2280013, 500, 1, 1), //枫叶型耳环
Array(2280014, 500, 1, 1), //枫叶型耳环
Array(2280015, 500, 1, 1), //枫叶型耳环
Array(2280016, 500, 1, 1), //枫叶型耳环
Array(2290126, 500, 1, 1), //枫叶型耳环

Array(2290139, 500, 1, 1)

                );

function start() {
    status = -1;
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == 1) {
        status++;
    } else {
        if (status == 0) {
            cm.sendOk("你没有 " + cm.显示物品(4110010) + " ？");
            cm.dispose();
        }
        status--;
    }
    if (status == 0) {
        if (cm.haveItem(4110010, 100000)) {
            var str1 = "";
            for (var i = 0; i < itemList.length; i++) {
                str1 += "#v" + itemList[i][0] + "#";
            }
            cm.sendYesNo("我今天罢工了");
        } else {
            var str1 = "\r\n";
            for (var i = 0; i < itemList.length; i++) {
                str1 += "#v" + itemList[i][0] + "#";
            }
            cm.sendOk("我今天罢工了");
            cm.safeDispose();
        }
    } else if (status == 1) {
        var chance = Math.floor(Math.random() * 500);
        var finalitem = Array();
        for (var i = 0; i < itemList.length; i++) {
            if (itemList[i][1] >= chance) {
                finalitem.push(itemList[i]);
            }
        }
        if (finalitem.length != 0) {
            if (finalitem.length == 0) {
                return 1;
            }
            var item;
            var random = new java.util.Random();
            var finalchance = random.nextInt(finalitem.length);
            var itemId = finalitem[finalchance][0];
            var quantity = finalitem[finalchance][2];
            var notice = finalitem[finalchance][3];
            item = cm.gainGachaponItem(itemId, quantity, "豆豆屋", notice);
            if (item != -1) {
                cm.gainItem(4110010, -1);
                cm.sendOk("你获得了 " + cm.显示物品(item) + " x #b"+quantity+"#k");
            } else {
                cm.sendOk("请你确认在背包的装备，消耗，其他窗口中是否有一格以上的空间。");
            }
            cm.safeDispose();
        } else {
            cm.sendOk("今天的运气可真差，什么都没有拿到。");
            cm.safeDispose();
        }
        cm.safeDispose();
    }
}