
status = -1;
var itemList = Array(


Array(4002003, 100, 1, 1), //邮票
Array(4002000, 100, 1, 1), //邮票
Array(4002001, 100, 1, 1), //邮票
Array(4002002, 100, 1, 1), //邮票
//Array(4002001, 20, 1, 1), //邮票
//Array(4002002, 20, 1, 1), //邮票
Array(1102041, 20, 1, 1), //浪人粉
Array(1102042, 200, 1, 1), //浪人紫
Array(2070013, 20, 1, 1), //黄金镖
Array(1012070, 200, 1, 1), //雪糕
Array(1012072, 200, 1, 1), //雪糕
Array(1012073, 200, 1, 1), //雪糕
Array(1012071, 200, 1, 1), //雪糕


//Array(2510000, 5, 1, 1), //公式
//Array(2510001, 5, 1, 1), //公式
//Array(2510002, 5, 1, 1), //公式
Array(2510003, 10, 1, 1), //公式
Array(2510004, 10, 1, 1), //公式
Array(2510005, 10, 1, 1), //公式
Array(2510006, 30, 1, 1), //公式
Array(2510007, 30, 1, 1), //公式
Array(2510008, 30, 1, 1), //公式
Array(2510009, 30, 1, 1), //公式
Array(2510010, 30, 1, 1), //公式
Array(2510011, 10, 1, 1), //公式
Array(2510012, 10, 1, 1), //公式
Array(2510013, 10, 1, 1), //公式
Array(2510014, 10, 1, 1), //公式
Array(2510015, 10, 1, 1), //公式
Array(2510016, 10, 1, 1), //公式
Array(2510017, 10, 1, 1), //公式
Array(2510018, 10, 1, 1), //公式
Array(2510019, 10, 1, 1), //公式
Array(2510020, 10, 1, 1), //公式
Array(2510021, 10, 1, 1), //公式
Array(2510022, 10, 1, 1), //公式

Array(4310057, 500, 1, 1), //跑商币
Array(4310143, 500, 1, 1), //BOSS币


Array(4031504, 80, 1, 1), //蓝色盒子 
Array(4031505, 80, 1, 1), //黄色盒子
Array(4031506, 80, 1, 1), //绿色盒子
Array(2450000, 150, 1, 1), //狩猎
Array(2022530, 150, 1, 1), //花语
Array(4011007,10, 1, 1),//月石
Array(4011008,10, 1, 1),//锂
Array(4251202,20, 1, 1),//五彩
Array(4005004, 200, 1, 1), //黑暗水晶
Array(4000463,150, 1, 1),//中介币
Array(4001165, 100, 5, 1), //太阳神的赐福
Array(3992025, 100, 50, 1), //太阳神的赐福


Array(2046913,10, 1, 1),//宿命

Array(2613000,100, 1, 1),//星火 
Array(2049100, 100, 1, 1),//混沌卷轴60%


Array(4310038,300, 1, 1),//SR时装附魔币			
Array(4310027,100, 1, 1),//SSR时装附魔币
Array(4310010,3, 1, 1),//15星必成币 
			Array(4310009 ,3, 1, 1)//10星必成币
			//Array(2290061,100, 1, 1),
			//Array(2290060,100, 1, 1),
			//Array(2290011,100, 1, 1),
			//Array(2290010,100, 1, 1),
			//Array(2290091,100, 1, 1),
			//Array(2290090,100, 1, 1),
			//Array(2290085,100, 1, 1),
			//Array(2290084,100, 1, 1),
			//Array(2290093,100, 1, 1),
			//Array(2290092,100, 1, 1),
			//Array(2290101,100, 1, 1),
			//Array(2290125,100, 1, 1),
			//Array(2290096,100, 1, 1),
			//Array(2290120,100, 1, 1),
			//Array(2290119,100, 1, 1),
			//Array(2290077,100, 1, 1),
			//Array(2290076,100, 1, 1),
			//Array(2290127,100, 1, 1),
			//Array(2290126,100, 1, 1),
			//Array(2290128,100, 1, 1),
			//Array(2290129,100, 1, 1),
			//Array(2290122,100, 1, 1),
			//Array(2290121,100, 1, 1),
			//Array(2290113,100, 1, 1),
			//Array(2290112,100, 1, 1),
			//Array(2290118,100, 1, 1),
			//Array(2290117,100, 1, 1),
			//Array(2290007,100, 1, 1),
			//Array(2290006,100, 1, 1),
			//Array(2290037,100, 1, 1),
			//Array(2290036,100, 1, 1),
			//Array(2290099,100, 1, 1),
			//Array(2290100,100, 1, 1),
			//Array(2290023,100, 1, 1),
			//Array(2290098,100, 1, 1),
			//Array(2290097,100, 1, 1),
			//Array(2290066,100, 1, 1),
			//Array(2290067,100, 1, 1),
			//Array(2290012,100, 1, 1),
			//Array(2290013,100, 1, 1),
			//Array(2290050,100, 1, 1),
			//Array(2290051,100, 1, 1),
			//Array(2290043,100, 1, 1),
			//Array(2290042,100, 1, 1),
			//Array(2290046,100, 1, 1),
			//Array(2290047,100, 1, 1),
			//Array(2290088,100, 1, 1),
			//Array(2290089,100, 1, 1),
			//Array(2290040,100, 1, 1),
			//Array(2290041,100, 1, 1),
			//Array(2290119,100, 1, 1)
			
			//Array(4001226,100, 1, 1), //????????
			//Array(4001227,100, 1, 1), //????????
			//Array(4001228,100, 1, 1), //????????
			//Array(4001229,100, 1, 1), //????????
			//Array(4001230,100, 1, 1), //????????
			//Array(2450000,100, 1, 1), //????????
			//Array(1472051,500, 1, 1), //????????
			//Array(1332050,500, 1, 1), //????????
			//Array(1462039,500, 1, 1), //????????
			//Array(1482013,500, 1, 1), //????????
			//Array(1492013,500, 1, 1), //????????
			
//Array(1032031, 500, 1, 0), //???????
//Array(1302056, 500, 1, 0), //???????
//Array(1402035, 500, 1, 0), //???????
//Array(1432030, 500, 1, 0), //???????
//Array(1442044, 500, 1, 0), //???????
//Array(1372010, 500, 1, 0), //???????
//Array(1382035, 500, 1, 0), //???????
//Array(1452019, 500, 1, 0), //???????
//Array(4170016, 100, 1, 0), //???????

//Array(4170001, 300, 1, 0), //???????
//Array(4170001, 300, 1, 0), //???????
//Array(4170001, 300, 1, 0), //???????

//-----????-----

);

function start() {
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == 1) {
        status++;
    } else {
        if (status == 0) {
            cm.sendOk("七七");
            cm.dispose();
        }
        status--;
    }
		if (status == 0) {
			if(cm.haveItem(4001102,1)) {
var str1 = "\r\n";	
           for (var i = 0; i < itemList.length; i++){
                   str1 += "#v"+itemList[i][0]+"#";
            }
				cm.sendYesNo("消耗1个#v4001102#抽取下面物品!" + str1);
			} else {
var str1 = "\r\n";	
           for (var i = 0; i < itemList.length; i++){
                   str1 += "#v"+itemList[i][0]+"#";
            }
				cm.sendOk("消耗1个#v4001102#抽取下面物品! " + str1);
				cm.dispose();
			}
		} else if (status == 1){	
        var chance = Math.floor(Math.random() * 200);
        var finalitem = Array();
        for (var i = 0; i < itemList.length; i++) {
            if (itemList[i][1] >= chance) {
                finalitem.push(itemList[i]);
            }
        }
        if (finalitem.length != 0) {
            var item;
            var random = new java.util.Random();
            var finalchance = random.nextInt(finalitem.length);
            var itemId = finalitem[finalchance][0];
            var quantity = finalitem[finalchance][2];
            var notice = finalitem[finalchance][3];
            item = cm.gainGachaponItem(itemId, quantity, "蛋糕活动宝箱", notice);
            if (item != -1) {
				//cm.setmoneyb(-5);
cm.gainItem(4001102, -1);//??????
                cm.sendOk("你获得了 #b#t" + item + "##k " + quantity + "个。");
            } else {
                cm.sendOk("请你确认在背包的装备，消耗，其他窗口中是否有一格以上的空间。");
            }
            cm.safeDispose();
        } else {
            cm.sendOk("重新点一下");
           // cm.setmoneyb(-5);
//cm.gainItem(4170005, 5);//??????
			//cm.gainNX(1000);	//??????
            cm.safeDispose();
        }
    }
}









