var status = 0;
var itemList =   
Array(   
			Array(1132242,200,1,1),//革命腰带
			Array(1003946,20,1,1),//革命帽子
			Array(1102612,30,1,1),//革命披风
			Array(1082540,30,1,1),//革命手套
			//Array(1052647,50,1,1),//革命战斗服
			Array(1052647,30,1,1),//革命战斗服
			Array(1122262,200,1,1),//革命吊坠
			Array(1072853,150,1,1),//革命鞋子
			Array(2070006,200,1,1),//齿轮
			Array(2070007,250,1,1),//月牙
			Array(1132243,50,1,1),//低级贝勒德刻印腰带
			Array(1132244,20,1,1),//中级贝勒德刻印腰带
			Array(1132245,10,1,1),//高级贝勒德刻印腰带
			Array(1132246,10,1,1),//最高级贝勒德刻印腰带
			Array(1122264,50,1,1),//低级贝勒德刻印吊坠
			Array(1122265,20,1,1),//中级贝勒德刻印吊坠
			Array(1122266,10,1,1),//高级贝勒德刻印吊坠
			Array(1122267,10,1,1),//最高级贝勒德刻印吊坠
			Array(1032220,30,1,1),//低级贝勒德耳环
			Array(1032221,20,1,1),//中级贝勒德耳环
			Array(1032222,10,1,1),//高级贝勒德耳环
			Array(1032223,10,1,1),//最高级贝勒德耳环
			Array(1113072,20,1,1),//低级贝勒德戒指
			Array(1113073,20,1,1),//中级贝勒德戒指
			Array(1113074,10,1,1),//高级贝勒德戒指
			Array(1113075,10,1,1),//最高级贝勒德戒指
			Array(1112405,100,1,1),//全属性5左右戒指
			Array(1112404,200,1,1),//极光戒指
			Array(1112426,200,1,1),//全属性1戒指
			Array(1112425,200,1,1),//全属性2戒指
			Array(1112424,200,1,1),//
			Array(1112423,200,1,1),//
			Array(1112422,200,1,1),//
			Array(1112421,200,1,1),//
			Array(1112402,200,1,1),//
			Array(1092074,100,1,1),//至尊不速之客战士盾
			Array(1092079,10,1,1),//至尊不速之客法师盾
			Array(1092084,20,1,1),//至尊不速之客飞侠盾
			Array(1302147,20,1,1),//至尊不速之客单手剑
			Array(1312062,20,1,1),//至尊不速之客单手斧
			Array(1322090,20,1,1),//至尊不速之客单手钝器
			Array(1332120,20,1,1),//至尊不速之客短剑-运
			Array(1332125,20,1,1),//至尊不速之客短剑-力
			Array(1342033,20,1,1),//至尊不速之客刀
			Array(1372078,20,1,1),//至尊不速之客短杖
			Array(1382099,20,1,1),//至尊不速之客长杖
			Array(1402090,20,1,1),//至尊不速之客双手剑
			Array(1412062,20,1,1),//至尊不速之客双手斧
			Array(1422063,20,1,1),//至尊不速之客双手斧
			Array(1432081,20,1,1),//至尊不速之客枪
			Array(1442111,20,1,1),//至尊不速之客矛
			Array(1452106,20,1,1),//至尊不速之客弓
			Array(1462091,20,1,1),//至尊不速之客弩
			Array(1472117,20,1,1),//至尊不速之客拳套
			Array(1482079,50,1,1),//至尊不速之客指节
			Array(1492079,50,1,1),//至尊不速之客刀
			Array(1342033,50,1,1),//至尊不速之客短枪
			Array(1132040,200,1,1),//至尊
			Array(1122081,200,1,1),//1代项链
			Array(1122082,200,1,1),//2代项链
			Array(1122083,200,1,1),//3
			Array(1122084,200,1,1),//末代
			Array(1122085,200,1,1),//至尊
			//Array(1122083,50,1,1),//3
			//Array(1122083,50,1,1),//3
			//Array(1122083,50,1,1),//3
			//Array(1122083,50,1,1),//3
			//Array(1122083,50,1,1),//3			
			Array(2049002,200,1,1),//白医5
			Array(2049001,300,1,1),//白医3
			Array(2049000,200,1,1),//白医1
			Array(2040006,300,1,1),//头盔防御必成
			Array(2040007,300,1,1),//体力必成
			Array(2040303,50,1,1),//耳环智力必成
			Array(2040403,300,1,1),//上衣防御必成
			Array(2040506,50,1,1),//全身敏捷必称
			Array(2040603,300,1,1),//裤裙防御必成
			Array(2040709,30,1,1),//鞋子敏捷必成
			Array(2040710,300,1,1),//跳跃必成
			Array(2040711,300,1,1),//速度必成
			Array(2040806,50,1,1),//手套敏捷必成
			Array(2040903,300,1,1),//盾牌防御必成
			Array(2041024,300,1,1),//披风MF必成
			Array(2041025,300,1,1),//披风WF必成
			Array(5570000,200,1,1),//金锤子
			Array(2290125,5,1,1),//30勇士
		Array(1302030,200,1,1),
		Array(1332025,200,1,1),
		Array(1382012,200,1,1),
		Array(1412011,200,1,1),
		Array(1422014,200,1,1),
		Array(1432012,200,1,1),
		Array(1442024,200,1,1),
		Array(1452022,200,1,1),
		Array(1462019,200,1,1),
		Array(1472032,200,1,1),
		Array(1482021,200,1,1),
		Array(1492021,200,1,1),
		Array(1402037,200,1,1),
		Array(1372035,200,1,1),
		Array(1372036,200,1,1),
		Array(1372037,200,1,1),
		Array(1372038,200,1,1),
		Array(1382045,200,1,1),
		Array(1382046,200,1,1),
		Array(1382047,200,1,1),
		Array(1382048,200,1,1),
		Array(1382049,100,1,1),
		Array(1382050,100,1,1),
		Array(1382051,100,1,1),
		Array(1382052,100,1,1),
		
		
		Array(2049100,150,1,1),
			Array(2340000,50,1,1),//祝福卷轴
			Array(2040914,300,1,1),//盾牌攻击卷轴  
			Array(2040810,200,1,1),
			Array(2040811,200,1,1),
			Array(2040916,200,1,1),
			Array(2040917,200,1,1),
			Array(2043004,200,1,1),
			Array(2043005,200,1,1),
			Array(2043104,200,1,1),
			Array(2043105,200,1,1),
			Array(2043204,200,1,1),
			Array(2043205,200,1,1),
			Array(2043304,200,1,1),
			Array(2043305,200,1,1),
			Array(2044004,200,1,1),
			Array(2044005,200,1,1),
			Array(2044104,200,1,1),
			Array(2044105,200,1,1),
			Array(2044204,200,1,1),
			Array(2044205,200,1,1),
			Array(2044304,200,1,1),
			Array(2044305,200,1,1),
			Array(2044404,200,1,1),
			Array(2044405,200,1,1),
			Array(2044504,200,1,1),
			Array(2044505,200,1,1),
			Array(2044604,200,1,1),
			Array(2044605,200,1,1),
			Array(2044704,200,1,1),
			Array(2044705,200,1,1),
			Array(2044803,200,1,1),
			Array(2044804,200,1,1),
			Array(2044903,200,1,1),
			Array(2044904,200,1,1),
			Array(2043704,200,1,1),
			Array(2043705,200,1,1),
			Array(2043804,200,1,1),
			Array(2043805,300,1,1),
			Array(1002419,200,1,1),//枫叶帽
			Array(1002677,150,1,1),//玩具匠人帽
			Array(1002798,200,1,1),//年糕1002798
			Array(1002743,150,1,1),//海洋之帽
			Array(1002939,300,1,1),//安全帽
						
			Array(1082149,300,1,1),//工地手套(褐) 
					
		 
			Array(1102042,250,1,1),//浪人披风(紫) 
			Array(1102041,200,1),//浪人披风(粉)
			
			Array(1102086,300,1,1),//蓝色盖亚披风
			Array(1102084,300,1,1),//粉红盖亚披风
		
			Array(1012070,350,1,1),//雪糕+攻
			Array(1012071,200,1,1),//雪糕全属性
			Array(1012072,300,1,1),//狐猴
			Array(1012073,300,1,1),//狐猴
			Array(1022060,100,1,1),//狐猴
			Array(1022067,100,1,1),//黑狐猴
			Array(1012056,100,1,1),//狗狗鼻子1012056
		  
			Array(1402063,100,1,1),//樱花伞
			Array(1302058,100,1,1),//枫叶伞
			

			Array(1092022,100,1,1),//调色板盾牌
			
			
			Array(1302063,200,1,1),//燃烧的火焰刀
			Array(1302106,200,1,1),//燃烧的冰焰刀
			Array(1302080,300,1,1),//回顾冒险岛小灯泡
			Array(1302085,300,1,1),//叉子
			Array(1302087,300,1,1),//火炬
			Array(1382015,300,1,1),//毒蘑菇
			Array(1382016,300,1,1),//香菇
			Array(1402044,300,1,1),//南瓜灯笼
			Array(1302061,300,1,1),//蔓藤鞭子
			Array(1422030,300,1,1),//粉红海豹抱枕
			Array(1422031,300,1),//蓝色海豹抱枕
			Array(1432046,300,1,1),//圣诞树手杖
			Array(1432013,300,1,1),//南瓜枪
        	Array(1302024,300,1,1),//废报纸武器
        	Array(1322051,300,1,1),//七夕
        	Array(1402014,50,1,1),//温度计
        	Array(1402029,300,1,1),//鬼刺狼牙棒
        	Array(1422011,200,1,1),//酒瓶
        	Array(1332053,300,1,1),//野外烧烤
        	Array(1372017,300,1,1),//领路灯
		        	      	Array(1442039,300,1,1),//冻冻鱼
        	Array(1302019,300,1,1),//无名剑
        	Array(1332021,300,1,1),//乌龙茶
        	Array(1302128,300,1,1),//火柴	
        	Array(1302084,300,1,1),//火柴
        	Array(1402013,300,1,1),//白日剑
			Array(1302036,300,1,1),//枫叶小旗
			Array(1302049,300,1,1),//光线鞭
		
		
			Array(1422011,300,1,1),//清酒
			Array(1432039,300,1,1),//钓鱼竿
			Array(2210005,300,1,1),//提摩
			Array(2210010,300,1,1),//女超		
        	Array(3010112,300,1,1),
			//-----椅子-----
			  Array(3010788,100,1,1),
			Array(3010681,100,1,1),
			Array(3010416,100,1,1),
			Array(3010417,100,1,1),
		    Array(3010043,200,1,1),//魔女的飞扫把
		    Array(3015051,50,1,1),//巨无霸国际巨星
		    Array(3015183,200,1,1),//绿水灵背景椅子
		    Array(3015096,200,1,1),//羊羊七七牧场椅子
		    Array(3010180,300,1,1),//HP椅子
		    Array(3010009,10,1,1),//粉色爱心马桶
		    Array(3010028,100,1,1),//老海盗椅子
		    Array(3012006,300,1,1),//风吹稻香
        	Array(3010013,100,1,1),//悠长假期
        	Array(3010014,300,1,1),//月亮弯
        	Array(3010018,300,1,1),//椰子树沙滩椅
        	Array(3010025,300,1,1),//枫叶纪念凳
        	Array(3012001,300,1,1),//篝火
        	Array(3012002,100,1,1),//浴桶---
        	Array(3010073,100,1,1),//PB克缤
        	Array(3010049,300,1,1),//雪房子
        	Array(3010068,300,1,1),//露水椅子
        	Array(3010070,100,1,1),//巨无霸品克缤
        	Array(3010095,100,1,1),//石头人座椅
//-----后期植入椅子-----
        	Array(3010898,100,1,1),//迷你神兽椅子
        	Array(3010465,100,1,1),//可爱音符椅子
        	Array(3010460,100,1,1),//爆竹椅子
        	Array(3010450,100,1,1),//艾莉珍椅子
        	Array(3010455,100,1,1),//扎昆的帝王椅子
        	Array(3010456,100,1,1),//杜鹃花椅子
        	Array(3010458,100,1,1),//翻滚兔子椅子
        	Array(3010863,300,1,1),//愤怒的美发师椅子
        	Array(3010447,100,1,1),//睡觉小鸟椅子
        	Array(3010446,100,1,1),//皮肤皇后椅子
        	Array(3010448,100,1,1),//泡泡浴椅子
        	Array(3010434,100,1,1),//热带夏日椅子
        	Array(3010428,100,1,1),//水晶椅子
        	Array(3010409,100,1,1),//粽子椅子
      	    Array(3010094,100,1,1),//漂漂猪椅子-----------------------
        	Array(3010411,100,1,1),//鱼尾狮椅子
        	Array(3010085,300,1,1),//鬼娃娃椅子
        	Array(3010077,100,1,1),//猫头鹰椅子
        	Array(3010053,300,1,1),//兔子纪念版椅子
        	Array(3010151,200,1,1),//无人岛椅子
        	Array(3015415,300,1,1),//猴子椅子
        	Array(3010142,300,1,1),//水族馆椅子
        	Array(3010144,100,1,1),//七夕椅子
        	Array(3015430,100,1,1),//年兽椅子
        	Array(3010117,100,1,1),//魔法书椅子
        	Array(3015424,100,1,1),//超级饺子椅子
        	Array(3015428,100,1,1),//和猴子一起放烟花椅子
        	Array(3015427,100,1,1),//和猴子一起玩麻将椅子
        	Array(3010804,100,1,1),//军人月妙拜年椅子
        	Array(3015045,300,1,1),//羊绒咩咩椅子--------------
        	Array(3010375,300,1,1),//奥妙的超级药水椅子
        	Array(3015057,300,1,1),//烟花绽放椅子
        	Array(3010373,300,1,1),//云朵洗手间椅子
        	Array(3010799,300,1,1),//坟墓幽灵椅子
        	Array(3010737,300,1,1),//动物英雄团椅子
        	Array(3010734,100,1,1),//猫箱椅子
        	Array(3010738,300,1,1),//闪电三人组椅子
        	Array(3010740,100,1,1),//圣诞树椅子
        	Array(3010365,100,1,1),//休彼德蔓的古代石掌椅子
        	Array(3010306,100,1,1),//生如夏花椅子
        	Array(3010301,300,1,1),//高级HP药水椅子
        	Array(3010188,100,1,1),//班·雷昂椅子
        	Array(3010186,100,1,1),//兔子椅子
        	Array(3010184,300,1,1),//冰钓椅子
         	Array(3010173,300,1,1),//万圣节塔罗椅子
        	Array(3010175,300,1,1),//名画家椅子
        	Array(3010195,100,1,1),//无价之宝椅子
        	Array(3010210,100,1,1),//草莓冰淇淋月饼椅子--------------
        	Array(3010224,300,1,1),//年糕冰淇淋椅子
        	Array(3010036,300,1,1),//浪漫秋千
        	Array(3010044,300,1,1),//同一红伞下
        	Array(3010111,100,1,1),//虎虎生威
        	Array(3010115,100,1,1),//熊宝宝床
        	Array(3010126,300,1,1),//蝙蝠魔王座
        	Array(3010313,300,1,1),//粉红扎昆椅子
        	Array(3010128,300,1,1),//黑龙王座
        	Array(3010133,300,1,1),//帐篷椅
        	Array(3010152,200,1,1),//黄三角帐篷椅
        	Array(3010291,300,1,1),//早日康复床
        	Array(3010172,300,1,1),//星空椅子
        	Array(3010168,300,1,1),//友谊万岁椅子
        	Array(3010185,100,1,1),//小伙伴品克缤
        	Array(3010622,100,1,1),//我的好友丹珍之椅
        	Array(3010453,300,1,1),//兔子乘风椅
        	Array(3010493,300,1,1),//那就是我--------------------------------
        	Array(3010527,300,1,1),//深海章鱼
        	Array(3010531,300,1,1),//小企鹅合唱团
        	Array(3010565,300,1,1),//我的女皇椅子
        	Array(3010587,300,1,1),//时间胶囊
        	Array(3010609,300,1,1),//不是在做梦
        	Array(3010608,300,1,1),//回顾的名画椅子
        	Array(3010661,300,1,1),//欢乐相框椅子
        	Array(3010678,300,1,1),//海加顿之安息
        	Array(3010739,300,1,1),//雪人香波椅子
        	Array(3010744,300,1,1),//回顾冒险岛的砖头朋友们
        	Array(3010752,300,1,1),//玫瑰鸟笼
        	Array(3010756,300,1,1),//新年招财猫椅子
        	Array(3010767,300,1,1),//雪人椅子
        	Array(3010760,300,1,1),//古代浴池椅子
        	Array(3010795,300,1,1),//森林中休息处
        	Array(3010806,300,1,1),//桃樱芳菲椅
        	Array(3010848,300,1,1),//红地毯主人公椅子
        	Array(3012024,300,1,1)//沙滩排球椅子
);

function start() {
	status = -1;
	action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == 1) {
        status++;
    } else {
        if (status == 0) {
           selStr = "#e#r这里是本服敲敲哭抽奖，只要你有1000点券，就可以随机可以获得以下物品，100%获得\r\n\#b是否消耗 #b1000点券\r\n来一发#n#k\r\n";
		   for (i = 0; i < itemList.length; i++) {
                selStr += "#d#v" + itemList[i][0] + "#";
            }
			
			cm.sendOk(selStr);
            cm.dispose();
        }
        status--;
    }
    if (status == 0) {
		selStr = "\r\n";
		   for (i = 0; i < itemList.length; i++) {
                selStr += "#d#v" + itemList[i][0] + "#";
            }
        if (cm.getPlayer().getCSPoints(1) >= 1000) {
            cm.sendYesNo("这里是本服敲敲哭抽奖，只要你有1000点券，就可以随机可以获得以下物品，100%获得\r\n\#b是否消耗 #b1000点券\r\n来一发？"+selStr);
        } else {
            cm.sendOk("只要你有1000点券，就可以随机获得以下物品，100%获得\r\n\#b是否消耗 #b1000点券\r\n来一发？"+selStr);
            cm.safeDispose();
        }
    } else if (status == 1) {
        var chance = Math.floor(Math.random() * 1000);
        var finalitem = Array();
        for (var i = 0; i < itemList.length; i++) {
            if (itemList[i][1] >= chance) {
                finalitem.push(itemList[i]);
            }
        }
        if (finalitem.length != 0) {
            var item;
            var random = new java.util.Random();
            var finalchance = random.nextInt(finalitem.length);
            var itemId = finalitem[finalchance][0];
            var quantity = finalitem[finalchance][2];
            var notice = finalitem[finalchance][3];
            item = cm.gainGachaponItem(itemId, quantity, "玩具箱", notice);
            if (item != -1) {
                cm.gainNX(-0);//点券
                cm.sendOk("你获得了 #b#t" + item + "##k " + quantity + "个。");
				cm.dispose();
            } else {
                cm.sendOk("你确实有#b1000点#k吗？如果是，请你确认在背包的装备，消耗，其他窗口中是否有一格以上的空间。");
           cm.dispose();
		   }
            //cm.safeDispose();
			//cm.dispose();
    }
}}
