/* Denma the Owner
	Henesys VIP Eye Change.
*/
var status = -1;
var facetype;

function start() {
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == 0) {
        cm.dispose();
        return;
    } else {
        status++;
    }
    if (status == 0) {
        cm.sendNext("欢迎光临520整形中心。[#r全部免费#k]");
    } else if (status == 1) {
        var face = cm.getPlayerStat("FACE");
        if (cm.getPlayerStat("GENDER") == 0) {
           facetype = [26706,26809,26810,26811,26813,26814,26815,26816,26817,26818,26819,26820,26821,26824,26825,26826,26827,26829,26830,26833,26834,26835,26836,26837,26838,26839,26840,26841,26844,26845,26852,26853,26857,26859,26860,26865];
        
        } else {
             facetype = [27002,27003,27004,27005,27006,27007,27008,27009,27010,27011,27013,27014,27015,27016,27017,27018,27019,27020,27021,27022,27023,27024,27025,27026,27027,27028,27029,27030,27031,27032,27033,27034,27035,27036,27037,27038,27039,27040,27041,27044,27045,27046,27047,27050,27051,27052,27053,27056,27057,27058,27059,27060,27061,27062,27063,27064,27065,27066,27100,27101,27102,27103,27104,27105,27107,27108,27109,27110,27111,27113,27114,27115,27116,27117,27118,27119];        
        }
        for (var i = 0; i < facetype.length; i++) {
            facetype[i] = facetype[i] + face % 1000 - (face % 100);
        }
		
cm.gainItem(4052001, 1);//获得物品
        cm.askAvatar("请慢慢选择你想喜欢的样子！\r\n如果发现崩溃等现象请反馈给GM修复谢谢！", 4052001, facetype);
    } else if (status == 2) {
        if (cm.setAvatar(4052001, facetype[selection]) == 1) {
            cm.sendOk("好了,你的朋友们一定认不出来是你了!");
            cm.喇叭(2, "[" + cm.getPlayer().getName() + "]整形成功,你的朋友们一定认不出来是你了!~");
        } else {
            cm.sendOk("嗯。。。你肯定没有我们医院的会员卡。。。不好意思如果你没射手村整形手术高级会员卡，我不能给你做手术。");
        }
        cm.dispose();
    }
}
