var 正在进行中 = "#fUI/UIWindow/Quest/Tab/enabled/1#";
var 完成 = "#fUI/UIWindow/Quest/Tab/enabled/2#";
var 正在进行中蓝 = "#fUI/UIWindow/MonsterCarnival/icon1#";
var 完成红 = "#fUI/UIWindow/MonsterCarnival/icon0#";
var 爱心 = "#fEffect/CharacterEff/1022223/4/0#";
var 红色箭头 = "#fUI/UIWindow/Quest/icon6/7#";
var 正方形 = "#fUI/UIWindow/Quest/icon3/6#";
var 蓝色箭头 = "#fUI/UIWindow/Quest/icon2/7#";
var 蓝色角点 = "#fUI/UIWindow.img/PvP/Scroll/enabled/next2#";
var 正在进行中 = "#fUI/UIWindow/Quest/Tab/enabled/1#";
var 完成 = "#fUI/UIWindow/Quest/Tab/enabled/2#";
var 正在进行中蓝 = "#fUI/UIWindow/MonsterCarnival/icon1#";
var 完成红 = "#fUI/UIWindow/MonsterCarnival/icon0#";
var 大心 = "#fEffect/CharacterEff/1051295/0/0#";
var 琴符 = "#fUI/UIWindow/Quest/icon0#";
var 小雪花 = "#fEffect/CharacterEff/1003393/0/0#";
var 音符 = "#fEffect/CharacterEff/1032063/0/0#";
var 感叹号 = "#fUI/UIWindow/Quest/icon0#";
var 爱心1 = "#fEffect/CharacterEff/1032063/0/0#";
var 红枫叶 ="#fMap/MapHelper/weather/maple/1#";
var 银杏叶 ="#fMap/MapHelper/weather/maple/3#";
var 小烟花 ="#fMap/MapHelper/weather/squib/squib4/1#";

function start() {
    status = -1;

    action(1, 0, 0);
}
function action(mode, type, selection) {
    if (mode == -1) {
        cm.dispose();
    }
    else {
        if (status >= 0 && mode == 0) {

            cm.sendOk("感谢你的光临！");
            cm.dispose();
            return;
        }
        if (mode == 1) {
            status++;
        }
        else {
            status--;
        }
        if (status == 0) {
            var tex2 = "";
            var text = "";
            for (i = 0; i < 10; i++) {
                text += "";
            }
			text += ""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+"\r\n"  
            text += "              #r欢迎来到月月冒险岛主线任务#k\r\n"
			text += ""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+"\r\n\r\n"
			text += "                 #r主线任务完成25个获得\r\n       超强坐骑#v1902001##v1912000#（每件四维108，攻魔78）\r\n  #L100#主线任务完成21个获得#s9001006#超级龙咆哮技能#s9001006##l\r\n\r\n"
			
			if(cm.getgrname() == 0 && cm.getLevel() > 0){
					text += "               #L1#"+小烟花+"#b开始主线任务1#n"+小烟花+"#l\r\n\r\n"//3
				} else if(cm.getgrname() > 0 && cm.getLevel() > 0){
					text += "                  "+小烟花+"#b主线任务1完成#n"+小烟花+"#l#k\r\n"//3
				} else {
					text += "              "+小烟花+"#b主线任务1(#rlv.1#b)待命"+小烟花+"\r\n"//3
			}
			
			if(cm.getgrname() == 1 && cm.getLevel() > 9){
					text += "               #L2#"+小烟花+"#b开始主线任务2#n"+小烟花+"#l\r\n\r\n"//3
				} else if(cm.getgrname() > 1 && cm.getLevel() > 9){
					text += "                  "+小烟花+"#b主线任务2完成#n"+小烟花+"#l#k\r\n"//3
				} else {
					text += "              "+小烟花+"#b主线任务2(#rlv.10#b)待命"+小烟花+"\r\n"//3
			}
			
			if(cm.getgrname() == 2 && cm.getLevel() > 19){
					text += "               #L3#"+小烟花+"#b开始主线任务3#n"+小烟花+"#l\r\n\r\n"//3
				} else if(cm.getgrname() > 2 && cm.getLevel() > 19){
					text += "                  "+小烟花+"#b主线任务3完成#n"+小烟花+"#l#k\r\n"//3
				} else {
					text += "              "+小烟花+"#b主线任务3(#rlv.20#b)待命"+小烟花+"\r\n"//3
			}
			
			if(cm.getgrname() == 3 && cm.getLevel() > 29){
					text += "               #L4#"+小烟花+"#b开始主线任务4#n"+小烟花+"#l\r\n\r\n"//3
				} else if(cm.getgrname() > 3 && cm.getLevel() > 29){
					text += "                  "+小烟花+"#b主线任务4完成#n"+小烟花+"#l#k\r\n"//3
				} else {
					text += "              "+小烟花+"#b主线任务4(#rlv.30#b)待命"+小烟花+"\r\n"//3
			}
			
			if(cm.getgrname() == 4 && cm.getLevel() > 39){
					text += "               #L5#"+小烟花+"#b开始主线任务5#n"+小烟花+"#l\r\n\r\n"//3
				} else if(cm.getgrname() > 4 && cm.getLevel() > 39){
					text += "                  "+小烟花+"#b主线任务5完成#n"+小烟花+"#l#k\r\n"//3
				} else {
					text += "              "+小烟花+"#b主线任务5(#rlv.40#b)待命"+小烟花+"\r\n"//3
			}
			
			if(cm.getgrname() == 5 && cm.getLevel() > 49){
					text += "               #L6#"+小烟花+"#b开始主线任务6#n"+小烟花+"#l\r\n\r\n"//3
				} else if(cm.getgrname() > 5 && cm.getLevel() > 49){
					text += "                  "+小烟花+"#b主线任务6完成#n"+小烟花+"#l#k\r\n"//3
				} else {
					text += "              "+小烟花+"#b主线任务6(#rlv.50#b)待命"+小烟花+"\r\n"//3
			}
			
			
			if(cm.getgrname() == 6 && cm.getLevel() > 59){
					text += "               #L7#"+小烟花+"#b开始主线任务7#n"+小烟花+"#l\r\n\r\n"//3
				} else if(cm.getgrname() > 6 && cm.getLevel() > 59){
					text += "                  "+小烟花+"#b主线任务7完成#n"+小烟花+"#l#k\r\n"//3
				} else {
					text += "              "+小烟花+"#b主线任务7(#rlv.60#b)待命"+小烟花+"\r\n"//3
			}
			if(cm.getgrname() == 7 && cm.getLevel() > 69){
					text += "               #L8#"+小烟花+"#b开始主线任务8#n"+小烟花+"#l\r\n\r\n"//3
				} else if(cm.getgrname() > 7 && cm.getLevel() > 69){
					text += "                  "+小烟花+"#b主线任务8完成#n"+小烟花+"#l#k\r\n"//3
				} else {
					text += "              "+小烟花+"#b主线任务8(#rlv.70#b)待命"+小烟花+"\r\n"//3
			}
			
			
			if(cm.getgrname() == 8 && cm.getLevel() > 79){
					text += "               #L9#"+小烟花+"#b开始主线任务9#n"+小烟花+"#l\r\n\r\n"//3
				} else if(cm.getgrname() > 8 && cm.getLevel() > 79){
					text += "                  "+小烟花+"#b主线任务9完成#n"+小烟花+"#l#k\r\n"//3
				} else {
					text += "              "+小烟花+"#b主线任务9(#rlv.80#b)待命"+小烟花+"\r\n"//3
			}
			
			if(cm.getgrname() == 9 && cm.getLevel() > 89){
					text += "               #L10#"+小烟花+"#b开始主线任务10#n"+小烟花+"#l\r\n\r\n"//3
				} else if(cm.getgrname() > 9 && cm.getLevel() > 89){
					text += "                  "+小烟花+"#b主线任务10完成#n"+小烟花+"#l#k\r\n"//3
				} else {
					text += "              "+小烟花+"#b主线任务10(#rlv.90#b)待命"+小烟花+"\r\n"//3
			}
			
			if(cm.getgrname() == 10 && cm.getLevel() > 99){
					text += "               #L11#"+小烟花+"#b开始主线任务11#n"+小烟花+"#l\r\n\r\n"//3
				} else if(cm.getgrname() > 10 && cm.getLevel() > 99){
					text += "                  "+小烟花+"#b主线任务11完成#n"+小烟花+"#l#k\r\n"//3
				} else {
					text += "             "+小烟花+"#b主线任务11(#rlv.100#b)待命"+小烟花+"\r\n"//3
			}
			
			if(cm.getgrname() == 11 && cm.getLevel() > 109){
					text += "               #L12#"+小烟花+"#b开始主线任务12#n"+小烟花+"#l\r\n\r\n"//3
				} else if(cm.getgrname() > 11 && cm.getLevel() > 109){
					text += "                  "+小烟花+"#b主线任务12完成#n"+小烟花+"#l#k\r\n"//3
				} else {
					text += "             "+小烟花+"#b主线任务12(#rlv.110#b)待命"+小烟花+"\r\n"//3
			}
			
			if(cm.getgrname() == 12 && cm.getLevel() > 119){
					text += "               #L13#"+小烟花+"#b开始主线任务13#n"+小烟花+"#l\r\n\r\n"//3
				} else if(cm.getgrname() > 12 && cm.getLevel() > 119){
					text += "                  "+小烟花+"#b主线任务13完成#n"+小烟花+"#l#k\r\n"//3
				} else {
					text += "             "+小烟花+"#b主线任务13(#rlv.120#b)待命"+小烟花+"\r\n"//3
			}
			
			if(cm.getgrname() == 13 && cm.getLevel() > 129){
					text += "               #L14#"+小烟花+"#b开始主线任务14#n"+小烟花+"#l\r\n\r\n"//3
				} else if(cm.getgrname() > 13 && cm.getLevel() > 129){
					text += "                  "+小烟花+"#b主线任务14完成#n"+小烟花+"#l#k\r\n"//3
				} else {
					text += "             "+小烟花+"#b主线任务14(#rlv.130#b)待命"+小烟花+"\r\n"//3
			}
			
			if(cm.getgrname() == 14 && cm.getLevel() > 139){
					text += "               #L15#"+小烟花+"#b开始主线任务15#n"+小烟花+"#l\r\n\r\n"//3
				} else if(cm.getgrname() > 14 && cm.getLevel() > 139){
					text += "                  "+小烟花+"#b主线任务15完成#n"+小烟花+"#l#k\r\n"//3
				} else {
					text += "             "+小烟花+"#b主线任务15(#rlv.140#b)待命"+小烟花+"\r\n"//3
			}
			
			if(cm.getgrname() == 15 && cm.getLevel() > 149){
					text += "               #L16#"+小烟花+"#b开始主线任务16#n"+小烟花+"#l\r\n\r\n"//3
				} else if(cm.getgrname() > 15 && cm.getLevel() > 149){
					text += "                  "+小烟花+"#b主线任务16完成#n"+小烟花+"#l#k\r\n"//3
				} else {
					text += "             "+小烟花+"#b主线任务16(#rlv.150#b)待命"+小烟花+"\r\n"//3
			}
			
			if(cm.getgrname() == 16 && cm.getLevel() > 159){
					text += "               #L17#"+小烟花+"#b开始主线任务17#n"+小烟花+"#l\r\n\r\n"//3
				} else if(cm.getgrname() > 16 && cm.getLevel() > 159){
					text += "                  "+小烟花+"#b主线任务17完成#n"+小烟花+"#l#k\r\n"//3
				} else {
					text += "             "+小烟花+"#b主线任务17(#rlv.160#b)待命"+小烟花+"\r\n"//3
			}
			
			if(cm.getgrname() == 17 && cm.getLevel() > 169){
					text += "               #L18#"+小烟花+"#b开始主线任务18#n"+小烟花+"#l\r\n\r\n"//3
				} else if(cm.getgrname() > 17 && cm.getLevel() > 169){
					text += "                  "+小烟花+"#b主线任务18完成#n"+小烟花+"#l#k\r\n"//3
				} else {
					text += "             "+小烟花+"#b主线任务18(#rlv.170#b)待命"+小烟花+"\r\n"//3
			}
			
			if(cm.getgrname() == 18 && cm.getLevel() > 179){
					text += "               #L19#"+小烟花+"#b开始主线任务19#n"+小烟花+"#l\r\n\r\n"//3
				} else if(cm.getgrname() > 18 && cm.getLevel() > 179){
					text += "                  "+小烟花+"#b主线任务19完成#n"+小烟花+"#l#k\r\n"//3
				} else {
					text += "             "+小烟花+"#b主线任务19(#rlv.180#b)待命"+小烟花+"\r\n"//3
			}
			
			if(cm.getgrname() == 19 && cm.getLevel() > 189){
					text += "               #L20#"+小烟花+"#b开始主线任务20#n"+小烟花+"#l\r\n\r\n"//3
				} else if(cm.getgrname() > 19 && cm.getLevel() > 189){
					text += "                  "+小烟花+"#b主线任务20完成#n"+小烟花+"#l#k\r\n"//3
				} else {
					text += "             "+小烟花+"#b主线任务20(#rlv.190#b)待命"+小烟花+"\r\n"//3
			}
			
			if(cm.getgrname() == 20 && cm.getLevel() > 199){
					text += "               #L21#"+小烟花+"#b开始主线任务21#n"+小烟花+"#l\r\n\r\n"//3
				} else if(cm.getgrname() > 20 && cm.getLevel() > 199){
					text += "                  "+小烟花+"#b主线任务21完成#n"+小烟花+"#l#k\r\n"//3
				} else {
					text += "             "+小烟花+"#b主线任务21(#rlv.200#b)待命"+小烟花+"\r\n"//3
			}
			
			if(cm.getgrname() == 21 && cm.getLevel() > 209){
					text += "               #L22#"+小烟花+"#b开始主线任务22#n"+小烟花+"#l\r\n\r\n"//3
				} else if(cm.getgrname() > 21 && cm.getLevel() > 209){
					text += "                  "+小烟花+"#b主线任务22完成#n"+小烟花+"#l#k\r\n"//3
				} else {
					text += "             "+小烟花+"#b主线任务22(#rlv.210#b)待命"+小烟花+"\r\n"//3
			}
			
			if(cm.getgrname() == 22 && cm.getLevel() > 219){
					text += "               #L23#"+小烟花+"#b开始主线任务23#n"+小烟花+"#l\r\n\r\n"//3
				} else if(cm.getgrname() > 22 && cm.getLevel() > 219){
					text += "                  "+小烟花+"#b主线任务23完成#n"+小烟花+"#l#k\r\n"//3
				} else {
					text += "             "+小烟花+"#b主线任务23(#rlv.220#b)待命"+小烟花+"\r\n"//3
			}
			
			if(cm.getgrname() == 23 && cm.getLevel() > 229){
					text += "               #L24#"+小烟花+"#b开始主线任务24#n"+小烟花+"#l\r\n\r\n"//3
				} else if(cm.getgrname() > 23 && cm.getLevel() > 229){
					text += "                  "+小烟花+"#b主线任务24完成#n"+小烟花+"#l#k\r\n"//3
				} else {
					text += "             "+小烟花+"#b主线任务24(#rlv.230#b)待命"+小烟花+"\r\n"//3
			}
			
			if(cm.getgrname() == 24 && cm.getLevel() > 239){
					text += "               #L25#"+小烟花+"#b开始主线任务25#n"+小烟花+"#l\r\n\r\n"//3
				} else if(cm.getgrname() > 24 && cm.getLevel() > 239){
					text += "                  "+小烟花+"#b主线任务25完成#n"+小烟花+"#l#k\r\n"//3
				} else {
					text += "             "+小烟花+"#b主线任务25(#rlv.240#b)待命"+小烟花+"\r\n"//3
			}
					if( cm.getLevel() > 239){
					//text += "               #L100#"+小烟花+"#b开始主线任务25#n"+小烟花+"#l\r\n\r\n"//3
				
			}
			
            cm.sendSimple(text);
        } else if (selection == 1) {
			if (cm.haveItem(4000019,50) && cm.haveItem(4000000,50)){
				cm.gainItem(4000019, -50);//绿蜗牛壳
				cm.gainItem(4000000, -50);//蓝蜗牛壳
				cm.gainItem(2000005,50);//超级药水
				cm.gainItem(4004004,20);//黑暗水晶母矿
                cm.即时存档();
				cm.setgrname(1);
				cm.worldMessage(6,"恭喜玩家：["+cm.getName()+"]完成了主线任务1，获得超级药水*50，黑暗水晶母矿*20！");
				cm.sendOk("#r恭喜你，完成了主线任务1，获得超级药水*50，黑暗水晶母矿*20！");
				cm.dispose();
			}else{
				cm.sendOk(""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+"\r\n\r\n#r请收集#v4000019#*50，#v4000000#*50交给我\r\n奖励：#v2000005#*50，#v4004004#*20\r\n\r\n"+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+"\r\n");
				cm.dispose();
			}
        } else if (selection == 2) {
			if (cm.haveItem(4000002,50) && cm.haveItem(4000017,50)){
				cm.gainItem(4000002, -50);//蝴蝶结
				cm.gainItem(4000017, -50);//猪头
				cm.gainMeso(+1000000);//100W金币
				cm.gainItem(2049100, 1);//混沌卷轴
                cm.即时存档();
				cm.setgrname(2);
				cm.worldMessage(6,"恭喜玩家：["+cm.getName()+"]完成了主线任务2，获得金币*100W，混沌卷轴*1！");
				cm.sendOk("#r恭喜你，完成了主线任务2，获得金币*100W，混沌卷轴*1！");
				cm.dispose();
			}else{
				cm.sendOk(""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+"\r\n\r\n#r请收集#v4000002#*50，#v4000017#*50交给我\r\n奖励：#v4031138#*100W，#v2049100#*1\r\n\r\n"+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+"\r\n");
				cm.dispose();
			}
        } else if (selection == 3) {
			if (cm.haveItem(4000021,50) && cm.haveItem(4003004,50)){
				cm.gainItem(4000021,-50);//动物皮
				cm.gainItem(4003004,-50);//粗羽毛
				cm.gainItem(4001126,100);//枫叶
				cm.gainItem(4031456,20);//枫叶珠
                cm.即时存档();
				cm.setgrname(3);
				cm.worldMessage(6,"恭喜玩家：["+cm.getName()+"]完成了主线任务3，获得枫叶*100，枫叶珠*20！");
				cm.sendOk("#r恭喜你，完成了主线任务3，获得枫叶*100，枫叶珠*20！");
				cm.dispose();	
			}else{
				cm.sendOk(""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+"\r\n\r\n#r请收集#v4000021#*50，#v4003004#*50交给我\r\n奖励：#v4001126#*100，#v4031456#*20\r\n\r\n"+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+"\r\n");
				cm.dispose();		
			}
        } else if (selection == 4) {			
			if (cm.haveItem(4000015,50) && cm.haveItem(4000008,50)){
				cm.gainItem(4000015, -50);//刺蘑菇盖
				cm.gainItem(4000008, -50);//道符
				cm.gainItem(4000487,100);//钓鱼兑换币
				cm.gainItem(4001165,10);//太阳神的赐福
                cm.即时存档();
				cm.setgrname(4);
				cm.worldMessage(6,"恭喜玩家：["+cm.getName()+"]完成了主线任务4，获得钓鱼兑换币*100，太阳神的赐福*10！");
				cm.sendOk("#r恭喜你，完成了主线任务4，获得钓鱼兑换币*100，太阳神的赐福*10！");
				cm.dispose();
			}else{
				cm.sendOk(""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+"\r\n\r\n#r请收集#v4000015#*50，#v4000008#*50交给我\r\n奖励：#v4000487#*100，#v4001165#*10\r\n\r\n"+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+"\r\n");
				cm.dispose();
			}
        } else if (selection == 5) {			
			if (cm.haveItem(4001006,20)){
				cm.gainItem(4001006, -20);//火焰羽毛
				cm.gainItem(3992025,100);//圣诞大星
				cm.gainItem(4000313,10);//黄金枫叶
                cm.即时存档();
				cm.setgrname(5);
				cm.worldMessage(6,"恭喜玩家：["+cm.getName()+"]完成了主线任务5，获得圣诞大星*100，黄金枫叶*10！");
				cm.sendOk("#r恭喜你，完成了主线任务5，获得圣诞大星*100，黄金枫叶*10！");
				cm.dispose();
			}else{
				cm.sendOk(""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+"\r\n\r\n#r请收集#v4001006#*20交给我\r\n奖励：#v3992025#*100，#v4000313#*10\r\n\r\n"+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+"\r\n");
				cm.dispose();
			}
        } else if (selection == 6) {
			if (cm.haveItem(4000006 ,50) && cm.haveItem(4000177 ,50)){
				cm.gainItem(4000006, -50);//三眼章鱼触角
				cm.gainItem(4000177, -50);//混种石块
				cm.gainItem(3992025,100);//圣诞大星
				cm.gainItem(2022530, 1);//迎春花花语
                cm.即时存档();
				cm.setgrname(6);
				cm.worldMessage(6,"恭喜玩家：["+cm.getName()+"]完成了主线任务6，获得圣诞大星*100，迎春花花语*1！");
				cm.sendOk("#r恭喜你，完成了主线任务6，获得圣诞大星*100，迎春花花语*1！");
				cm.dispose();
			}else{
				cm.sendOk(""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+"\r\n\r\n#r请收集#v4000006#*50，#v4000177#*50交给我\r\n奖励：#v3992025#*100，#v2022530#*1\r\n\r\n"+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+"\r\n");
				cm.dispose();
			}
        } else if (selection == 7) {
			if (cm.haveItem(4031227, 5)){
				cm.gainItem(4031227, -5);//赤珠
				cm.gainMeso(+2000000);//200W金币
				cm.gainItem(2450000, 1);//幸运的狩猎
                cm.即时存档();
				cm.setgrname(7);
				cm.worldMessage(6,"恭喜玩家：["+cm.getName()+"]完成了主线任务7，获得金币*200W，幸运的狩猎*1！");
				cm.sendOk("#r恭喜你，完成了主线任务7，获得金币*200W，幸运的狩猎*1！");
				cm.dispose();
			}else{
				cm.sendOk(""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+"\r\n\r\n#r请收集#v4031227#*5交给我\r\n奖励：#v4031138#*200W，#v2450000#*1\r\n\r\n"+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+"\r\n");
				cm.dispose();
			}
        } else if (selection == 8) {
			if (cm.haveItem(4000034 ,50) && cm.haveItem(4000082 ,10)){
				cm.gainItem(4000034, -50);//蛇皮
				cm.gainItem(4000082, -10);//僵尸丢失的金齿
				cm.gainItem(3992025,200);//圣诞大星
				cm.gainItem(4005004,20);//黑暗水晶
				cm.gainAp(5);
                cm.即时存档();
				cm.setgrname(8);
				cm.worldMessage(6,"恭喜玩家：["+cm.getName()+"]完成了主线任务8，获得圣诞大星*200，黑暗水晶*20，属性点*5！");
				cm.sendOk("#r恭喜你，完成了主线任务8，获得圣诞大星*200，黑暗水晶*20，属性点*5！");
				cm.dispose();
			}else{
				cm.sendOk(""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+"\r\n\r\n#r请收集#v4000034#*50，#v4000082#*10交给我\r\n奖励：#v3992025#*200，#v4005004#*20，属性点*5\r\n\r\n"+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+"\r\n");
				cm.dispose();
			}
		} else if (selection == 9) {
			if (cm.haveItem(4000128, 25) && cm.haveItem(4000129, 25)){
				cm.gainItem(4000128, -25);//黄小丑的帽子
				cm.gainItem(4000129, -25);//红小丑的珠子
				cm.gainMeso(+4000000);//400W金币
				cm.gainItem(2049100,2);//混沌卷轴
				cm.gainItem(1112593,15,15,15,15,0,0,15,15,0,0,0,0,0,0);//全能戒指
				cm.即时存档();
				cm.setgrname(9);
				cm.worldMessage(6,"恭喜玩家：["+cm.getName()+"]完成了主线任务9，获得金币*400W，混沌卷轴*2，全能戒指*1！");
				cm.sendOk("#r恭喜你，完成了主线任务9，获得金币*400W，混沌卷轴*2，全能戒指*1！");
				cm.dispose();
			}else{
				cm.sendOk(""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+"\r\n\r\n#r请收集#v4000128#*25，#v4000129#*25交给我\r\n奖励：#v4031138#*400W，#v2049100#*2，#v1112593#*1\r\n\r\n"+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+"\r\n");
				cm.dispose();
			}
		} else if (selection == 10) {
			if (cm.haveItem(2210006, 5) && cm.haveItem(4000040, 5)){
				cm.gainItem(2210006, -5);//七七色蜗牛壳儿
				cm.gainItem(4000040, -5);//蘑菇王芽孢
				cm.gainItem(4251202, 5);//万能水晶
				cm.gainItem(2028074, 5);//每日礼箱
				cm.gainItem(4310143, 20);//BOSS币
				cm.即时存档();
				cm.setgrname(10);
				cm.worldMessage(6,"恭喜玩家：["+cm.getName()+"]完成了主线任务10，获得万能水晶*5，每日礼箱*5，BOSS币*20！");
				cm.sendOk("#r恭喜你，完成了主线任务10，获得万能水晶*5，每日礼箱*5，BOSS币*20！");
				cm.dispose();
			}else{
				cm.sendOk(""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+"\r\n\r\n#r请收集#v2210006#*5，#v4000040#*5交给我\r\n奖励：#v4251202#*5，#v2028074#*5，#v4310143#*20\r\n\r\n"+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+"\r\n");
				cm.dispose();
			}	
		} else if (selection == 11) {
			if (cm.haveItem(4000176, 5) && cm.haveItem(4000094, 5)){
				cm.gainItem(4000176, -5);//毒菇
				cm.gainItem(4000094, -5);//老板的名牌
				cm.gainItem(1902017,8,8,8,8,0,0,0,0,0,0,0,0,0,0);//狼
				cm.gainItem(1912011,8,8,8,8,0,0,0,0,0,0,0,0,0,0);//狼鞍子
				cm.gainItem(1902001,8,8,8,8,0,0,0,0,0,0,0,0,0,0);//银色野猪
				cm.gainItem(1912000,8,8,8,8,0,0,0,0,0,0,0,0,0,0);//皮鞍子
				cm.gainItem(4001126, 500);//枫叶
                cm.即时存档();
				cm.setgrname(11);
				cm.worldMessage(6,"恭喜玩家：["+cm.getName()+"]完成了主线任务11，获得银色野猪*1，皮鞍子*1，枫叶*500！");
				cm.sendOk("#r恭喜你，完成了主线任务11，获得银色野猪*1，皮鞍子*1，枫叶*500！");
				cm.dispose();
			}else{
				cm.sendOk(""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+"\r\n\r\n#r请收集#v4000176#*5，#v4000094#*5交给我\r\n奖励：#v1902001#*1，#v1912000#*1，#v4001126#*500\r\n\r\n"+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+"\r\n");
				cm.dispose();
			}
		} else if (selection == 12) {
			if (cm.haveItem(4000232 ,50) && cm.haveItem(4000233 ,50) && cm.haveItem(4000234 ,50) && cm.haveItem(1902001 ,1) && cm.haveItem(1912000 ,1)){
				cm.gainItem(1902001, -1);//银色野猪
				cm.gainItem(1912000, -1);//皮鞍子
				cm.gainItem(4000232, -50);//半人马的火花
				cm.gainItem(4000233, -50);//半人马的净水
				cm.gainItem(4000234, -50);//半人马的骨头
				cm.gainItem(1902001,18,18,18,18,0,0,0,0,0,0,0,0,0,0);//银色野猪
				cm.gainItem(1912000,18,18,18,18,0,0,0,0,0,0,0,0,0,0);//皮鞍子
				cm.gainItem(3992025,400);//圣诞大星
				cm.gainItem(4005004,50);//黑暗水晶
                cm.即时存档();
				cm.setgrname(12);
				cm.worldMessage(6,"恭喜玩家：["+cm.getName()+"]完成了主线任务12，获得银色野猪*1（升级），皮鞍子*1（升级），圣诞大星*400，黑暗水晶*50！");
				cm.sendOk("#r恭喜你，完成了主线任务12，获得银色野猪*1（升级），皮鞍子*1（升级），圣诞大星*400，黑暗水晶*50！");
				cm.dispose();
			}else{
				cm.sendOk(""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+"\r\n\r\n#r请收集#v4000232#*50，#v4000233#*50，#v4000234#*50交给我\r\n奖励：#v1902001#*升级，#v1912000#升级，#v3992025#*400，#v4005004#*50\r\n领取奖励时请将原#v1902001##v1912000#放在包内\r\n\r\n"+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+"\r\n");
				cm.dispose();
			}
		} else if (selection == 13) {
			if (cm.haveItem(4000150 ,50) && cm.haveItem(1902001 ,1) && cm.haveItem(1912000 ,1)){
				cm.gainItem(1902001, -1);//银色野猪
				cm.gainItem(1912000, -1);//皮鞍子
				cm.gainItem(4000150, -50);//时间鬼王的冰块
				cm.gainItem(1902001,18,18,18,18,0,0,8,8,0,0,0,0,0,0);//银色野猪
				cm.gainItem(1912000,18,18,18,18,0,0,8,8,0,0,0,0,0,0);//皮鞍子
				cm.gainMeso(+5000000); //500W金币
				cm.gainItem(2049100,5);//混沌卷轴
				cm.即时存档();
				cm.setgrname(13);
				cm.worldMessage(6,"恭喜玩家：["+cm.getName()+"]完成了主线任务13，获得银色野猪*1（升级），皮鞍子*1（升级），金币*500W，混沌卷轴*5！");
				cm.sendOk("#r恭喜你，完成了主线任务13，获得银色野猪*1（升级），皮鞍子*1（升级），金币*500W，混沌卷轴*5！");
				cm.dispose();
			}else{
				cm.sendOk(""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+"\r\n\r\n#r请收集#v4000150#*50交给我\r\n奖励：#v1902001#升级，#v1912000#升级，#v4031138#*500W，#v2049100#*5\r\n领取奖励时请将原#v1902001##v1912000#放在包内\r\n\r\n"+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+"\r\n");
				cm.dispose();
			}
		} else if (selection == 14) {
			if (cm.haveItem(4000235,5) && cm.haveItem(4000243,5) && cm.haveItem(1902001 ,1) && cm.haveItem(1912000 ,1)){
				cm.gainItem(1902001, -1);//银色野猪
				cm.gainItem(1912000, -1);//皮鞍子
				cm.gainItem(4000235, -5);//喷火龙的尾巴
				cm.gainItem(4000243, -5);//格瑞芬多角
				cm.gainItem(1902001,28,28,28,28,0,0,8,8,0,0,0,0,0,0);//银色野猪
				cm.gainItem(1912000,28,28,28,28,0,0,8,8,0,0,0,0,0,0);//皮鞍子
				cm.gainItem(4310036,20);//R时装附魔币
				cm.gainItem(4170012,1);//必成币兑换蛋
				cm.gainAp(5);
                cm.即时存档();
				cm.setgrname(14);
				cm.worldMessage(6,"恭喜玩家：["+cm.getName()+"]完成了主线任务14，获得银色野猪*1（升级），皮鞍子*1（升级），R时装附魔币*20，必成币兑换蛋*1！");
				cm.sendOk("#r恭喜你，完成了主线任务14，获得银色野猪*1（升级），皮鞍子*1（升级），R时装附魔币*20，必成币兑换蛋*1！");
				cm.dispose();
			}else{
				cm.sendOk(""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+"\r\n\r\n#r请收集#v4000235#*5，#v4000243#*5交给我\r\n奖励：#v1902001#升级，#v1912000#升级，#v4310036#*20，#v4170012#*1\r\n领取奖励时请将原#v1902001##v1912000#放在包内\r\n\r\n"+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+"\r\n");
				cm.dispose();
			}	
		} else if (selection == 15) {
			if (cm.haveItem(4000266,50) && cm.haveItem(4000267,50) && cm.haveItem(1902001 ,1) && cm.haveItem(1912000 ,1)){
				cm.gainItem(1902001, -1);//银色野猪
				cm.gainItem(1912000, -1);//皮鞍子
				cm.gainItem(4000266, -50);//木头护肩
				cm.gainItem(4000267, -50);//骷髅护肩
				cm.gainItem(1902001,28,28,28,28,0,0,18,18,0,0,0,0,0,0);//银色野猪
				cm.gainItem(1912000,28,28,28,28,0,0,18,18,0,0,0,0,0,0);//皮鞍子
				cm.gainItem(4310036,20);//R时装附魔币
				cm.gainItem(4251202,5);//万能水晶
				cm.gainAp(5);
                cm.即时存档();
				cm.setgrname(15);
				cm.worldMessage(6,"恭喜玩家：["+cm.getName()+"]完成了主线任务15，获得银色野猪*1（升级），皮鞍子*1（升级），R时装附魔币*20，万能水晶*5！");
				cm.sendOk("#r恭喜你，完成了主线任务15，获得银色野猪*1（升级），皮鞍子*1（升级），R时装附魔币*20，万能水晶*5！");
				cm.dispose();
			}else{
				cm.sendOk(""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+"\r\n\r\n#r请收集#v4000266#*50，#v4000267#*50交给我\r\n奖励：#v1902001#升级，#v1912000#升级，#v4310036#*20，#v4251202#*5\r\n领取奖励时请将原#v1902001##v1912000#放在包内\r\n\r\n"+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+"\r\n");
				cm.dispose();
			}
		} else if (selection == 16) {
			if (cm.haveItem(4001084,1) && cm.haveItem(4001085,1) && cm.haveItem(4001083,1) && cm.haveItem(1902001 ,1) && cm.haveItem(1912000 ,1)){
				cm.gainItem(1902001, -1);//银色野猪
				cm.gainItem(1912000, -1);//皮鞍子
				cm.gainItem(4001084, -1);//闹钟象征
				cm.gainItem(4001085, -1);//鱼王象征
				cm.gainItem(4001083, -1);//扎昆象征
				cm.gainItem(1902001,38,38,38,38,0,0,18,18,0,0,0,0,0,0);//银色野猪
				cm.gainItem(1912000,38,38,38,38,0,0,18,18,0,0,0,0,0,0);//皮鞍子
				cm.gainItem(4001165,20);//太阳神的赐福
				cm.gainMeso(+5000000);//500W金币
                cm.即时存档();
				cm.setgrname(16);
				cm.worldMessage(6,"恭喜玩家：["+cm.getName()+"]完成了主线任务16，获得银色野猪*1（升级），皮鞍子*1（升级），太阳神的赐福*20，金币*500W！");
				cm.sendOk("#r恭喜你，完成了主线任务16，获得银色野猪*1（升级），皮鞍子*1（升级），太阳神的赐福*20，金币*500W！");
				cm.dispose();
			}else{
				cm.sendOk(""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+"\r\n\r\n#r请收集#v4001084#*1，#v4001085#*1，#v4001083#*1交给我\r\n奖励：#v1902001#升级，#v1912000#升级，#v4001165#*20，#v4031138#*500W\r\n领取奖励时请将原#v1902001##v1912000#放在包内\r\n\r\n"+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+"\r\n");
				cm.dispose();
			}
		} else if (selection == 17) {
			if (cm.haveItem(4001080,1) && cm.haveItem(4001081,1) && cm.haveItem(4001082,1) && cm.haveItem(1902001 ,1) && cm.haveItem(1912000 ,1)){
				cm.gainItem(1902001, -1);//银色野猪
				cm.gainItem(1912000, -1);//皮鞍子
				cm.gainItem(4001080, -1);//敢死队象征1
				cm.gainItem(4001081, -1);//敢死队象征2
				cm.gainItem(4001082, -1);//敢死队象征3
				cm.gainItem(1902001,38,38,38,38,0,0,28,28,0,0,0,0,0,0);//银色野猪
				cm.gainItem(1912000,38,38,38,38,0,0,28,28,0,0,0,0,0,0);//皮鞍子
				cm.gainItem(2049100,5);//混沌卷轴
				cm.gainItem(4170012,1);//必成币兑换蛋
				cm.gainAp(5);
                cm.即时存档();
				cm.setgrname(17);
				cm.worldMessage(6,"恭喜玩家：["+cm.getName()+"]完成了主线任务17，获得银色野猪*1（升级），皮鞍子*1（升级），混沌卷轴*5，必成币兑换蛋*1，属性点*5！");
				cm.sendOk("#r恭喜你，完成了主线任务17，获得银色野猪*1（升级），皮鞍子*1（升级），混沌卷轴*5，必成币兑换蛋*1，属性点*5！");
				cm.dispose();
			}else{
				cm.sendOk(""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+"\r\n\r\n#r请收集#v4001080#*1，#v4001081#*1，#v4001082#*1交给我\r\n奖励：#v1902001#升级，#v1912000#升级，#v2049100#*5，#v4170012#*1，属性点*5\r\n领取奖励时请将原#v1902001##v1912000#放在包内\r\n\r\n"+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+"\r\n");
				cm.dispose();
			}
		} else if (selection == 18) {
			if (cm.haveItem(4000272 ,50) && cm.haveItem(1902001 ,1) && cm.haveItem(1912000 ,1)){
				cm.gainItem(1902001, -1);//银色野猪
				cm.gainItem(1912000, -1);//皮鞍子
				cm.gainItem(4000272, -50);//蛋壳碎片
				cm.gainItem(1902001,48,48,48,48,0,0,28,28,0,0,0,0,0,0);//银色野猪
				cm.gainItem(1912000,48,48,48,48,0,0,28,28,0,0,0,0,0,0);//皮鞍子
				cm.gainItem(3992025,600);//圣诞大星
				cm.gainItem(4031456,100);//枫叶珠
				cm.gainAp(5);
                cm.即时存档();
				cm.setgrname(18);
				cm.worldMessage(6,"恭喜玩家：["+cm.getName()+"]完成了主线任务18，获得银色野猪*1（升级），皮鞍子*1（升级），圣诞大星*600，枫叶珠*100，属性点*5！");
				cm.sendOk("#r恭喜你，完成了主线任务18，获得银色野猪*1（升级），皮鞍子*1（升级），圣诞大星*600，枫叶珠*100，属性点*5！");
				cm.dispose();
			}else{
				cm.sendOk(""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+"\r\n\r\n#r请收集#v4000272#*50交给我\r\n奖励：#v1902001#升级，#v1912000#升级，#v3992025#*600，#v4031456#*100，属性点*5\r\n领取奖励时请将原#v1902001##v1912000#放在包内\r\n\r\n"+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+"\r\n");
				cm.dispose();
			}
		} else if (selection == 19) {
			if (cm.haveItem(4000268,50) && cm.haveItem(4000269,50) && cm.haveItem(4000270,50) && cm.haveItem(1902001 ,1) && cm.haveItem(1912000 ,1)){
				cm.gainItem(1902001, -1);//银色野猪
				cm.gainItem(1912000, -1);//皮鞍子
				cm.gainItem(4000268, -50);//飞龙的翅膀
				cm.gainItem(4000269, -50);//飞龙的腮
				cm.gainItem(4000270, -50);//飞龙的指甲
				cm.gainItem(1902001,48,48,48,48,0,0,38,38,0,0,0,0,0,0);//银色野猪
				cm.gainItem(1912000,48,48,48,48,0,0,38,38,0,0,0,0,0,0);//皮鞍子
				cm.gainItem(4005000, 30);//力量水晶
				cm.gainItem(4005001, 30);//智慧水晶
				cm.gainItem(4005002, 30);//敏捷水晶
				cm.gainItem(4005003, 30);//幸运水晶
                cm.即时存档();
				cm.setgrname(19);
				cm.worldMessage(6,"恭喜玩家：["+cm.getName()+"]完成了主线任务19，获得银色野猪*1（升级），皮鞍子*1（升级），力量水晶*30，智慧水晶*30，敏捷水晶*30，幸运水晶*30！");
				cm.sendOk("#r恭喜你，完成了主线任务19，获得银色野猪*1（升级），皮鞍子*1（升级），力量水晶*30，智慧水晶*30，敏捷水晶*30，幸运水晶*30！");
				cm.dispose();
			}else{
				cm.sendOk(""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+"\r\n\r\n#r请收集#v4000268#*50，#v4000269#*50，#v4000270#*50交给我\r\n奖励：#v1902001#升级，#v1912000#升级，#v4005000#*30，#v4005001#*30，#v4005002#*30，#v4005003#*30\r\n领取奖励时请将原#v1902001##v1912000#放在包内\r\n\r\n"+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+"\r\n");
				cm.dispose();
			}
		} else if (selection == 20) {
			if (cm.haveItem(4000407,50) && cm.haveItem(4000402,50) && cm.haveItem(4000406,50) && cm.haveItem(1902001 ,1) && cm.haveItem(1912000 ,1)){
				cm.gainItem(1902001, -1);//银色野猪
				cm.gainItem(1912000, -1);//皮鞍子
				cm.gainItem(4000407, -50);//铜人心
				cm.gainItem(4000402, -50);//银人心
				cm.gainItem(4000406, -50);//金人心
				cm.gainItem(3700048, 1);//咆哮兑换
				cm.gainItem(1902001,58,58,58,58,0,0,38,38,0,0,0,0,0,0);//银色野猪
				cm.gainItem(1912000,58,58,58,58,0,0,38,38,0,0,0,0,0,0);//皮鞍子
				cm.gainItem(4310038, 10);//SR时装附魔币
				cm.gainItem(4001126, 500);//枫叶
                cm.即时存档();
				cm.setgrname(20);
				cm.worldMessage(6,"恭喜玩家：["+cm.getName()+"]完成了主线任务20，获得银色野猪*1（升级），皮鞍子*1（升级），SR时装附魔币*10，枫叶*500！");
				cm.sendOk("#r恭喜你，完成了主线任务20，获得银色野猪*1（升级），皮鞍子*1（升级），SR时装附魔币*10，枫叶*500！");
				cm.dispose();
			}else{
				cm.sendOk(""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+"\r\n\r\n#r请收集#v4000407#*50，#v4000402#*50，#v4000406#*50交给我\r\n奖励：#v1902001#升级，#v1912000#升级，#v4310038#*10，#v4001126#*500\r\n领取奖励时请将原#v1902001##v1912000#放在包内\r\n\r\n"+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+"\r\n");
				cm.dispose();
			}
		} else if (selection == 21) {
			if (cm.haveItem(4000271,50) && cm.haveItem(4001094,2) && cm.haveItem(1902001 ,1) && cm.haveItem(1912000 ,1)){
				cm.gainItem(1902001, -1);//银色野猪
				cm.gainItem(1912000, -1);//皮鞍子
				cm.gainItem(4000271, -50);//破损的巢穴
				cm.gainItem(4001094, -2);//九灵龙的蛋
				cm.gainItem(1902001,58,58,58,58,0,0,48,48,0,0,0,0,0,0);//银色野猪
				cm.gainItem(1912000,58,58,58,58,0,0,48,48,0,0,0,0,0,0);//皮鞍子
				cm.gainItem(4310038, 10);//SR时装附魔币
				//cm.gainItem(3700048, 1);//咆哮兑换
				cm.gainMeso(+5000000);//500W金币
				cm.gainAp(5);
                cm.即时存档();
				cm.setgrname(21);
				cm.worldMessage(6,"恭喜玩家：["+cm.getName()+"]完成了主线任务21，获得银色野猪*1（升级），皮鞍子*1（升级），SR时装附魔币*10，金币*500W，属性点*5，超级龙咆哮技能！");
				cm.sendOk("#r恭喜你，完成了主线任务21，获得银色野猪*1（升级），皮鞍子*1（升级），SR时装附魔币*10，金币*500W，属性点*5，超级龙咆哮技能！");
				cm.dispose();
			}else{
				cm.sendOk(""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+"\r\n\r\n#r请收集#v4000271#*50，#v4001094#*2交给我\r\n奖励：#v1902001#升级，#v1912000#升级，#v4310038#*10，#v4031138#*500W，属性点*5\r\n领取奖励时请将原#v1902001##v1912000#放在包内\r\n\r\n"+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+"\r\n");
				cm.dispose();
			}
		} else if (selection == 22) {
			if (cm.haveItem(4000244,5) && cm.haveItem(4000245,5) && cm.haveItem(1902001 ,1) && cm.haveItem(1912000 ,1)){
				cm.gainItem(1902001, -1);//银色野猪
				cm.gainItem(1912000, -1);//皮鞍子
				cm.gainItem(4000244, -5);//蓝色双角龙的灵魂
				cm.gainItem(4000245, -5);//蓝色双角龙的鳞片
				cm.gainItem(1902001,68,68,68,68,0,0,48,48,0,0,0,0,0,0);//银色野猪
				cm.gainItem(1912000,68,68,68,68,0,0,48,48,0,0,0,0,0,0);//皮鞍子
				cm.gainItem(3992025, 800);//圣诞大星
				cm.gainItem(2049116, 1);//强化混沌卷轴
				cm.gainAp(10);
                cm.即时存档();
				cm.setgrname(22);
				cm.worldMessage(6,"恭喜玩家：["+cm.getName()+"]完成了主线任务22，获得银色野猪*1（升级），皮鞍子*1（升级），圣诞大星*800，强化混沌卷轴*1，属性点*10！");
				cm.sendOk("#r恭喜你，完成了主线任务22，获得银色野猪*1（升级），皮鞍子*1（升级），圣诞大星*800，强化混沌卷轴*1，属性点*10！");
				cm.dispose();
			}else{
				cm.sendOk(""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+"\r\n\r\n#r请收集#v4000244#*5，#v4000245#*5交给我\r\n奖励：#v1902001#升级，#v1912000#升级，#v3992025#*800，#v2049116#*1，属性点*10\r\n领取奖励时请将原#v1902001##v1912000#放在包内\r\n\r\n"+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+"\r\n");
				cm.dispose();
			}
		} else if (selection == 23) {
			if (cm.haveItem(4001241,5) && cm.haveItem(4001242,5) && cm.haveItem(1902001 ,1) && cm.haveItem(1912000 ,1)){
				cm.gainItem(1902001, -1);//银色野猪
				cm.gainItem(1912000, -1);//皮鞍子
				cm.gainItem(4001241, -5);//暴力熊足
				cm.gainItem(4001242, -5);//心疤狮王足
				cm.gainItem(1902001,68,68,68,68,0,0,58,58,0,0,0,0,0,0);//银色野猪
				cm.gainItem(1912000,68,68,68,68,0,0,58,58,0,0,0,0,0,0);//皮鞍子
				cm.gainItem(3992025, 1000);//圣诞大星
				cm.gainItem(2022530, 2);//迎春花花语
				cm.gainAp(10);
                cm.即时存档();
				cm.setgrname(23);
				cm.worldMessage(6,"恭喜玩家：["+cm.getName()+"]完成了主线任务23，获得银色野猪*1（升级），皮鞍子*1（升级），圣诞大星*1000，迎春花花语*2，属性点*10！");
				cm.sendOk("#r恭喜你，完成了主线任务23，获得银色野猪*1（升级），皮鞍子*1（升级），圣诞大星*1000，迎春花花语*2，属性点*10！");
				cm.dispose();
			}else{
				cm.sendOk(""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+"\r\n\r\n#r请收集#v4001241#*5，#v4001242#*5交给我\r\n奖励：#v1902001#升级，#v1912000#升级，#v3992025#*1000，#v2022530#*2，属性点*10\r\n领取奖励时请将原#v1902001##v1912000#放在包内\r\n\r\n"+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+"\r\n");
				cm.dispose();
			}
		} else if (selection == 24) {
			if (cm.haveItem(4000460,5) && cm.haveItem(4000461,5) && cm.haveItem(4000462,5) && cm.haveItem(1902001 ,1) && cm.haveItem(1912000 ,1)){
				cm.gainItem(1902001, -1);//银色野猪
				cm.gainItem(1912000, -1);//皮鞍子
				cm.gainItem(4000460, -5);//古代头盔
				cm.gainItem(4000461, -5);//骑士面具
				cm.gainItem(4000462, -5);//守护兽之角
				cm.gainItem(1902001,78,78,78,78,0,0,58,58,0,0,0,0,0,0);//银色野猪
				cm.gainItem(1912000,78,78,78,78,0,0,58,58,0,0,0,0,0,0);//皮鞍子
				cm.gainItem(3992025, 1200);//圣诞大星
				cm.gainItem(4011007, 1);//月石
				cm.gainAp(10);
                cm.即时存档();
				cm.setgrname(24);
				cm.worldMessage(6,"恭喜玩家：["+cm.getName()+"]完成了主线任务24，获得银色野猪*1（升级），皮鞍子*1（升级），圣诞大星*1200，月石*1，属性点*10！");
				cm.sendOk("#r恭喜你，完成了主线任务24，获得银色野猪*1（升级），皮鞍子*1（升级），圣诞大星*1200，月石*1，属性点*10！");
				cm.dispose();
			}else{
				cm.sendOk(""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+"\r\n\r\n#r请收集#v4000460#*5，#v4000461#*5，#v4000462#*5交给我\r\n奖励：#v1902001#升级，#v1912000#升级，#v3992025#*1200，#v4011007#*1，属性点*10\r\n领取奖励时请将原#v1902001##v1912000#放在包内\r\n\r\n"+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+"\r\n");
				cm.dispose();
			}
		} else if (selection == 25) {
			if (cm.haveItem(4000435,5) && cm.haveItem(4021010,5) && cm.haveItem(1902001 ,1) && cm.haveItem(1912000 ,1)){
				cm.gainItem(1902001, -1);//银色野猪
				cm.gainItem(1912000, -1);//皮鞍子
				cm.gainItem(4000435, -5);//联盟钥匙
				cm.gainItem(4021010, -5);//时间之石
				cm.gainItem(1902001,108,108,108,108,0,0,78,78,0,0,0,0,0,0);//银色野猪
				cm.gainItem(1912000,108,108,108,108,0,0,78,78,0,0,0,0,0,0);//皮鞍子
				//cm.gainItem(1902017,108,108,108,108,0,0,78,78,0,0,0,0,0,0);//狼
				//cm.gainItem(1912011,108,108,108,108,0,0,78,78,0,0,0,0,0,0);//狼鞍子
				cm.gainItem(3992025, 1500);//圣诞大星
				cm.gainItem(4011008, 1);//锂
				//cm.gainItem(3700048, 1);//咆哮兑换
				cm.gainAp(10);
                cm.即时存档();
				cm.setgrname(25);
				cm.worldMessage(6,"恭喜玩家：["+cm.getName()+"]完成了主线任务25，获得银色野猪*1（升级），皮鞍子*1（升级），圣诞大星*1500，锂*1，属性点*10！");
				cm.sendOk("#r恭喜你，完成了主线任务25，获得银色野猪*1（升级），皮鞍子*1（升级），圣诞大星*1500，锂*1，属性点*10！");
				cm.dispose();
			}else{
				cm.sendOk(""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+"\r\n\r\n#r请收集#v4000435#*5，#v4021010#*5交给我\r\n奖励：#v1902001#最终升级，#v1912000#最终升级，#v3992025#*1500，#v4011008#*1，属性点*10\r\n领取奖励时请将原#v1902001##v1912000#放在包内\r\n\r\n"+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+"\r\n");
				cm.dispose();
			}
			}else if (selection == 100) {
		    cm.openNpc(9900004, 1201112);
		} 
    }
}
