
status = -1;
var itemList = Array(
Array(1050100, 70, 1, 1), //浴衣男
Array(1051098, 70, 1, 1), //浴衣女
//Array(1113057, 100, 1, 1), //绝对
//Array(1012314, 200, 1, 1), //脸
//Array(1113021, 200, 1, 1), //时装戒指 
//Array(1122142, 200, 1, 1), //冒险之心
//Array(1122138, 200, 1, 1), //冒险之心
//Array(1122141, 200, 1, 1), //冒险之心
//Array(1122140, 200, 1, 1), //冒险之心
//Array(1122139, 200, 1, 1), //冒险之心
//Array(1012314, 200, 1, 1), //脸
Array(1912336, 20, 1, 1), //脸
Array(1912337, 20, 1, 1), //脸
Array(1912338, 20, 1, 1), //脸
Array(1912339, 20, 1, 1), //脸
Array(1912340, 20, 1, 1), //脸
Array(1912341, 20, 1, 1), //脸
Array(1912342, 20, 1, 1), //脸
Array(1912343, 20, 1, 1), //脸
Array(1912344, 20, 1, 1), //脸
Array(1912345, 20, 1, 1), //脸
Array(1912346, 20, 1, 1), //脸
Array(1012307, 200, 1, 1), //脸
Array(1012314, 200, 1, 1), //脸
//Array(1102084, 100, 1, 1), //粉盖
//Array(1102086, 100, 1, 1), //紫盖
Array(1402037, 70, 1, 1), //龙背
Array(1432037, 70, 1, 1), //枫叶大将
Array(1432080, 60, 1, 0), //末代枪
Array(1472117, 70, 1, 0), //至尊拳
Array(1382037, 100, 1, 1), //堰月
Array(1402014, 70, 1, 1), //温度
Array(1402063, 70, 1, 1), //樱花
Array(1452106, 70, 1, 1), //至尊弓
Array(1462091, 70, 1, 1), //弩
Array(1492079, 60, 1, 1), //短枪
//Array(1462091, 70, 1, 1), //单手剑
Array(1332077, 70, 1, 1), //短刀
Array(1442111, 70, 1, 1), //矛
Array(1482079, 70, 1, 1), //指节
Array(1012319, 200, 1, 1), //8点点红

Array(1432102, 100, 1, 1), //神龙
Array(1402114, 100, 1, 1), //神龙
Array(1382127, 100, 1, 1), //神龙
Array(1472144, 100, 1, 1), //神龙
Array(1482105, 100, 1, 1), //神龙
Array(1492104, 100, 1, 1), //神龙
Array(1332153, 100, 1, 1), //神龙
Array(1462121, 100, 1, 1), //神龙
Array(1452132, 100, 1, 1), //神龙
Array(1442139, 100, 1, 1), //神龙


Array(1372042, 80, 1, 1), //130狂雷之杖
Array(1372041, 80, 1, 1), //寒冰之杖
Array(1372040, 80, 1, 1), //剧毒之杖
Array(1372039, 80, 1, 1), //爆炎之杖

Array(1382048, 80, 1, 1), //103雷之杖
Array(1382047, 80, 1, 1), //冰之杖
Array(1382046, 80, 1, 1), //毒之杖
Array(1382045, 80, 1, 1), //火之杖

Array(1442018, 300, 1, 1), //冻冻鱼
Array(1442046, 200, 1, 1), //超级雪板 
Array(1432046, 200, 1, 1), //圣诞拐杖树  
Array(1432045, 200, 1, 1), //日枪
Array(1432039, 300, 1, 1), //钓鱼竿
Array(1432013, 300, 1, 1), //南瓜枪
Array(1422011, 200, 1, 1), //清酒 
Array(1412032, 300, 1, 1), //月之斧
Array(1402044, 400, 1, 1), //南瓜
Array(1372031, 400, 1, 1), //圣贤之丈
Array(1372017, 500, 1, 1), //路灯
Array(1442022, 500, 1, 1), //拖把 
Array(1322053, 500, 1, 1), //皇丈
Array(1322006, 500, 1, 1), //钢管
Array(1312012, 500, 1, 1), //呼啦圈 
Array(1322051, 500, 1, 1), //七夕
Array(1302001, 400, 1, 1), //锯子
Array(1302080, 400, 1, 1), //闪光彩灯鞭 
Array(1302079, 500, 1, 1), //战刃
Array(1302065, 400, 1, 1), //蓝色枫叶旗 
Array(1302058, 400, 1, 1), //枫叶伞
Array(1302049, 400, 1, 1), //光线鞭
Array(1302037, 500, 1, 1), //小号
Array(1302036, 500, 1, 1), //枫叶小旗 
Array(1432018, 500, 1, 1), //蓝色滑雪板
Array(1442030, 500, 1, 1), //枫之雪板
Array(1432017, 400, 1, 1), //绿色滑雪板
Array(1432018, 400, 1, 1), //蓝色滑雪板
Array(1432015, 400, 1, 1), //红色滑雪板
Array(3010044, 250, 1, 1), //同一红伞下
Array(3010199, 250, 1, 1), //雪房子
Array(3013000, 250, 1, 1), //樱花树下
Array(3010188, 300, 1, 1), //
Array(3010185, 300, 1, 1), //
Array(3010179, 300, 1, 1), //
Array(3010177, 300, 1, 1), //
Array(3010183, 300, 1, 1), //
Array(3010173, 300, 1, 1), //
Array(3010183, 300, 1, 1), //
Array(3010172, 300, 1, 1), //
Array(3010170, 300, 1, 1), //
Array(3010169, 300, 1, 1), //
Array(3010161, 300, 1, 1), //
Array(3010151, 300, 1, 1), //
Array(3010142, 300, 1, 1), //
Array(3010505, 300, 1, 1), //

Array(3010037, 300, 1, 1), //
Array(3010068, 300, 1, 1), //
Array(3010053, 300, 1, 1), //
Array(3010681, 300, 1, 1), //
Array(3010063, 300, 1, 1), //
Array(3010030, 400, 1, 1), //
Array(3010033, 400, 1, 1), //
Array(3010032, 400, 1, 1), //
Array(3010031, 400, 1, 1), //
Array(3010039, 400, 1, 1), //
Array(3010369, 300, 1, 1), //
Array(3010071, 300, 1, 1), //
Array(3010085, 300, 1, 1), //
Array(3010093, 300, 1, 1), //
Array(3010086, 300, 1, 1), //
Array(3010126, 300, 1, 1), //
Array(3010140, 300, 1, 1), //
Array(3010133, 300, 1, 1), //
Array(3010125, 300, 1, 1), //
Array(3010119, 300, 1, 1), //
Array(3010111, 300, 1, 1), //
Array(3010108, 300, 1, 1), //
Array(3010106, 300, 1, 1), //
Array(3010110, 300, 1, 1), //
Array(3010196, 300, 1, 1), //
Array(3010222, 20, 1, 1), //
Array(3010205, 300, 1, 1), //
Array(3010195, 300, 1, 1), //
Array(3010193, 300, 1, 1), //
Array(3010194, 300, 1, 1), //
Array(3010212, 300, 1, 1), //
Array(3010184, 300, 1, 1), //
Array(3010519, 300, 1, 1), //
Array(3010070, 500, 1, 1), //PB
Array(3010073, 300, 1, 1), //

Array(3010530, 30, 1, 1), //
Array(3010608, 300, 1, 1), //
Array(3010606, 300, 1, 1), //
Array(3010609, 300, 1, 1), //
Array(3010531, 300, 1, 1), //

Array(3010593, 300, 1, 1), //
Array(3010598, 300, 1, 1), //
Array(3010599, 300, 1, 1), //
Array(3010591, 300, 1, 1), //
Array(3010571, 300, 1, 1), //
Array(3010589, 300, 1, 1), //
Array(3010555, 20, 1, 1), //深夜猫头鹰
Array(3010527, 300, 1, 1), //章鱼
Array(3010520, 20, 1, 1), //企鹅
Array(3010522, 400, 1, 1), //兔子
Array(3010515, 500, 1, 1), //
Array(3010524, 500, 1, 1), //
Array(3010025, 300, 1, 1), //枫树椅子
Array(3010026, 300, 1, 1), //傀儡椅子
Array(3010009, 300, 1, 1), //粉色爱心马桶
Array(3010013, 300, 1, 1), //悠长假期

Array(3012002, 20, 1, 1), //月亮弯弯
Array(3010670, 300, 1, 1), //月亮弯弯
Array(3010660, 300, 1, 1), //月亮弯弯
Array(3010661, 30, 1, 1), //月亮弯弯
Array(3010622, 300, 1, 1), //月亮弯弯
Array(3010623, 300, 1, 1), //月亮弯弯
Array(3010631, 300, 1, 1), //月亮弯弯
Array(3010644, 300, 1, 1), //月亮弯弯
Array(3010620, 300, 1, 1), //月亮弯弯
Array(3010643, 300, 1, 1), //月亮弯弯
Array(3010014, 300, 1, 1), //月亮弯弯
Array(3010642, 300, 1, 1), //月亮弯弯

Array(2210011, 500, 1, 1), //矿
Array(2210029, 500, 1, 1), //矿
Array(2210031, 500, 1, 1), //矿
Array(2210036, 500, 1, 1), //矿
Array(2210037, 500, 1, 1), //矿
Array(2210039, 500, 1, 1), //矿
Array(2210038, 500, 1, 1), //矿
Array(2210035, 500, 1, 1), //矿
Array(2210010, 500, 1, 1), //矿
Array(2210034, 500, 1, 1), //矿
Array(4250602, 500, 1, 1), //矿
Array(2070006, 150, 1, 1), //齿轮
Array(2070007, 150, 1, 1), //月牙
Array(2070005, 400, 1, 1), //金钱
Array(2340000, 70, 1, 1), //祝福卷
Array(2049100, 80, 1, 1), //混沌卷
Array(1022060, 300, 1, 1), //狐猴
Array(1012070, 150, 1, 1), //雪糕
Array(1012071, 200, 1, 1), //雪糕
Array(1012072, 150, 1, 1), //雪糕
Array(1012073, 200, 1, 1), //雪糕
Array(1022058, 200, 1, 1), //狸
Array(1092030, 150, 1, 1), //枫叶盾
Array(1092045, 200, 1, 1), //高级法盾
Array(1092046, 300, 1, 1), //高级战盾
Array(1092050, 100, 1, 1), //盾
Array(1092049, 70, 1, 1), //盾
Array(1122017, 150, 1, 1), //经验
Array(1302106, 500, 1, 0), //蓝火焰刀
Array(1032025, 500, 1, 0), //叶子耳环
Array(1032026, 500, 1, 0), //黄水晶耳环
Array(1032027, 50, 1, 0), //黑水晶耳环
Array(1032028, 500, 1, 0), //红水晶耳环
Array(1032035, 500, 1, 1), //枫叶耳环
Array(1032040, 50, 1, 1), //枫叶型耳环
Array(1032041, 500, 1, 1), //枫叶型耳环
Array(1032042, 500, 1, 1), //枫叶型耳环
Array(1032047, 100, 1, 1), //七七耳环
Array(1302017, 100, 1, 1), //七七耳环
Array(1082145, 200, 1, 1), //手套
Array(1082146, 300, 1, 1), //手套
Array(1082147, 400, 1, 1), //手套
Array(1082148, 500, 1, 1), //手套
Array(1082150, 200, 1, 1), //手套
Array(1082149, 80, 1, 1), //褐色攻手
Array(3010592, 200, 1, 1), //PB椅子
Array(4250602, 200, 1, 1), //黄晶
Array(2330003, 40, 1, 1), //子弹
Array(2330004, 400, 1, 1), //子弹
Array(3010465, 80, 1, 1), //音符椅子
Array(3010099, 500, 1, 1), //熊椅子
Array(3010376, 500, 1, 1), //红色药水椅子
Array(1122001, 500, 1, 1), //领结
Array(1122002, 500, 1, 1), //领结
Array(1122003, 50, 1, 1), //领结
Array(1122004, 500, 1, 1), //领结
Array(1122005, 50, 1, 1), //领结
Array(1122006, 500, 1, 1), //领结
Array(1122015, 500, 1, 1), //枫叶围巾
Array(1122058, 50, 1, 1), //混沌吊坠
Array(1132000, 500, 1, 1), //白腰带
Array(1132001, 500, 1, 1), //黄腰带
Array(1132002, 500, 1, 1), //蓝腰带
Array(1132003, 500, 1, 1), //红腰带
Array(1132004, 200, 1, 1), //黑腰带
Array(1132010, 500, 1, 1), //猪腰带
Array(1132011, 100, 1, 1), //猪腰带
Array(1132012, 500, 1, 1), //法老腰带
Array(1132013, 200, 1, 1), //法老腰带2
Array(1122074, 500, 1, 1), //枫叶吊坠
Array(1122075, 500, 1, 1), //枫叶吊坠2
Array(1003439, 300, 1, 1), //粉扎头
Array(1002418, 400, 1, 0), //报纸帽
Array(1002419, 500, 1, 0), //枫叶帽
Array(1002424, 500, 1, 0), //马术红
Array(1002425, 500, 1, 0), //马术蓝
Array(1002441, 500, 1, 0), //热血
Array(1002508, 500, 1, 0), //枫叶头
Array(1002509, 500, 1, 0), //枫叶头2
Array(1002510, 300, 1, 0), //枫叶头3
Array(1002511, 400, 1, 0), //枫叶头4
Array(1002547, 500, 1, 0), //猎人帽
Array(1002550, 500, 1, 0), //黑色头盔
Array(1002551, 500, 1, 0), //蓝龙
Array(2022118, 500, 1, 0), //管理员的祝福
Array(2022170, 600, 1, 0), //口香糖
Array(2022171, 600, 1, 0), //口香糖
Array(2022172, 500, 1, 0), //口香糖
Array(2022173, 500, 1, 0), //口香糖
Array(2000005, 600, 1, 0), //超级药水
Array(2100003, 500, 1, 0), //怪物召唤3
Array(2100004, 500, 1, 0), //怪物召唤4
Array(2100005, 500, 1, 0), //怪物召唤5
Array(2100007, 500, 1, 0), //怪物召唤7
Array(2100008, 500, 1, 0), //怪物召唤8
Array(2100009, 500, 1, 0), //怪物召唤9
Array(2210034, 500, 1, 0), //外星人变身
Array(2100009, 500, 1, 0), //蝙蝠怪包



Array(1382049, 60, 1, 0), //朱雀
Array(1382050, 60, 1, 0), //玄武
Array(1382051, 60, 1, 0), //白虎
Array(1382052, 60, 1, 0), //青龙

		Array(1082313,100,1,1),//100枫叶装
		Array(1332143,100,1,1),//100枫叶装
		Array(1342038,100,1,1),//100枫叶装
		Array(1372095,100,1,1),//100枫叶装
		Array(1382119,100,1,1),//100枫叶装
		Array(1402105,100,1,1),//100枫叶装
		Array(1432075,80,1,1),//100枫叶装
		Array(1442131,100,1,1),//100枫叶装
		Array(1452124,100,1,1),//100枫叶装
		Array(1462112,100,1,1),//100枫叶装
		Array(1472135,100,1,1),//100枫叶装
		Array(1482097,80,1,1),//100枫叶装
		Array(1492096,80,1,1),//100枫叶装
Array(2370006, 500, 1, 1), //经验3000
Array(2370007, 500, 1, 1), //经验2000
Array(2370008, 500, 1, 1), //经验1000
Array(2370002, 500, 1, 1), //经验30000
Array(2370003, 300, 1, 1), //经验20000
Array(2370004, 500, 1, 1), //经验10000
Array(2370005, 500, 1, 1), //经验5000
Array(2370000, 500, 1, 1), //经验100000
Array(2370001, 500, 1, 1), //经验50000
//Array(2040801, 200, 1, 1), //手套敏捷卷轴60%
//Array(4020000, 50, 1, 1), //矿
//Array(4010000, 50, 1, 1), //矿
//Array(4020001, 100, 1, 1), //矿
//Array(4010001, 100, 1, 1), //矿
//Array(4020002, 100, 1, 1), //矿
//Array(4010002, 200, 1, 1), //矿
//Array(4020003, 200, 1, 1), //矿
////Array(4010003, 200, 1, 1), //矿
//Array(4020004, 300, 1, 1), //矿
//Array(4010004, 300, 1, 1), //矿
//Array(4020005, 300, 1, 1), //矿
//Array(4010005, 400, 1, 1), //矿
//Array(4020006, 400, 1, 1), //矿

			Array(2290023,80,1,1),//恶龙30
			Array(2290009,80,1,1),//斗气30
			Array(2290011,80,1,1),//轻舞30
			Array(2290031,80,1,1),//30爆破
			Array(2290033,80,1,1),//30闪电
			Array(2290048,80,1,1),//圣光普照20
			Array(2290049,60,1,1),//圣光普照30
			Array(2290053,80,1,1),//火眼30  2290016  2290470
			//Array(2290016,80,1,1),//葵花20
			Array(2290047,50,1,1),//落30
			Array(2290061,80,1,1),//暴风箭雨30
			Array(2290091,80,1,1),//一出双击30
			Array(2290085,80,1,1),//3连环广击破30
			Array(2290093,70,1,1),//暗杀30
			Array(2290101,80,1,1),//变身20
			Array(2290125,80,1,1),//勇士
			Array(2290096,80,1,1),//勇士
			Array(2290120,80,1,1),//急速射30 2290125 2290096
			Array(2043003, 100, 1, 1), //单手剑100
			Array(2044003, 100, 1, 1), //双手剑100
			Array(2044303, 100, 1, 1), //枪100
			Array(2044503, 200, 1, 1), //弓
			Array(2044603, 200, 1, 1), //弩  
			Array(2043303, 100, 1, 1), //短剑
			Array(2043703, 100, 1, 1), //短杖
			Array(2043803, 100, 1, 1), //长杖
			Array(2044703, 100, 1, 1), //拳套
			Array(2044908, 100, 1, 1), //短枪
			Array(2044815, 100, 1, 1), //指节
			Array(2044403, 100, 1, 1), //矛
			Array(2044203, 200, 1, 1), //双钝
	        Array(2044103, 250, 1, 1), //双斧
			Array(2043203, 250, 1, 1), //单钝
			Array(2043103, 100, 1, 1), //单斧			
			
Array(2040802, 200, 1, 1), //手套敏捷卷轴10%
Array(2040804, 200, 1, 1), //手套攻击卷轴60%
Array(2040805, 200, 1, 1), //手套攻击卷轴10%
Array(2040808, 200, 1, 1), //手套敏捷诅咒卷轴70%
Array(2040809, 200, 1, 1), //手套敏捷诅咒卷轴30%
Array(2040810, 200, 1, 1), //手套攻击诅咒卷轴70%
Array(2040811, 200, 1, 1), //手套攻击诅咒卷轴30%
Array(2040814, 200, 1, 1), //手套魔力诅咒卷轴70%
Array(2040815, 200, 1, 1), //手套魔力诅咒卷轴30%
Array(2040816, 200, 1, 1), //手套魔力卷轴10%
Array(2040817, 200, 1, 1), //手套魔力卷轴60%
Array(2040819, 200, 1, 1), //手套敏捷卷轴65%
Array(2040820, 200, 1, 1), //手套敏捷卷轴15%
Array(2040821, 200, 1, 1), //手套攻击卷轴65%
Array(2040822, 200, 1, 1), //手套攻击卷轴15%
Array(2040906, 500, 1, 1), //盾牌运气卷轴70%
Array(2040907, 500, 1, 1), //盾牌运气卷轴30%
Array(2040914, 200, 1, 1), //盾牌攻击卷轴60%
Array(2040915, 200, 1, 1), //盾牌攻击卷轴10%
Array(2040916, 200, 1, 1), //盾牌攻击诅咒卷轴70%
Array(2040917, 200, 1, 1), //盾牌攻击诅咒卷轴30%
Array(2040919, 200, 1, 1), //盾牌魔力卷轴60%
Array(2040920, 200, 1, 1), //盾牌魔力卷轴10%
Array(2040921, 200, 1, 1), //盾牌魔力诅咒卷轴70%
Array(2040922, 200, 1, 1), //盾牌魔力诅咒卷轴30%
Array(2040924, 500, 1, 1), //盾牌运气卷轴60%
Array(2040925, 500, 1, 1), //盾牌运气卷轴10%
Array(2040930, 200, 1, 1), //盾牌力量卷轴70%
Array(2040931, 200, 1, 1), //盾牌力量卷轴60%
Array(2040932, 100, 1, 1), //盾牌力量卷轴30%
Array(2040933, 200, 1, 1), //盾牌力量卷轴10%
Array(2041201, 200, 1, 1), //项链运气卷轴10%
Array(2041202, 600, 1, 1), //项链运气卷轴60%
Array(2041204, 600, 1, 1), //项链运气诅咒卷轴30%
Array(2041205, 600, 1, 1), //项链运气诅咒卷轴70%
Array(2041206, 600, 1, 1), //项链力量卷轴10%
Array(2041207, 600, 1, 1), //项链力量卷轴60%
Array(2041209, 600, 1, 1), //项链力量诅咒卷轴30%
Array(2041210, 600, 1, 1), //项链力量诅咒卷轴70
Array(1002391, 200, 1, 1), //海盗头
Array(1002392, 200, 1, 1), //海盗头
Array(1002393, 200, 1, 1), //海盗头
Array(1002394, 50, 1, 1), //海盗头
Array(1002395, 100, 1, 1), //海盗头



Array(1002677, 130, 1, 1), //玩具匠人帽
Array(1002699, 130, 1, 1), //南瓜帽子
Array(1002773, 130, 1, 1), //金龙头盔
Array(1102040, 130, 1, 1), //浪人披风(黄)
Array(1102041, 100, 1, 1), //浪人披风(粉)
Array(1102042, 100, 1, 1), //浪人披风(紫)
Array(1102043, 300, 1, 1), //浪人披风(褐)
Array(1102140, 400, 1, 1), //卡帕莱特披风
Array(1102147, 420, 1, 1), //玩具匠人披风
Array(1102174, 400, 1, 1), //工作人员披风
Array(1102166, 400, 1,1), //枫叶披风
Array(1102167, 400, 1, 1), //枫叶披风
Array(1102168, 400, 1, 1), //枫叶披风
Array(1012158, 30, 1, 1)


);

function start() {
	if (cm.canHold(1002677,1) == false || cm.canHold(2290017,1) == false || cm.canHold(4001126,1) == false){
	cm.sendOk("请保证有充足的背包空间");
    cm.dispose();	
	}else{
    action(1, 0, 0);
}}

function action(mode, type, selection) {
    if (mode == 1) {
        status++;
    } else {
        if (status == 0) {
            cm.sendOk("再见得把油。");
            cm.dispose();
        }
        status--;
    }
		if (status == 0) {
			if(cm.haveItem(4001126,500)) {
var str1 = "\r\n";	
           for (var i = 0; i < itemList.length; i++){
                   str1 += "#v"+itemList[i][0]+"#";
            }
				cm.sendYesNo("消耗500个#v4001126#抽取以下物品!\r\n#k当前拥有:#c4001126# 个。 以下是全部物品:" + str1);
			} else {
var str1 = "\r\n";	
           for (var i = 0; i < itemList.length; i++){
                   str1 += "#v"+itemList[i][0]+"#";
            }
				cm.sendOk("消耗500个#v4001126#抽取以下物品!\r\n#k当前拥有:#c4001126# 个。 以下是全部物品:" + str1);
				cm.dispose();
			}
		} else if (status == 1){	
        var chance = Math.floor(Math.random() * 700);
        var finalitem = Array();
        for (var i = 0; i < itemList.length; i++) {
            if (itemList[i][1] >= chance) {
                finalitem.push(itemList[i]);
            }
        }
        if (finalitem.length != 0) {
            var item;
            var random = new java.util.Random();
            var finalchance = random.nextInt(finalitem.length);
            var itemId = finalitem[finalchance][0];
            var quantity = finalitem[finalchance][2];
            var notice = finalitem[finalchance][3];
            item = cm.gainGachaponItem(itemId, quantity, "初见枫叶抽奖", notice);
            if (item != -500) {
				//cm.setmoneyb(-5);
cm.gainItem(4001126, -500);//获得物品
                cm.sendOk("你获得了 #b#t" + item + "##k " + quantity + "个。");
            } else {
                cm.sendOk("请你确认在背包的装备，消耗，其他窗口中是否有一格以上的空间。");
            }
            cm.safeDispose();
        } else {
            cm.sendOk("怎么没接住球啊，算了还你宝石吧。");
           // cm.setmoneyb(-5);
//cm.gainItem(4170011, 5);//获得物品
			//cm.gainNX(1000);	//加减点券
            cm.safeDispose();
        }
    }
}
