var tz15 = "#fEffect/CharacterEff/1112949/0/0#";  //花样音符
var status = -1;
var itemList = Array(
        Array(1032041, 500, 1, 1), //枫叶型耳环
        Array(1032042, 500, 1, 1), //枫叶型耳环
        Array(1032047, 500, 1, 1), //可乐耳环
        Array(1032055, 500, 1, 1), //工作人员C的旧收信机
        Array(1032056, 500, 1, 1), //工作人员C的旧收信机
        Array(1032057, 500, 1, 1), //工作人员C的旧收信机
        Array(1032058, 500, 1, 1), //工作人员C钛质收信机
//-------帽子-------

        Array(1002393, 300, 1, 1), //海盗头巾(粉)
        Array(1002394, 300, 1, 1), //海盗头巾(灰)
        Array(1002619, 300, 1, 1), //兵长头巾
        Array(1002622, 300, 1, 1), //水兵帽
        Array(1002677, 50, 1, 1), //玩具匠人帽
        Array(1002699, 50, 1, 1), //南瓜帽子
        Array(1002773, 150, 1, 1), //金龙头盔
        Array(1002776, 120, 1, 1), //永恒冠军盔
        Array(1002777, 120, 1, 1), //永恒玄妙帽
        Array(1002778, 120, 1, 1), //永恒霓翎帽
        Array(1002779, 120, 1, 1), //永恒迷踪帽
        Array(1002780, 120, 1, 1), //永恒海王星
        Array(1002790, 120, 1, 1), //重生冠军盔
        Array(1002791, 120, 1, 1), //重生玄妙帽
        Array(1002792, 120, 1, 1), //重生霓翎帽
        Array(1002793, 120, 1, 1), //重生迷踪帽
        Array(1002794, 120, 1, 1), //重生海王星
//------披风------
        Array(1102048, 100, 1, 1), //公爵披风
        Array(1102140, 100, 1, 1), //卡帕莱特披风
        Array(1102147, 220, 1, 1), //玩具匠人披风
        Array(1102172, 30, 1, 1), //永恒不灭披风
        Array(1102174, 400, 1, 1), //工作人员披风
        Array(1102168, 400, 1, 1), //枫叶披风
//------手套------

        Array(1082144, 300, 1, 1), //幻光手套(红)
        Array(1082145, 100, 1, 1), //工地手套(黄)
        Array(1082146, 100, 1, 1), //工地手套(红)
        Array(1082147, 100, 1, 1), //工地手套(蓝)
        Array(1082148, 100, 1, 1), //工地手套(紫)
        Array(1082149, 100, 1, 1), //工地手套(褐)
        Array(1082150, 100, 1, 1), //工地手套(灰)
        Array(1082151, 350, 1, 0), //幻魔手套(绿)
        Array(1082159, 300, 1, 0), //蓝色条纹手套
        Array(1082160, 300, 1, 0), //绿色条纹手套
        Array(1082178, 300, 1, 0), //马绍尔手套(桃)
        Array(1082179, 300, 1, 0), //马绍尔手套(黄)
        Array(1082234, 120, 1, 1), //永恒定边手套
        Array(1082235, 120, 1, 1), //永恒逍遥手套
        Array(1082236, 120, 1, 1), //永恒白云手套
        Array(1082237, 120, 1, 1), //永恒探云手套
        Array(1082238, 120, 1, 1), //永恒抚浪手套
        Array(1082239, 120, 1, 1), //重生定边手套
        Array(1082240, 120, 1, 1), //重生逍遥手套
        Array(1082241, 120, 1, 1), //重生白云手套
        Array(1082242, 120, 1, 1), //重生探云手套
        Array(1082243, 120, 1, 1), //重生抚浪手套
//-------武器------
        Array(1302016, 300, 1, 1), //黄色雨伞
        Array(1302017, 300, 1, 1), //蓝色雨伞
        Array(1302018, 300, 1, 1), //汤勺
        Array(1302019, 300, 1, 1), //无名剑
        Array(1302020, 300, 1, 1), //枫叶战剑
        Array(1302021, 300, 1, 1), //橡皮榔头
        Array(1302022, 300, 1, 1), //竹刀
        Array(1302023, 300, 1, 1), //六脉神剑
        Array(1302024, 300, 1, 1), //废报纸卷
        Array(1302025, 300, 1, 1), //红雨伞
        Array(1302026, 300, 1, 1), //黑雨伞
        Array(1302027, 300, 1, 1), //绿雨伞
        Array(1302028, 300, 1, 1), //紫雨伞
        Array(1302029, 300, 1, 1), //褐雨伞
        Array(1302030, 300, 1, 1), //枫叶剑
        Array(1302031, 300, 1, 1), //七星剑
        Array(1302032, 300, 1, 1), //烈焰之剑
        Array(1302035, 300, 1, 1), //枫叶旗
        Array(1302036, 300, 1, 1), //枫叶旗
        Array(1302042, 300, 1, 1), //汤勺
        Array(1302043, 300, 1, 1), //战剑
        Array(1302044, 300, 1, 1), //树灵之剑
        Array(1302045, 300, 1, 1), //奇型刀
        Array(1302049, 300, 1, 1), //光线鞭子
        Array(1302050, 300, 1, 1), //战剑
        Array(1302051, 300, 1, 1), //树灵之剑
        Array(1302052, 300, 1, 1), //奇型刀
        Array(1302053, 300, 1, 1), //奇型刀
        Array(1302054, 300, 1, 1), //汤勺
        Array(1302056, 300, 1, 1), //一刀两断
        Array(1302058, 300, 1, 1), //冒险岛伞
        Array(1302059, 300, 1, 1), //狂龙闪电剑
        Array(1302060, 300, 1, 1), //战剑
        Array(1302061, 300, 1, 1), //蔓藤鞭子
        Array(1302063, 300, 1, 1), //燃烧的火焰刀
        Array(1302064, 300, 1, 1), //枫叶突击剑
        Array(1302066, 300, 1, 1), //枫叶3年旗
        Array(1302067, 300, 1, 1), //枫叶庆典旗
        Array(1302068, 300, 1, 1), //薄光刃
        Array(1302071, 300, 1, 1), //粉色花边游泳圈
        Array(1302077, 300, 1, 0), //新手战士之剑
        Array(1302080, 300, 1, 1) //七彩霓虹灯泡
        );

var itemList2 = Array(
        Array(1302081, 120, 1, 1), //永恒破甲剑
        Array(1302084, 240, 1, 1), //火柴
        Array(1302085, 240, 1, 1), //叉子
        Array(1302086, 100, 1, 1), //重生破甲剑
        Array(1302087, 300, 1, 1), //火炬
        Array(1302104, 300, 1, 1), //鱿鱼剑
        Array(1302105, 100, 1, 0), //圣诞六翼天使武器(单手剑)
        Array(1312032, 300, 1, 1), //枫叶破击斧
        Array(1312033, 300, 1, 1), //枫叶3年旗
        Array(1312034, 300, 1, 1), //粉色花边游泳圈
        Array(1312037, 100, 1, 1), //永恒断蚺斧
        Array(1312038, 100, 1, 1), //重生断蚺斧
        Array(1312039, 100, 1, 1), //圣诞六翼天使武器(单手斧)
        Array(1322005, 300, 1, 1), //棍棒
        Array(1322006, 300, 1, 1), //钢管
        Array(1322007, 300, 1, 1), //皮制手提包
        Array(1322008, 300, 1, 1), //007提包
        Array(1322009, 100, 1, 1), //马桶吸
        Array(1322010, 300, 1, 1), //方形铁铲
        Array(1322011, 300, 1, 1), //三角铁铲
        Array(1322012, 100, 1, 1), //红色砖头
        Array(1322021, 300, 1, 1), //黑游泳圈
        Array(1322051, 300, 1, 1), //七夕
        Array(1322052, 300, 1, 1), //狂龙地锤
        Array(1322054, 300, 1, 1), //枫叶地震锤
        Array(1322055, 300, 1, 1), //枫叶3年旗
        Array(1322056, 300, 1, 1), //粉色花边游泳圈
        Array(1322060, 100, 1, 1), //永恒惊破天
        Array(1322061, 100, 1, 1), //重生惊破天
        Array(1322065, 100, 1, 1), //圣诞六翼天使武器(单手钝器)
        Array(1322071, 300, 1, 1), //采矿铁锹
        Array(1332000, 300, 1, 1), //三角刃
        Array(1332046, 300, 1, 1), //凤凰刃
        Array(1332047, 300, 1, 1), //黑精灵拳刃
        Array(1332049, 300, 1, 1), //蝉翼龙牙破
        Array(1332050, 300, 1, 1), //半月龙鳞裂
        Array(1332051, 300, 1, 1), //黄金双牙钩
        Array(1332052, 300, 1, 1), //阴风碎魂刃
        Array(1332053, 300, 1, 1), //野外烧烤串
        Array(1332054, 300, 1, 1), //闪电飞刀
        Array(1332055, 300, 1, 1), //枫叶锁魄铗
        Array(1332056, 300, 1, 1), //枫叶追魂刺
        Array(1332057, 300, 1, 1), //枫叶3年旗
        Array(1332059, 300, 1, 1), //粉色花边游泳圈
        Array(1332063, 300, 1, 1), //初级盗贼的短剑
        Array(1332066, 300, 1, 1), //新手刮胡刀
        Array(1332073, 100, 1, 1), //永恒狂鲨锯
        Array(1332074, 100, 1, 1), //永恒断首刃
        Array(1332075, 100, 1, 1), //重生狂鲨锯
        Array(1332076, 100, 1, 1), //重生断首刃
        Array(1332081, 100, 1, 0), //圣诞六翼天使武器(短剑)
        Array(1372008, 300, 1, 0), //金属短杖
        Array(1372030, 300, 1, 0), //天使之翼
        Array(1372031, 300, 1, 1), //圣贤短杖
        Array(1372032, 300, 1, 1), //佘太君龙杖
        Array(1372033, 300, 1, 1), //圣贤短杖
        Array(1372034, 300, 1, 0), //枫叶仙姬杖
        Array(1372035, 300, 1, 1), //火灵珠短杖
        Array(1372036, 300, 1, 1), //毒灵珠短杖
        Array(1372037, 300, 1, 1), //冰灵珠短杖
        Array(1372038, 300, 1, 1), //雷灵珠短杖
        Array(1372039, 100, 1, 1), //爆炎之杖
        Array(1372040, 100, 1, 1), //剧毒之杖
        Array(1372041, 100, 1, 1), //寒冰之杖
        Array(1372042, 100, 1, 1), //狂雷之杖
        Array(1372043, 300, 1, 0), //初级魔法师的杖
        Array(1372044, 100, 1, 1), //永恒蝶翼杖
        Array(1372045, 100, 1, 1), //重生蝶翼杖
        Array(1372046, 100, 1, 0), //圣诞六翼天使武器(短杖)
        Array(1382000, 300, 1, 0), //木制长杖
        Array(1382001, 300, 1, 0), //精灵长杖
        Array(1382002, 300, 1, 0), //法师长杖
        Array(1382003, 300, 1, 0), //蓝宝石长杖
        Array(1382012, 300, 1, 0), //枫叶杖
        Array(1382013, 300, 1, 0), //烈焰之杖
        Array(1382014, 300, 1, 0), //孙家之杖
        Array(1382015, 50, 1, 1), //毒蘑菇
        Array(1382016, 50, 1, 1), //香菇
        Array(1382042, 300, 1, 0), //粉色花边游泳圈
        Array(1402014, 50, 1, 1), //温度计
        Array(1402015, 300, 1, 1), //亚历山大之剑
        Array(1402019, 300, 1, 1), //大刀
        Array(1402034, 300, 1, 1), //亚历山大之剑
        Array(1402035, 300, 1, 1), //斩天刀
        Array(1402036, 300, 1, 1), //飞龙巨剑
        Array(1402037, 100, 1, 1), //龙背刃
        Array(1402039, 300, 1, 1), //枫叶枭首剑
        Array(1402040, 300, 1, 1), //枫叶3年旗
        Array(1402041, 300, 1, 1), //粉色花边游泳圈
        Array(1402044, 300, 1, 1), //南瓜灯笼
        Array(1402046, 100, 1, 1), //永恒玄冥剑
        Array(1402047, 100, 1, 1), //重生玄冥剑
        Array(1402053, 100, 1, 1), //圣诞六翼天使武器(双手剑)
        Array(1412000, 300, 1, 1), //双手斧
        Array(1412024, 300, 1, 1), //雷电斧
        Array(1412025, 300, 1, 1), //大力神之斧
        Array(1412026, 300, 1, 1), //炼狱魔龙斧
        Array(1412027, 300, 1, 1), //枫叶乾坤轮
        Array(1412028, 300, 1, 1), //枫叶3年旗
        Array(1412029, 300, 1, 1), //粉色花边游泳圈
        Array(1412033, 100, 1, 1) //永恒碎鼋斧
        );

var itemList3 = Array(
        Array(1412034, 100, 1, 1), //重生碎鼋斧
        Array(1412035, 100, 1, 1), //圣诞六翼天使武器(双手斧)
        Array(1422004, 300, 1, 1), //板手
        Array(1422030, 100, 1, 1), //粉红海豹抱枕
        Array(1422031, 100, 1, 1), //蓝色海豹抱枕
        Array(1422032, 300, 1, 1), //枫叶3年旗
        Array(1422033, 300, 1, 1), //粉色花边游泳圈
        Array(1422036, 300, 1, 1), //玩具匠人的锤子
        Array(1422037, 100, 1, 1), //永恒威震天
        Array(1422038, 100, 1, 1), //重生威震天
        Array(1432009, 300, 1, 1), //木精灵枪
        Array(1432015, 300, 1, 1), //红色滑雪板
        Array(1432016, 300, 1, 1), //橙色滑雪板
        Array(1432017, 300, 1, 1), //绿色滑雪板
        Array(1432018, 300, 1, 1), //蓝色滑雪板
        Array(1432030, 300, 1, 1), //红莲落神枪
        Array(1432034, 300, 1, 1), //银龙枪
        Array(1432035, 300, 1, 1), //奥丁手戟
        Array(1432037, 300, 1, 1), //枫叶大将旗
        Array(1432038, 30, 1, 1), //盘龙七冲枪
        Array(1432039, 300, 1, 1), //钓鱼竿
        Array(1432040, 300, 1, 1), //枫叶钻天枪
        Array(1432041, 300, 1, 1), //枫叶3年旗
        Array(1432042, 300, 1, 1), //粉色花边游泳圈
        Array(1432046, 50, 1, 0), //圣诞树手杖
        Array(1432047, 20, 1, 1), //永恒显圣枪
        Array(1432048, 300, 1, 0), //铲子
        Array(1432049, 50, 1, 1), //重生显圣枪
        Array(1432050, 50, 1, 0), //圣诞六翼天使武器(枪)
        Array(1442012, 300, 1, 1), //天空雪板
        Array(1442013, 300, 1, 1), //沧海雪板
        Array(1442014, 300, 1, 1), //银雪板
        Array(1442015, 300, 1, 1), //黄金雪板
        Array(1442016, 300, 1, 1), //黑雪板
        Array(1442017, 300, 1, 1), //赤血雪板
        Array(1442018, 50, 1, 1), //冻冻鱼
        Array(1442019, 300, 1, 1), //月神刀
        Array(1442026, 300, 1, 1), //红色冲浪板
        Array(1442027, 300, 1, 1), //绿色冲浪板
        Array(1442028, 300, 1, 1), //蓝色冲浪板
        Array(1442029, 300, 1, 1), //紫色冲浪板
        Array(1442030, 300, 1, 1), //枫之雪板
        Array(1442044, 300, 1, 1), //战魂斗杀戟
        Array(1442045, 300, 1, 1), //血龙神斧
        Array(1442046, 300, 1, 1), //超级滑雪板
        Array(1442051, 300, 1, 1), //枫叶强袭斧
        Array(1442052, 300, 1, 1), //枫叶3年旗
        Array(1442053, 300, 1, 1), //粉色花边游泳圈
        Array(1442054, 300, 1, 1), //红色滑水板
        Array(1442055, 300, 1, 1), //绿色滑水板
        Array(1442056, 300, 1, 1), //蓝色滑水板
        Array(1442057, 300, 1, 1), //紫色滑水板
        Array(1442063, 20, 1, 1), //永恒神光戟
        Array(1442065, 300, 1, 1), //蓝色冲浪板
        Array(1442066, 300, 1, 1), //红色冲浪板
        Array(1442067, 20, 1, 1), //重生神光戟
        Array(1442069, 300, 1, 1), //红色冲浪板
        Array(1442070, 300, 1, 1), //绿色冲浪板
        Array(1442071, 50, 1, 1), //圣诞六翼天使武器(矛)
        Array(1452000, 300, 1, 0), //战斗弓
        Array(1452025, 300, 1, 1), //蓝色梅杜斯
        Array(1452026, 300, 1, 1), //黑色梅杜斯
        Array(1452044, 300, 1, 1), //金龙振翅弓
        Array(1452045, 300, 1, 0), //枫叶HAPPY弓
        Array(1452057, 20, 1, 1), //永恒惊电弓
        Array(1452059, 20, 1, 1), //重生惊电弓
        Array(1452062, 50, 1, 0), //圣诞六翼天使武器(弓)
        Array(1522013, 300, 1, 1), //翻天弩 - \n只能使用专用卷轴
        Array(1522014, 300, 1, 1), //金龙弩枪 - (无描述)
        Array(1462050, 20, 1, 1), //永恒冥雷弩
        Array(1522015, 20, 1, 1), //永恒鲜花弩枪
        Array(1462051, 50, 1, 1), //重生冥雷弩
        Array(1472049, 300, 1, 1), //龙之拳
        Array(1472051, 300, 1, 1), //寒木升龙拳
        Array(1472052, 300, 1, 1), //碧水落龙拳
        Array(1472053, 300, 1, 1), //逆龙咆哮拳
        Array(1472068, 50, 1, 1), //永恒大悲赋
        Array(1472071, 50, 1, 1), //重生大悲赋
        Array(1472077, 50, 1, 0), //圣诞六翼天使武器(拳套)
        Array(1472500, 300, 1, 1), //黄铜拳套
        Array(1482000, 300, 1, 1), //指套
        Array(1482001, 300, 1, 1), //拳甲
        Array(1482002, 300, 1, 1), //格斗指虎
        Array(1482003, 300, 1, 1), //三日月冲拳
        Array(1482004, 300, 1, 1), //全覆式拳甲
        Array(1482005, 300, 1, 1), //双翼拳甲
        Array(1482006, 300, 1, 1), //刺棘拳甲
        Array(1482007, 300, 1, 1), //蛇吻
        Array(1482008, 300, 1, 1), //列翼拳甲
        Array(1482009, 300, 1, 0), //强袭拳甲
        Array(1482023, 20, 1, 1), //永恒孔雀翎
        Array(1482024, 20, 1, 1) //重生孔雀翎
        );

var itemList4 = Array(
        Array(1482025, 300, 1, 1), //粉色花边游泳圈
        Array(1482029, 50, 1, 1), //圣诞六翼天使武器(指节)
        Array(1482030, 300, 1, 1), //枫叶3年旗
        Array(1492000, 300, 1, 1), //短枪
        Array(1492001, 300, 1, 1), //单发手铳
        Array(1492002, 300, 1, 1), //大型手铳
        Array(1492003, 300, 1, 1), //突击手铳
        Array(1492004, 300, 1, 1), //银枪
        Array(1492005, 300, 1, 1), //红杰克
        Array(1492006, 300, 1, 1), //黑郁金香
        Array(1492007, 300, 1, 1), //金钱豹
        Array(1492008, 300, 1, 1), //速射手铳
        Array(1492026, 300, 1, 1), //粉色花边游泳圈
        Array(1492030, 50, 1, 0), //圣诞六翼天使武器(手枪)
        Array(1492034, 300, 1, 0), //枫叶3年旗
        Array(1302073, 300, 1, 1), //新加坡国旗（初学者）
        Array(1302074, 300, 1, 1), //马来西亚国旗（初学者）
        Array(1302075, 300, 1, 1), //新加坡国旗（单手剑）
        Array(1302076, 300, 1, 1), //马来西亚国旗（单手剑）
        Array(1312035, 300, 1, 1), //新加坡国旗（单手斧）
        Array(1312036, 300, 1, 1), //马来西亚国旗（单手斧）
        Array(1322057, 300, 1, 1), //新加坡国旗（单手杖）
        Array(1322058, 300, 1, 1), //马来西亚国旗（单手杖）
        Array(1332060, 300, 1, 1), //新加坡国旗（短剑）
        Array(1332061, 300, 1, 1), //马来西亚国旗（短剑）
        Array(1382043, 300, 1, 1), //新加坡国旗（长杖）
        Array(1382044, 300, 1, 1), //马来西亚国旗（长杖）
        Array(1402042, 300, 1, 1), //新加坡国旗（双手剑）
        Array(1412030, 300, 1, 1), //新加坡国旗（双手斧）
        Array(1412031, 300, 1, 1), //马来西亚国旗（双手斧）
        Array(1422034, 300, 1, 1), //新加坡国旗（双手杖）
        Array(1432043, 300, 1, 1), //新加坡国旗（枪）
        Array(1432044, 300, 1, 1), //马来西亚国旗（枪）
        Array(1442058, 300, 1, 1), //新加坡国旗（矛）
        Array(1452049, 300, 1, 1), //新加坡国旗（弓）
        Array(1452050, 300, 1, 1), //马来西亚国旗（弓）
        Array(1462044, 300, 1, 1), //新加坡国旗（弩）
        Array(1462045, 300, 1, 1), //马来西亚国旗（弩）
        Array(1472059, 300, 1, 1), //新加坡国旗（指节）
        Array(1472060, 300, 1, 1), //马来西亚国旗（指节）
//------药水------
        Array(2000004, 500, 20, 0), //特殊药水
        Array(2000005, 500, 20, 0), //超级药水
        Array(1492047, 100, 1, 1), //幽暗鸦之铳	
        Array(2000005, 500, 30, 0), //超级药水
        Array(2022245, 500, 5, 0), //心跳停止糖
        Array(2049004, 200, 1, 1), //白医卷轴10%
        Array(2049005, 100, 1, 1), //白医卷轴20%
        Array(1382013, 200, 1, 1), //烈焰之杖
        Array(1382015, 100, 1, 1), //毒蘑菇
        Array(1382037, 140, 1, 1), //偃月之杖		
        Array(1472072, 140, 1, 1), //幽暗鸦之爪
        Array(1462053, 140, 1, 1), //幽暗鸦之瞳
        Array(1402049, 140, 1, 1), //幽暗鸦之翼
        Array(1332077, 140, 1, 1), //幽暗鸦之喙
        Array(1002894, 100, 1, 1), //粉色编织发带
        Array(1002895, 100, 1, 1), //红色编织发带
        Array(1002896, 30, 1, 1), //紫色编织发带
        Array(1002897, 140, 1, 1), //橙色编织发带
        Array(1002898, 140, 1, 1), //绿色编织发带
        Array(1002899, 140, 1, 1), //黄色编织发带
        Array(1002900, 140, 1, 1), //蓝色编织发带
        Array(1002914, 100, 1, 1), //盖福克斯的帽子(力量)
        Array(1002915, 100, 1, 1), //盖福克斯的帽子(敏捷)
        Array(1002916, 100, 1, 1), //盖福克斯的帽子(智力)
        Array(1002917, 100, 1, 1), //盖福克斯的帽子(幸运)
        Array(1132000, 200, 1, 1), //白色腰带
        Array(1132001, 200, 1, 1), //黄色腰带
        Array(1132002, 200, 1, 1), //蓝色腰带
        Array(1132003, 200, 1, 1), //红色腰带
        Array(1132004, 250, 1, 1), //黑贺腰带
        Array(1132010, 200, 1, 1), //黄金猪猪腰带
        Array(1132011, 100, 1, 1), //黄金猪猪腰带
        Array(1132012, 100, 1, 1), //法老的腰带
        Array(1132013, 100, 1, 1), //不灭的法老腰带
        Array(1012011, 100, 1, 1), //圣诞鹿的鼻子
        Array(1012012, 100, 1, 1), //圣诞鹿的鼻子
        Array(1012013, 100, 1, 1), //圣诞鹿的鼻子
        Array(1012019, 100, 1, 1), //圣诞鹿的鼻子
        Array(1012020, 100, 1, 1), //圣诞鹿的鼻子
        Array(1012056, 100, 1, 1), //狗狗鼻
        Array(1012058, 100, 1, 1), //匹诺曹的鼻子
        Array(1012059, 100, 1, 1), //匹诺曹的鼻子
        Array(1012060, 100, 1, 1), //匹诺曹的鼻子
        Array(1012061, 100, 1, 1), //匹诺曹的鼻子
        Array(2101001, 100, 1, 1), //蝙蝠魔召唤
        Array(2100902, 100, 1, 1), //神秘召唤包
        Array(2101004, 100, 1, 1), //绿水灵王召唤
        Array(2040044, 500, 1, 1), //头盔敏捷卷轴15%
        Array(2040100, 500, 1, 0), //脸部装饰生命卷轴10%
        Array(2040105, 500, 1, 1), //脸部装饰回避率卷轴10%
        Array(2040106, 500, 1, 0), //脸部装饰回避率卷轴60%
        Array(2040108, 500, 1, 0), //脸部装饰回避率诅咒卷轴30%
        Array(2040109, 500, 1, 0), //脸部装饰回避率诅咒卷轴70%
        Array(2040200, 200, 1, 1), //眼部装饰命中率卷轴10%
        Array(2040201, 200, 1, 1), //眼部装饰命中率卷轴60%
        Array(2040203, 200, 1, 1), //眼部装饰命中率诅咒卷轴30%
        Array(2040307, 200, 1, 0), //耳环敏捷卷轴30%
        Array(2040308, 500, 1, 0), //耳环防御力诅咒卷轴70%
        Array(2040313, 100, 1, 1), //耳环智力卷轴65%
        Array(2040314, 200, 1, 1), //耳环智力卷轴15%
        Array(2040316, 100, 1, 0), //耳环敏捷卷轴100%
        Array(2040317, 100, 1, 0) //耳环敏捷卷轴60%
        );

var itemList5 = Array(
        Array(2040527, 400, 1, 0), //全身盔甲智力卷轴15%
        Array(2040528, 300, 1, 0), //全身盔甲幸运卷轴65%
        Array(2040529, 400, 1, 0), //全身盔甲幸运卷轴15%
        Array(2040530, 500, 1, 0), //全身盔甲力量卷轴100%
        Array(2040541, 500, 1, 1), //全身盔甲力量卷轴15%
        Array(2040600, 500, 1, 0), //裤/裙防御卷轴100%
        Array(2040727, 500, 1, 0), //鞋子防滑卷轴10%
        Array(2040800, 300, 1, 1), //手套敏捷卷轴100%
        Array(2040801, 400, 1, 1), //手套敏捷卷轴60%
        Array(2040802, 300, 1, 1), //手套敏捷卷轴10%
        Array(2040803, 100, 1, 1), //手套攻击卷轴100%
        Array(2040804, 400, 1, 1), //手套攻击卷轴60%
        Array(2041108, 300, 1, 1), //戒指敏捷卷轴10%
        Array(2041111, 300, 1, 1), //戒指运气卷轴10%
        Array(2041201, 300, 1, 1), //项链运气卷轴10%
        Array(2041314, 300, 1, 1), //腰带智力卷轴70%
        Array(2041315, 300, 1, 1), //腰带智力卷轴30%
        Array(2041316, 300, 1, 1), //腰带敏捷卷轴70%
        Array(2041317, 300, 1, 1), //腰带敏捷卷轴30%
        Array(2041318, 300, 1, 1), //腰带运气卷轴70%
        Array(2041319, 300, 1, 1), //腰带运气卷轴30%
        Array(2043000, 300, 1, 1), //单手剑攻击卷轴100%
        Array(2043001, 300, 1, 1), //单手剑攻击卷轴60%
        Array(2043002, 300, 1, 1), //单手剑攻击卷轴10%
        Array(2043004, 300, 1, 1), //单手剑攻击诅咒卷轴70%
        Array(2043005, 300, 1, 1), //单手剑攻击诅咒卷轴30%
        Array(2043306, 400, 1, 1), //短剑攻击卷轴65%
        Array(2043307, 400, 1, 1), //短剑攻击卷轴15%
        Array(2043700, 400, 1, 1), //短杖魔力卷轴100%
        Array(2044218, 300, 1, 1), //单手钝器命中卷轴65%
        Array(2044219, 300, 1, 1), //单手钝器命中卷轴15%
        Array(2044300, 300, 1, 1), //枪攻击卷轴100%
        Array(2044301, 300, 1, 1), //枪攻击卷轴60%
        Array(2044302, 300, 1, 1), //枪攻击卷轴10%
        Array(2044304, 300, 1, 1), //枪攻击诅咒卷轴70%
        Array(2044305, 300, 1, 1), //枪攻击诅咒卷轴30%
        Array(2044306, 300, 1, 1), //枪攻击卷轴65%
        Array(2044802, 300, 1, 1), //拳甲攻击卷轴10%
        Array(2044803, 300, 1, 1), //拳甲攻击卷轴70%
        Array(2044804, 300, 1, 1), //拳甲攻击卷轴30%
        Array(2044805, 300, 1, 1), //拳甲命中率卷轴100%
        Array(2044806, 300, 1, 1), //拳甲命中率卷轴70%
        Array(2044807, 300, 1, 1), //拳甲命中率卷轴60%
        Array(2044904, 300, 1, 1), //短枪攻击卷轴30%
        Array(2044906, 300, 1, 1), //短枪攻击卷轴65%
        Array(2044907, 300, 1, 1), //短枪攻击卷轴15%
        Array(2049100, 300, 1, 1), //混沌卷轴60%
        Array(2049200, 500, 1, 1), //配饰力量卷轴70%
        Array(2049201, 500, 1, 1), //配饰力量卷轴30%
        Array(2049202, 500, 1, 1), //配饰敏捷卷轴70%
        Array(2049203, 500, 1, 1), //配饰敏捷卷轴30%
        Array(2049204, 500, 1, 1), //配饰智力卷轴70%
        Array(2049205, 500, 1, 1), //配饰智力卷轴30%
        Array(2049206, 500, 1, 1), //配饰幸运卷轴70%
        Array(2049207, 500, 1, 1), //配饰幸运卷轴30%
        Array(2049208, 500, 1, 1), //配饰HP卷轴70%
        Array(2049209, 500, 1, 1), //配饰HP卷轴30%
        Array(2049210, 500, 1, 1), //配饰MP卷轴70%
        Array(2049211, 500, 1, 1), //配饰MP卷轴30%
        Array(2101001, 500, 1, 1), //蝙蝠魔召唤
        Array(2100902, 500, 1, 1), //神秘召唤包
        Array(2101004, 500, 1, 1), //绿水灵王召唤
        Array(1012011, 500, 1, 1), //圣诞鹿的鼻子
        Array(1012012, 500, 1, 1), //圣诞鹿的鼻子
        Array(1012013, 500, 1, 1), //圣诞鹿的鼻子
        Array(1012018, 500, 1, 1), //圣诞鹿的鼻子
        Array(1012019, 500, 1, 1), //圣诞鹿的鼻子
        Array(1012020, 500, 1, 1), //圣诞鹿的鼻子
        Array(1012056, 500, 1, 1), //狗狗鼻
        Array(1012058, 500, 1, 1), //匹诺曹的鼻子
        Array(1012061, 500, 1, 1), //匹诺曹的鼻子
        Array(1032026, 100, 1, 1), //黄水晶耳环
        Array(1032027, 100, 1, 1), //黑水晶耳环
        Array(1032028, 100, 1, 1), //红水晶耳环
        Array(1032030, 200, 1, 1), //勇气耳环
        Array(1032031, 200, 1, 1), //永恒金盾坠
        Array(1032032, 500, 1, 1), //秋叶耳环
        Array(1032035, 500, 1, 1), //枫叶耳环
        Array(1032040, 500, 1, 1), //枫叶型耳环,800,1,0), //初
        Array(1032041, 500, 1, 1), //枫叶型耳环,800,1,0), //庆
        Array(1032042, 500, 1, 1), //枫叶型耳环,800,1,0), //盛
        Array(1032055, 500, 1, 1), //工作人员C的旧收信机
        Array(1032056, 500, 1, 1), //工作人员C的旧收信机
        Array(1032057, 500, 1, 0), //工作人员C的旧收信机
        Array(1032058, 500, 1, 0), //工作人员C钛质收信机
        Array(1122001, 500, 1, 1), //绿色蝶形领结
        Array(1122002, 500, 1, 1), //红色蝶形领结
        Array(1122003, 500, 1, 1), //黄色蝶形领结
        Array(1122004, 500, 1, 1), //粉红蝶形领结
        Array(1122005, 500, 1, 1), //黑色蝶形领结
        Array(1122006, 500, 1, 1), //蓝色蝶形领结
        Array(1122015, 500, 1, 1), //枫叶围巾
        Array(1122058, 100, 1, 1), //休彼德蔓的混沌项链
        Array(1132000, 500, 1, 1), //白色腰带
        Array(1132001, 500, 1, 1), //黄色腰带
        Array(1132002, 500, 1, 1), //蓝色腰带
        Array(1132003, 500, 1, 1), //红色腰带
        Array(1132004, 450, 1, 1), //黑贺腰带
        Array(1132010, 500, 1, 1), //黄金猪猪腰带
        Array(1132011, 500, 1, 1), //黄金猪猪腰带
        Array(1132012, 500, 1, 1), //法老的腰带
        Array(1132013, 500, 1, 1), //不灭的法老腰带
        Array(1122074, 500, 1, 1), //枫叶吊坠
        Array(1122075, 500, 1, 1), //黄金枫叶魔法吊坠
        Array(1002390, 500, 1, 1), //真扎昆头盔
        Array(1002391, 500, 1, 0) //海盗头巾(绿)
        );

var itemList6 = Array(
//-----椅子-----
        Array(3010013, 250, 1, 1), //悠长假期
        Array(3010014, 250, 1, 1), //月亮弯
        Array(3010018, 250, 1, 1), //椰子树沙滩椅
        Array(3010019, 250, 1, 1), //寿司椅
        Array(3010021, 250, 1, 1), //暖暖桌
        Array(3010025, 250, 1, 1), //枫叶纪念凳
        Array(3010028, 250, 1, 1), //海盗的俘虏
        Array(3010029, 250, 1, 1), //蓝环凳
        Array(3010030, 250, 1, 1), //黑环凳
        Array(3010031, 250, 1, 1), //红环凳
        Array(3010032, 250, 1, 1), //黄环凳
        Array(3010033, 250, 1, 1), //绿环凳
        Array(3010037, 250, 1, 1), //猪猪凳
        Array(3010044, 100, 1, 1), //同一红伞下
        Array(3012001, 150, 1, 1), //篝火
        Array(3012002, 150, 1, 1), //浴桶
        Array(3010073, 150, 1, 1), //PB克缤
        Array(3012003, 150, 1, 1), //爱心椅子
        Array(3010012, 150, 1, 1), //剑士 宝座
        Array(3010025, 50, 1, 1), //枫叶纪念凳
        Array(3010037, 150, 1, 1), //猪猪凳
        Array(3010038, 150, 1, 1), //爱心椅子
        Array(3010040, 50, 1, 1), //蝙蝠椅
        Array(3010041, 150, 1, 1), //骷髅王座
        Array(3010043, 150, 1, 1), //魔女的飞扫把
        Array(3010044, 150, 1, 1), //同一红伞下
        Array(3010045, 150, 1, 1), //寒冰椅子
        Array(3010046, 150, 1, 1), //红龙椅
        Array(3010047, 100, 1, 1), //蓝龙椅
        Array(3010048, 100, 1, 1), //圣诞树椅子
        Array(3010049, 100, 1, 1), //雪房子
        Array(3010050, 100, 1, 1), //公主凳
        Array(3010057, 100, 1, 1), //血色玫瑰
        Array(3010058, 100, 1, 1), //世界末日
        Array(3010068, 100, 1, 1), //露水椅子
        Array(3010070, 150, 1, 1), //巨无霸品克缤
        Array(3010071, 125, 1, 1), //神兽椅
        Array(3010077, 125, 1, 1), //猫头鹰椅子
        Array(3010085, 125, 1, 1), //鬼娃娃椅子
        Array(3010096, 125, 1, 1), //恐龙化石宝座
        Array(3010095, 125, 1, 1), //石头人座椅
        Array(3010094, 115, 1, 1), //漂漂猪椅子
        Array(3010098, 125, 1, 1), //电视宅人
        Array(3010106, 125, 1, 1), //雪狼战椅
        Array(3010112, 125, 1, 1), //情书柜子
        Array(3010117, 125, 1, 1), //魔法书椅子
        Array(3010119, 125, 1, 1), //羊羊椅子
        Array(3010120, 125, 1, 1), //彩蛋篮子
        Array(3010123, 125, 1, 1), //夏日花朵
        Array(3010124, 125, 1, 1), //都纳斯喷气椅子
        Array(3010125, 125, 1, 1), //尼贝隆战舰椅
        Array(3010127, 125, 1, 1), //扎昆宝座
        Array(3012001, 125, 1, 0), //篝火
        Array(3010136, 150, 1, 1), //6周年怪物王座
        Array(3010155, 150 * 2, 1, 1), //暗影双刀的猫头鹰椅子
        Array(3010144, 150 * 2, 1, 1), //七夕椅子
        Array(3010149, 150 * 2, 1, 1), //猫咪风扇椅
        Array(3010129, 150 * 2, 1, 1), //酋长宝座
        Array(3010131, 150 * 2, 1, 1), //贪吃熊猫椅
        Array(3010132, 150 * 2, 1, 1), //撒娇喵咪椅
        Array(3010133, 150 * 2, 1, 1), //帐篷椅
        Array(3010163, 150 * 2, 1, 1), //满月椅
// ------ 特殊奖品 --------------
//Array(4000385, 900, 1, 1), //心灯
//Array(4001465, 800, 20, 1), //爱心宝石
//Array(4110000, 700, 1, 1), //迷你抽奖用
// ------ 086添加 ------
        Array(1112915, 100, 1, 1), //蓝调戒指
        Array(1102723, 30, 1, 1), //光明天使羽翼
        Array(2041122, 200, 1, 1), //欢乐卷轴
        Array(2041123, 200, 1, 1), //欢乐卷轴
        Array(2041124, 500, 1, 1), //欢乐卷轴
        Array(2041131, 500, 1, 1), //欢乐卷轴
        Array(2430182, 300, 1, 1), //特别美容券
        Array(2049401, 500, 1, 1), //潜能附加卷轴
        Array(2049301, 500, 1, 1), //装备强化卷轴
        Array(1102730, 100, 1, 1), //浓翅膀
        Array(1012172, 100, 1, 1), //娃娃脸
        Array(1402014, 100, 1, 1), //温度计
        Array(4000313, 200, 1, 1), //黄金叶子
        Array(2431944, 50, 1, 1), //140
        Array(2431945, 50, 1, 1), //140
        Array(3015002, 50, 1, 1), //七彩摩天轮
        Array(1003422, 80, 1, 1), //石榴石渡鸦面具
//Array(3015002, 80, 1, 1), //黄金叶子
        Array(1003422, 100, 1, 1) //秘密能手册

        );


function action(mode, type, selection) {
    if (mode == 1) {
        status++;
    } else {
        if (status == 0) {
            cm.sendOk("不想使用吗？…我的肚子里有各类#b奇特座椅或卷轴、装备、新奇道具#k哦！");
            cm.dispose();
        }
        status--;
    }
    if (status == 0) {
        if (cm.haveItem(5220040)) {
            cm.sendYesNo("            #e" + tz15 + "#r『高级转蛋机』 " + tz15 + "\r\n#k使用“#b1个#t5220040##k”就可以交换. 游戏商城中的“其他”－“游戏”区里有噢。\r\n#d比普通转蛋机的几率要高200% #k现在要玩转蛋机么?\r\n———————————————————————— \r\n");
        } else {
            cm.sendOk("            #e" + tz15 + "#r『高级转蛋机』 " + tz15 + "\r\n#k使用“#b1个#t5220040##k”就可以交换. 游戏商城中的“其他”－“游戏”区里有噢。\r\n#d比普通转蛋机的几率要高200% #k现在要玩转蛋机么?\r\n———————————————————————— \r\n你背包里好像没有#b#t5220040##k哦!请进商城或通过其他活动获得!");
            cm.safeDispose();
        }
    } else if (status == 1) {
        var chance = Math.floor(Math.random() * 800);
        var finalitem = Array();
        for (var i = 0; i < itemList.length; i++) {
            if (itemList[i][1] >= chance) {
                finalitem.push(itemList[i]);
            }
        }
        for (var i = 0; i < itemList2.length; i++) {
            if (itemList2[i][1] >= chance) {
                finalitem.push(itemList2[i]);
            }
        }
        for (var i = 0; i < itemList3.length; i++) {
            if (itemList3[i][1] >= chance) {
                finalitem.push(itemList3[i]);
            }
        }
        for (var i = 0; i < itemList4.length; i++) {
            if (itemList4[i][1] >= chance) {
                finalitem.push(itemList4[i]);
            }
        }
        for (var i = 0; i < itemList5.length; i++) {
            if (itemList5[i][1] >= chance) {
                finalitem.push(itemList5[i]);
            }
        }
        for (var i = 0; i < itemList6.length; i++) {
            if (itemList6[i][1] >= chance) {
                finalitem.push(itemList6[i]);
            }
        }
        if (finalitem.length != 0) {
            var random = new java.util.Random();
            var finalchance = random.nextInt(finalitem.length);
            var itemId = finalitem[finalchance][0];
            var quantity = finalitem[finalchance][2];
            var notice = finalitem[finalchance][3];
            if (cm.haveItem(5220040) && cm.canHold()) {
                if (notice == 1) {
                    cm.gainGachaponItem(itemId, quantity, "高级转蛋机");
                } else {
                    cm.gainItem(itemId, quantity);
                }
                cm.gainItem(5220040, -1);
                cm.sendOk("你获得了 #b#t" + itemId + "##k " + quantity + "个。");
            } else {
                cm.sendOk("你确实有#b#t5220040##k吗？如果是，请你确认在背包的装备，消耗，其他窗口中是否有一格以上的空间。");
            }
            cm.safeDispose();
        } else {
            cm.sendOk("#r(获得了安慰奖：星星 20 个。)\r\n今天的运气可真差，什么都没有拿到。");
            cm.gainItem(5220040, -1);
            cm.gainItem(4001839, 20);
            cm.safeDispose();
        }
    } else {
        cm.dispose();
    }
}




















/*function start() {
 status = -1;
 cm.sendSimple("冒险岛转蛋机中有各类#b装备、卷轴或稀有新奇的道具#k噢！使用“#b#t5220040##k”就可以交换. 游戏商城中的“其他”－“游戏”区里有噢。 假如不买转蛋券的话，是不可以使用我的。现在要玩转蛋机么？\r\n你可以选择以下转蛋机哦\r\n#L0##p9330112#\r\n#L1##p9330113#\r\n#L2##p9330114#\r\n#L3##p9330115#\r\n#L4##p9330116#\r\n#L6##p9330118#\r\n");
 }
 
 
 function action(mode, type, selection) {
 
 if (mode == 1) {
 status++;
 } else {
 if (status == 0) {
 cm.sendOk("不想使用吗？…我的肚子里有各类#b奇特座椅或卷轴、装备、新奇道具#k哦！");
 cm.dispose();
 }
 status--;
 }
 
 if (status == 0) {
 //cm.sendOk("在冒险岛生活还愉快吗？");
 //cm.dispose();
 cm.dispose();
 cm.openNpc(9330112+selection,null);
 return;
 
 
 }
 cm.dispose();
 }*/
