status = -1;
var itemList = Array(
Array(2101001, 100, 1, 0), //蝙蝠魔召唤
Array(2100902, 100, 1, 0), //神秘召唤包
Array(2101004, 100, 1, 0), //绿水灵王召唤
Array(2045200, 500, 1, 0), //双弩枪攻击力卷轴
Array(2045201, 500, 1, 0), //双弩枪攻击力卷轴
Array(2045202, 500, 1, 0), //双弩枪攻击力卷轴
Array(2045203, 500, 1, 0), //双弩枪攻击力卷轴
Array(2045204, 500, 1, 0), //双弩枪攻击力卷轴
Array(2045205, 500, 1, 0), //双弩枪攻击力卷轴
Array(2045206, 500, 1, 0), //双弩枪攻击力卷轴
Array(2045208, 500, 1, 0), //双弩枪攻击力卷轴
Array(2043400, 500, 1, 0), //刀攻击力卷轴 100%
Array(2043401, 500, 1, 0), //刀攻击力卷轴 60% 
Array(2043402, 500, 1, 0), //刀攻击力卷轴 10%
Array(2043403, 500, 1, 0), //刀攻击力卷轴
Array(2043000, 300, 1, 0), //单手剑攻击卷轴100%
Array(2043001, 300, 1, 0), //单手剑攻击卷轴60%
Array(2043002, 300, 1, 0), //单手剑攻击卷轴10%
Array(2043004, 300, 1, 0), //单手剑攻击诅咒卷轴70%
Array(2043005, 300, 1, 0), //单手剑攻击诅咒卷轴30%
Array(2043006, 300, 1, 0), //单手剑魔力诅咒卷轴70%
Array(2043007, 300, 1, 0), //单手剑魔力诅咒卷轴30%
Array(2043008, 300, 1, 0), //单手剑魔力卷轴10%
Array(2043009, 300, 1, 0), //单手剑魔力卷轴60%
Array(2043010, 300, 1, 0), //单手剑魔力卷轴100%
Array(2043011, 300, 1, 0), //单手剑攻击卷轴65%
Array(2043012, 300, 1, 0), //单手剑攻击卷轴15%
Array(2043015, 300, 1, 0), //单手剑命中率卷轴100%
Array(2043016, 300, 1, 0), //单手剑命中率卷轴70%
Array(2043017, 300, 1, 0), //单手剑命中率卷轴60%
Array(2043018, 300, 1, 0), //单手剑命中率卷轴30%
Array(2043019, 300, 1, 0), //单手剑命中率卷轴10%
Array(2043024, 300, 1, 0), //单手剑命中卷轴65%
Array(2043025, 300, 1, 0), //单手剑命中卷轴15%
Array(2043100, 300, 1, 0), //单手斧攻击卷轴100%
Array(2043101, 300, 1, 0), //单手斧攻击卷轴60%
Array(2043102, 300, 1, 0), //单手斧攻击卷轴10%
Array(2043104, 400, 1, 0), //单手斧攻击诅咒卷轴70%
Array(2043105, 400, 1, 0), //单手斧攻击诅咒卷轴30%
Array(2043106, 400, 1, 0), //单手斧攻击卷轴65%
Array(2043107, 400, 1, 0), //单手斧攻击卷轴15%
Array(2043110, 400, 1, 0), //单手斧命中率卷轴100%
Array(2043111, 400, 1, 0), //单手斧命中率卷轴70%
Array(2043112, 400, 1, 0), //单手斧命中率卷轴60%
Array(2043113, 400, 1, 0), //单手斧命中率卷轴30%
Array(2043114, 400, 1, 0), //单手斧命中率卷轴10%
Array(2043118, 400, 1, 0), //单手斧命中卷轴65%
Array(2043119, 400, 1, 0), //单手斧命中卷轴15%
Array(2043200, 400, 1, 0), //单手钝器攻击卷轴100%
Array(2043201, 400, 1, 0), //单手钝器攻击卷轴60%
Array(2043202, 400, 1, 0), //单手钝器攻击卷轴10%
Array(2043204, 400, 1, 0), //单手钝器攻击诅咒卷轴70%
Array(2043205, 400, 1, 0), //单手钝器攻击诅咒卷轴30%
Array(2043206, 400, 1, 0), //单手钝器攻击卷轴65%
Array(2043207, 400, 1, 0), //单手钝器攻击卷轴15%
Array(2043210, 400, 1, 0), //单手钝器命中率卷轴100%
Array(2043211, 400, 1, 0), //单手钝器命中率卷轴70%
Array(2043212, 400, 1, 0), //单手钝器命中率卷轴60%
Array(2043213, 400, 1, 0), //单手钝器命中率卷轴30%
Array(2043214, 400, 1, 0), //单手钝器命中率卷轴10%
Array(2043218, 400, 1, 0), //单手钝器命中卷轴65%
Array(2043219, 400, 1, 0), //单手钝器命中卷轴15%
Array(2043300, 450, 1, 0), //短剑攻击卷轴100%
Array(2043301, 400, 1, 0), //短剑攻击卷轴60%
Array(2043302, 400, 1, 0), //短剑攻击卷轴10%
Array(2043304, 400, 1, 0), //短剑攻击诅咒卷轴70%
Array(2043305, 400, 1, 0), //短剑攻击诅咒卷轴30%
Array(2043306, 400, 1, 0), //短剑攻击卷轴65%
Array(2043307, 400, 1, 0), //短剑攻击卷轴15%
Array(2043700, 400, 1, 0), //短杖魔力卷轴100%
Array(2043701, 400, 1, 0), //短杖魔力卷轴60%
Array(2043702, 400, 1, 0), //短杖魔力卷轴10%
Array(2043704, 400, 1, 0), //短杖魔力诅咒卷轴70%
Array(2043705, 400, 1, 0), //短杖魔力诅咒卷轴30%
Array(2043706, 400, 1, 0), //短杖魔力卷轴65%
Array(2043707, 400, 1, 0), //短杖魔力卷轴15%
Array(2043800, 400, 1, 0), //长杖魔力卷轴100%
Array(2043801, 400, 1, 0), //长杖魔力卷轴60%
Array(2043802, 300, 1, 0), //长杖魔力卷轴10%
Array(2043804, 300, 1, 0), //长杖魔力诅咒卷轴70%
Array(2043805, 300, 1, 0), //长杖魔力诅咒卷轴30%
Array(2043806, 300, 1, 0), //长杖魔力卷轴65%
Array(2043807, 300, 1, 0), //长杖魔力卷轴15%
Array(2044000, 500, 1, 0), //双手剑攻击卷轴100%
Array(2044001, 300, 1, 0), //双手剑攻击卷轴60%
Array(2044002, 300, 1, 0), //双手剑攻击卷轴10%
Array(2044004, 400, 1, 0), //双手剑攻击诅咒卷轴70%
Array(2044005, 300, 1, 0), //双手剑攻击诅咒卷轴30%
Array(2044006, 300, 1, 0), //双手剑攻击卷轴65%
Array(2044007, 300, 1, 0), //双手剑攻击卷轴15%
Array(2044010, 300, 1, 0), //双手剑命中率卷轴100%
Array(2044011, 300, 1, 0), //双手剑命中率卷轴70%
Array(2044012, 300, 1, 0), //双手剑命中率卷轴60%
Array(2044013, 300, 1, 0), //双手剑命中率卷轴30%
Array(2044014, 300, 1, 0), //双手剑命中率卷轴10%
Array(2044026, 300, 1, 0), //双手剑命中卷轴65%
Array(2044027, 300, 1, 0), //双手剑命中卷轴15%
Array(2044100, 300, 1, 0), //双手斧攻击卷轴100%
Array(2044101, 300, 1, 0), //双手斧攻击卷轴60%
Array(2044102, 300, 1, 0), //双手斧攻击卷轴10%
Array(2044104, 300, 1, 0), //双手斧攻击诅咒卷轴70%
Array(2044105, 300, 1, 0), //双手斧攻击诅咒卷轴%30
Array(2044106, 300, 1, 0), //双手斧攻击卷轴65%
Array(2044107, 300, 1, 0), //双手斧攻击卷轴15%
Array(2044110, 300, 1, 0), //双手斧命中率卷轴100%
Array(2044111, 300, 1, 0), //双手斧命中率卷轴70%
Array(2044112, 300, 1, 0), //双手斧命中率卷轴60%
Array(2044113, 300, 1, 0), //双手斧命中率卷轴30%
Array(2044114, 300, 1, 0), //双手斧命中率卷轴10%
Array(2044118, 300, 1, 0), //双手斧命中卷轴65%
Array(2044119, 300, 1, 0), //双手斧命中卷轴15%
Array(2044200, 300, 1, 0), //双手钝器攻击卷轴100%
Array(2044201, 300, 1, 0), //双手钝器攻击卷轴60%
Array(2044202, 300, 1, 0), //双手钝器攻击卷轴10%
Array(2044204, 300, 1, 0), //双手钝器攻击诅咒卷轴70%
Array(2044205, 300, 1, 0), //双手钝器攻击诅咒卷轴30%
Array(2044206, 300, 1, 0), //双手钝器攻击卷轴65%
Array(2044207, 300, 1, 0), //双手钝器攻击卷轴15%
Array(2044210, 300, 1, 0), //双手钝器命中率卷轴100%
Array(2044211, 300, 1, 0), //双手钝器命中率卷轴70%
Array(2044212, 300, 1, 0), //双手钝器命中率卷轴60%
Array(2044213, 300, 1, 0), //双手钝器命中率卷轴30%
Array(2044214, 300, 1, 0), //双手钝器命中率卷轴10%
Array(2044218, 300, 1, 0), //单手钝器命中卷轴65%
Array(2044219, 300, 1, 0), //单手钝器命中卷轴15%
Array(2044300, 300, 1, 0), //枪攻击卷轴100%
Array(2044301, 300, 1, 0), //枪攻击卷轴60%
Array(2044302, 300, 1, 0), //枪攻击卷轴10%
Array(2044304, 300, 1, 0), //枪攻击诅咒卷轴70%
Array(2044305, 300, 1, 0), //枪攻击诅咒卷轴30%
Array(2044306, 300, 1, 0), //枪攻击卷轴65%
Array(2044307, 300, 1, 0), //枪攻击卷轴15%
Array(2044310, 300, 1, 0), //枪命中率卷轴100%
Array(2044311, 300, 1, 0), //枪命中率卷轴70%
Array(2044312, 300, 1, 0), //枪命中率卷轴60%
Array(2044313, 300, 1, 0), //枪命中率卷轴30%
Array(2044314, 300, 1, 0), //枪命中率卷轴10%
Array(2044318, 300, 1, 0), //枪命中卷轴65%
Array(2044319, 300, 1, 0), //枪命中卷轴15%
Array(2044400, 300, 1, 0), //矛攻击卷轴100%
Array(2044401, 300, 1, 0), //矛攻击卷轴60%
Array(2044402, 300, 1, 0), //矛攻击卷轴10%
Array(2044404, 300, 1, 0), //矛攻击诅咒卷轴70%
Array(2044405, 300, 1, 0), //矛攻击诅咒卷轴30%
Array(2044406, 300, 1, 0), //矛攻击卷轴65%
Array(2044407, 300, 1, 0), //矛攻击卷轴15%
Array(2044410, 300, 1, 0), //矛命中率卷轴100%
Array(2044411, 300, 1, 0), //矛命中率卷轴70%
Array(2044412, 300, 1, 0), //矛命中率卷轴60%
Array(2044413, 300, 1, 0), //矛命中率卷轴30%
Array(2044414, 300, 1, 0), //矛命中率卷轴10%
Array(2044418, 300, 1, 0), //矛命中卷轴65%
Array(2044419, 300, 1, 0), //矛命中卷轴15%
Array(2044500, 300, 1, 0), //弓攻击卷轴100%
Array(2044501, 300, 1, 0), //弓攻击卷轴60%
Array(2044502, 300, 1, 0), //弓攻击卷轴10%
Array(2044504, 300, 1, 0), //弓攻击诅咒卷轴70%
Array(2044505, 300, 1, 0), //弓攻击诅咒卷轴30%
Array(2044506, 300, 1, 0), //弓攻击卷轴65%
Array(2044507, 300, 1, 0), //弓攻击卷轴15%
Array(2044600, 300, 1, 0), //弩攻击卷轴100%
Array(2044601, 300, 1, 0), //弩攻击卷轴60%
Array(2044602, 300, 1, 0), //弩攻击卷轴10%
Array(2044604, 600, 1, 0), //弩攻击诅咒卷轴70%
Array(2044605, 600, 1, 0), //弩攻击诅咒卷轴30%
Array(2044606, 500, 1, 0), //弩攻击卷轴65%
Array(2044607, 500, 1, 0), //弩攻击卷轴15%
Array(2044700, 400, 1, 0), //拳套攻击卷轴100%
Array(2044701, 200, 1, 0), //拳套攻击卷轴60%
Array(2044702, 300, 1, 0), //拳套攻击卷轴10%
Array(2044704, 300, 1, 0), //拳套攻击诅咒卷轴70%
Array(2044705, 300, 1, 0), //拳套攻击诅咒卷轴30%
Array(2044706, 300, 1, 0), //拳套攻击卷轴65%
Array(2044707, 300, 1, 0), //拳套攻击卷轴15%
Array(2044800, 300, 1, 0), //拳甲攻击卷轴100%
Array(2044801, 300, 1, 0), //拳甲攻击卷轴60%
Array(2044802, 300, 1, 0), //拳甲攻击卷轴10%
Array(2044803, 300, 1, 0), //拳甲攻击卷轴70%
Array(2044804, 300, 1, 0), //拳甲攻击卷轴30%
Array(2044805, 300, 1, 0), //拳甲命中率卷轴100%
Array(2044806, 300, 1, 0), //拳甲命中率卷轴70%
Array(2044807, 300, 1, 0), //拳甲命中率卷轴60%
Array(2044808, 300, 1, 0), //拳甲命中率卷轴30%
Array(2044809, 300, 1, 0), //拳甲命中率卷轴10%
Array(2044811, 300, 1, 0), //拳甲攻击卷轴65%
Array(2044812, 300, 1, 0), //指节攻击卷轴15%
Array(2044813, 300, 1, 0), //指节命中卷轴65%
Array(2044814, 300, 1, 0), //指节命中卷轴15%
Array(2044900, 300, 1, 0), //短枪攻击卷轴100%
Array(2044901, 300, 1, 0), //短枪攻击卷轴60%
Array(2044902, 300, 1, 0), //短枪攻击卷轴10%
Array(2044903, 300, 1, 0), //短枪攻击卷轴70%
Array(2044904, 300, 1, 0), //短枪攻击卷轴30%
Array(2044906, 300, 1, 0), //短枪攻击卷轴65%
Array(2044907, 300, 1, 0), //短枪攻击卷轴15%
Array(2049100, 300, 1, 0), //混沌卷轴60%
Array(2101001, 900, 1, 0), //蝙蝠魔召唤
Array(2100902, 900, 1, 0), //神秘召唤包
Array(2101004, 900, 1, 0), //绿水灵王召唤
Array(2531000, 600, 1, 1), //防爆卷轴
Array(2470001, 600, 1, 1), //黄金锤50%
Array(2049600, 600, 1, 1), //还原卷轴
Array(2049005, 400, 1, 1), //白医卷轴－神
//潜能系列转蛋
Array(2049402, 400, 1, 0), //100%特殊潜能附加卷轴
Array(2049419, 300, 1, 1), //100%特殊潜能附加古卷(3条)
Array(2049700, 300, 1, 1), //100%A潜能卷轴
Array(2049752, 100, 1, 1), //30%S潜能卷轴
Array(2049751, 50, 1, 1), //60%S潜能卷轴
Array(2049750, 20, 1, 1), //80%S潜能卷轴
Array(2048315, 400, 1, 0), //100%特殊附加潜能卷轴
Array(2048306, 200, 1, 1), //100%特殊附加潜能附加古卷(3条)
Array(2049501, 200, 1, 1), //银色刻印之印
Array(2049500, 100, 1, 1), //金色刻印之印
Array(2048300, 200, 1, 1), //银光潜能附加印章
Array(2048301, 100, 1, 1), //金光潜能附加印章
//强化卷轴系列转蛋
Array(2049309, 700, 1, 0), //2星装备强化卷轴
Array(2049304, 600, 1, 1), //3星装备强化卷轴
Array(2049305, 400, 1, 1), //4星装备强化卷轴
Array(2049334, 200, 1, 1), //5星装备强化卷轴              
Array(2049323, 150, 1, 1), //无损高级强化卷轴
//宿命卷轴系列转蛋
Array(2046577, 50, 1, 1), //宿命正义防具力量卷轴 100%
Array(2046578, 200, 1, 1), //宿命正义防具智力卷轴 100%
Array(2046579, 200, 1, 1), //宿命正义防具敏捷卷轴 100%
Array(2046580, 200, 1, 1), //宿命正义防具运气卷轴 100%
Array(2046763, 50, 1, 1), //宿命正义饰品力量卷轴 100%
Array(2046764, 200, 1, 1), //宿命正义饰品智力卷轴 100%
Array(2046765, 200, 1, 1), //宿命正义饰品敏捷卷轴 100%
Array(2046766, 200, 1, 1), //宿命正义饰品运气卷轴 100%
//Array(2046173, 30, 1, 1), //宿命正义双手武器攻击力卷轴 100%
//Array(2046913, 30, 1, 1), //宿命正义单手武器攻击力卷轴 100%
//Array(2046914, 30, 1, 1), //宿命正义单手武器魔力卷轴 100%
//RED卷轴系列转蛋
Array(2047840, 100, 1, 1), //RED双手武器攻击力卷轴
Array(2613016, 100, 1, 1), //RED单手武器攻击力卷轴
Array(2613017, 250, 1, 1), //RED单手武器魔力卷轴

//冒险之心系列转蛋
Array(4033755, 800, 1, 0), //心之项链链子
Array(2049421, 780, 1, 1), //心之项链潜能附加卷轴
Array(2048313, 750, 1, 1), //心之项链附加潜能附加卷轴

Array(2340000, 50, 1, 1) //祝福卷轴
);

function action(mode, type, selection) {
    if (mode == 1) {
        status++;
    } else {
        if (status == 0) {
            cm.sendOk("不想使用吗？…我的肚子里有各类#b奇特座椅或卷轴、装备、新奇道具#k哦！");
            cm.dispose();
        }
        status--;
    }
    if (status == 0) {
        if (cm.haveItem(5220040)) {
            cm.sendYesNo("冒险岛转蛋机中有各类#b装备、卷轴或稀有新奇的道具#k噢！使用“#b#t5220040##k”就可以交换. 游戏商城中的“其他”－“游戏”区里有噢。 假如不买转蛋券的话，是不可以使用我的。现在要玩转蛋机么? ");
        } else {
            cm.sendOk("你背包里有#b#t5220040##k吗?");
            cm.safeDispose();
        }
    } else if (status == 1) {
        var chance = Math.floor(Math.random() * 1000);
        var finalitem = Array();
        for (var i = 0; i < itemList.length; i++) {
            if (itemList[i][1] >= chance) {
                finalitem.push(itemList[i]);
            }
        }
        if (finalitem.length != 0) {
            var random = new java.util.Random();
            var finalchance = random.nextInt(finalitem.length);
            var itemId = finalitem[finalchance][0];
            var quantity = finalitem[finalchance][2];
            var notice = finalitem[finalchance][3];
			if (cm.haveItem(5220040) && cm.canHold()) {
				if (notice == 1) {
					cm.gainGachaponItem(itemId, quantity, "卷轴转蛋机");
				} else {
					cm.gainItem(itemId, quantity);
				}
                cm.gainItem(5220040, -1);
                cm.sendOk("你获得了 #b#t" + itemId + "##k " + quantity + "个。");
            } else {
                cm.sendOk("你确实有#b#t5220040##k吗？如果是，请你确认在背包的装备，消耗，其他窗口中是否有一格以上的空间。");
            }
            cm.safeDispose();
        } else {
            cm.sendOk("今天的运气可真差，什么都没有拿到。\r\n(获得了安慰奖：荣誉勋章 一个。)");
            cm.gainItem(5220040, -1);
            cm.gainItem(2431174, 1);
            cm.safeDispose();
        }
    } else {
		cm.dispose();
    }
}
