var status = 0;
var itemList = 
Array(     
			Array(3010081,700,1,1), //红色月杪
			Array(3010082,700,1,1), //蓝色月杪
			Array(3010083,700,1,1), //扇子月杪
			Array(3010084,700,1,1), //太平月杪
			Array(3010800,700,1,1), //小学生月杪
			Array(3010801,700,1,1), //学龄前月杪
			Array(3010802,700,1,1), //中学生月杪
			Array(3010803,700,1,1), //高中生月杪
			Array(3010804,700,1,1), //军人月杪
			Array(3010132,700,1,1), //撒娇猫咪
			Array(3010114,700,1,1), //俘虏我吧
			Array(3010131,700,1,1), //贪吃熊猫
			Array(3010208,700,1,1), //黑猫
			Array(3010207,700,1,1), //喧闹好友
			Array(3010298,700,1,1), //白熊抱抱
			Array(3010406,700,1,1), //迷你神兽
			Array(3010446,700,1,1), //皮肤皇后
			Array(3010450,700,1,1), //艾丽珍
			Array(3010458,700,1,1), //翻滚兔子
			Array(3010523,700,1,1), //白云漫步
			Array(3010537,700,1,1), //恶灵附身
			Array(3010581,700,1,1), //黑暗龙王
			Array(3010600,700,1,1), //福星月杪
			Array(3010733,700,1,1), //电视
			Array(3010068,700,1,1), //露水
			Array(3010053,700,1,1), //兔子纪念
			Array(3010079,700,1,1), //肥猫
			Array(3010100,700,1,1), //财神
			Array(3010106,700,1,1), //雪狼
			Array(3010116,700,1,1), //摇滚
			Array(3010142,700,1,1), //水族馆
			Array(3010149,700,1,1), //猫咪风扇
			Array(3010168,700,1,1), //友谊万岁
			Array(3010212,700,1,1), //藏獒
			Array(3010608,700,1,1), //回顾的名画
			Array(3010738,700,1,1), //闪电三人
			Array(3010799,700,1,1), //坟墓幽灵
			Array(3010215,700,1,1), //战神守护
			Array(3010216,700,1,1), //龙神守护
			Array(3010282,700,1,1), //送子仙鹤椅
			Array(3010313,600,1,1), //粉色扎昆椅子
			Array(3010320,600,1,1), //老奶奶读童话椅子
			Array(3010374,600,1,1), //闪耀星星之夜椅子
			Array(3010674,700,1,1), //高级冒险家旗帜椅子
			Array(3010682,600,1,1), //天文台
			Array(3010683,600,1,1), //了不得的玩具
			Array(3010688,600,1,1), //实验室
			Array(3010752,600,1,1), //玫瑰鸟笼
			Array(3010558,700,1,1), //泡泡浴椅子
			Array(3010863,700,1,1), //理发师
			Array(3010864,600,1,1), //紫色妖姬
			Array(3010678,500,1,1), //海嘉顿
			Array(3010794,600,1,1), //大舌头
			Array(3010714,600,1,1), //堆皇冠
			Array(3010593,600,1,1), //新年快乐
			Array(3015009,600,1,1), //苹果
			Array(3010720,600,1,1), //勇士我爱你
			Array(3010806,600,1,1), //樱花芬芳
			Array(3010730,600,1,1), //企鹅合唱团
			Array(3010813,600,1,1), //爱情水晶球
			Array(3010732,600,1,1), //翅膀自行车
			Array(3010681,400,1,1), //西瓜
			Array(3015011,600,1,1), //与儿时伙伴
			Array(3015012,600,1,1), //土豆
			Array(3010631,600,1,1), //金龙鱼椅子
			Array(3010073,700,1,1), //baby品克缤
			Array(3010492,600,1,1), //首脑椅子
			Array(3010456,600,1,1), //杜鹃花
			Array(3010453,600,1,1), //兔子乘风椅
			Array(3010457,600,1,1), //拉尼娅野餐椅
			Array(3015030,600,1,1), //与南哈特的回忆椅
			Array(3010705,400,1,1), //月妙和水灵椅子
			Array(3010584,700,1,1), //圣诞节幻影椅
			Array(3010567,600,1,1), //小型音乐会
			Array(3010789,600,1,1), //鞭炮
			Array(3010566,600,1,1), //生日快乐恶魔
			Array(3010565,500,1,1), //我的女皇椅子
			Array(3010404,500,1,1), //希拉的梳妆椅
			Array(3010402,500,1,1), //生日派对
			Array(3010459,500,1,1), //天使舞台
			Array(3010717,600,1,1), //嫁给我
			Array(3010680,500,1,1), //童话公主椅子
			Array(3010849,500,1,1), //最佳新人椅子
			Array(3010609,600,1,1), //不是在做梦
			Array(3010767,700,1,1), //雪人椅子
			Array(3010781,700,1,1), //马上有你
			Array(3015084,700,1,1), //爱之骑士
			Array(3015085,700,1,1), //血腥玛丽
			Array(3015098,400,1,1), //花蘑菇伪装椅子
            Array(3010512,500,1,1), //和半半在一起
			Array(3010659,400,1,1), //巴士
			Array(3010661,400,1,1), //欢乐相框
			Array(3010493,400,1,1), //那就是我
			Array(3010810,400,1,1), //火车椅子
			Array(3010620,500,1,1), //怪叔叔椅子
			Array(3010966,400,1,1), //幽灵船椅子
			Array(3012016,500,1,1), //糖果椅子
			Array(3012018,600,1,1), //育婴篮
			Array(3010589,600,1,1), //我需要充电
			Array(3010976,600,1,1), //为你加油
			Array(3010737,600,1,1), //动物英雄团
			Array(3015010,600,1,1), //巨人椅子
			Array(3015076,500,1,1), //娃娃椅子
			Array(3010848,500,1,1), //红地毯椅子
			Array(3010760,500,1,1), //古代浴池椅子
			Array(3010850,500,1,1), //评论家椅子
			Array(3010676,600,1,1), //军团长椅子
			Array(3010756,500,1,1), //招财猫椅子
			Array(3010879,600,1,1), //繁星椅子
			Array(3010836,600,1,1), //度假
			Array(3010854,500,1,1), //怪物共聚一堂椅子
			Array(3010754,600,1,1), //百鬼夜行
			Array(3010511,600,1,1), //猫猫公园椅子
			Array(3010877,600,1,1), //珊瑚椅子
			Array(3010675,700,1,1), //愤怒的半半
			Array(3010718,700,1,1), //初恋云朵朵椅子
			Array(3015133,500,1,1), //下午茶椅子
			Array(3010979,500,1,1), //军团长奥尔卡枕头椅
			Array(3010978,500,1,1), //俘虏奥尔卡枕头椅
			Array(3015003,700,1,1), //永恒斯乌枕头椅
			Array(3015004,500,1,1), //维丽尔枕头椅
			Array(3010968,500,1,1), //假面绅士枕头椅
			Array(3010842,500,1,1), //猫猫郊游房车
			Array(3010843,500,1,1), //兔兔郊游房车
			Array(3010946,500,1,1), //森林伙伴椅子
			Array(3015087,500,1,1), //家庭聚餐椅子
			Array(3010984,500,1,1), //皇宫盛宴椅子
			Array(3010999,500,1,1), //主人用餐椅子
			Array(3010937,600,1,1), //异界半半椅子
			Array(3010938,600,1,1), //异界女王椅子
			Array(3010939,500,1,1), //异界匈奴椅子
			Array(3015028,100,1,1) //灯泡里的人鱼
			//-------第一个是物品ID，第二个是抽奖概率，第三个是抽奖数量,第四个是是否提示抽奖广播(大于1就会广播)
);

function start() {
	status = -1;
	action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == 1) {
        status++;
    } else {
        if (status == 0) {
            cm.sendOk("箱子抽奖：#v2049100#混沌卷轴/#v2340000#祝福卷轴/#v2000005#超级药水x50.随机抽取其一.");
            cm.dispose();
        }
        status--;
    }
    if (status == 0) {
        if (cm.haveItem(2022466, 1)) {
				var str1 = "";	
           for (var i = 0; i < itemList.length; i++){
                   str1 += "#v"+itemList[i][0]+"#";
            }
				cm.sendOk("这里是可以抽取许多好东西哦！\r\n\r\n比赛所有奖品如下#r[真实,无欺骗!]:" + str1);
			} else {
            var str1 = "\r\n";	
           for (var i = 0; i < itemList.length; i++){
                   str1 += "#v"+itemList[i][0]+"#";
            }
				cm.sendOk("这里是可以抽取许多好东西哦！\r\n\r\n比赛所有奖品如下#r[真实,无欺骗!]:" + str1);
				cm.dispose();
			}
    } else if (status == 1) {
        var chance = Math.floor(Math.random() * +700);
        var finalitem = Array();
        for (var i = 0; i < itemList.length; i++) {
            if (itemList[i][1] >= chance) {
                finalitem.push(itemList[i]);
            }
        }
        if (finalitem.length != 0) {
            var item;
            var random = new java.util.Random();
            var finalchance = random.nextInt(finalitem.length);
            var itemId = finalitem[finalchance][0];
            var quantity = finalitem[finalchance][2];
            var notice = finalitem[finalchance][3];
            item = cm.gainGachaponItem(itemId, quantity, "箱子福利抽奖", notice);
            if (item != -1) {
                cm.gainItem(2022466, -1);
                cm.sendOk("你获得了 #b#t" + item + "##k " + quantity + "个。");
            } else {
                cm.sendOk("你确实有#b#t2022428##k吗？如果是，请你确认在背包的装备，消耗，其他窗口中是否有一格以上的空间。");
            }
            cm.safeDispose();
        } else {
            cm.sendOk("今天的运气可真差，什么都没有拿到。但是作为鼓励，送给你5颗#v4001322#作为奖励.");
            cm.gainItem(2022466, -1);
            cm.gainItem(4001322, 5);
            cm.safeDispose();
        }
    }
}
