var status = 0;
var itemList = 
Array(     
			Array(1004467,600,1,1), //特大爱心宽檐帽
			Array(1004328,700,1,1), //粉色棒球帽
			Array(1003050,700,1,1), //兔帽子
			Array(1003892,700,1,1), //树叶钻石
			Array(1003918,600,1,1), //翅膀帽
			Array(1004029,600,1,1), //小白熊便帽
			Array(1004026,600,1,1), //小黑猫便帽
			Array(1004028,600,1,1), //小花猫便帽
			Array(1002846,700,1,1), //蓝天贝雷帽
			Array(1002839,700,1,1), //南瓜棒球帽
			Array(1003802,700,1,1), //小恐龙绿豆帽子
			Array(1003803,700,1,1), //小恐龙云豆帽子
			Array(1004126,600,1,1), //彩塘熊耳帽
			Array(1003508,700,1,1), //西红柿帽子
			Array(1004092,700,1,1), //小马乖乖帽
			Array(1002524,700,1,1), //七七帽
			Array(1003461,700,1,1), //秀秀
			Array(1003807,700,1,1), //桃心太阳眼镜
			Array(1003078,700,1,1), //灵异蝴蝶
			Array(1003083,700,1,1), //小嫩苗
			Array(1003249,700,1,1), //8周年音符黄晶
			Array(1004472,600,1,1), //饿狼传说
			Array(1003545,700,1,1), //哈密瓜纸杯蛋糕发卡
			Array(1003487,700,1,1), //龙龙贪吃帽-白色
			Array(1102749,600,1,1), //五彩星星气球
			Array(1102757,600,1,1), //巴尼兔心形气球
			Array(1102756,700,1,1), //微笑玉米斗篷
			Array(1102808,700,1,1), //啵啵鼠气球
			Array(1102789,600,1,1), //白熊围脖
			Array(1102625,700,1,1), //红色蜗牛壳
			Array(1102845,700,1,1), //蓝熊猫
			Array(1102708,700,1,1), //海螺
			Array(1102705,700,1,1), //企鹅书包
			Array(1102461,700,1,1), //粉嫩披风
			Array(1102245,700,1,1), //太阳披风
			Array(1102285,700,1,1), //晴天娃娃(粉色
			Array(1102215,700,1,1), //气球串
			Array(1102673,700,1,1), //僵尸新娘披风
			Array(1102251,700,1,1), //世界杯手巾
			Array(1102218,700,1,1), //仙女飘飘
			Array(1102232,700,1,1), //小王子的星星
			Array(1102288,700,1,1), //背背雪人
			Array(1102391,600,1,1), //小蜜蜂翅膀
			Array(1012253,700,1,1), //心跳唇彩
			Array(1012427,600,1,1), //微笑的表情
			Array(1012430,600,1,1), //可爱的表情
			Array(1012429,600,1,1), //惊讶的表情
			Array(1012502,600,1,1), //眼鼻
			Array(1012099,700,1,1), //蓝色腮红
			Array(1012053,700,1,1), //愤怒
			Array(1012461,700,1,1), //青春痘
			Array(1012450,600,1,1), //巧克力饼干 
			Array(1012180,600,1,1), //爱心巧克力
			Array(1042340,600,1,1), //灰喵喵围脖小上衣
			Array(1041194,600,1,1), //粉色兔子T恤
			Array(1041196,600,1,1), //菠萝吊带衫
			Array(1042045,600,1,1), //蓝竖条T恤
			Array(1042202,600,1,1), //小企企卷边T恤
			Array(1042214,600,1,1), //粉条纹两件套
			Array(1042345,600,1,1), //喜羊羊上衣
			Array(1042311,600,1,1), //彩糖T恤
			Array(1042350,600,1,1), //海豚T恤
			Array(1042336,600,1,1), //微笑玉米衫
			Array(1072531,700,1,1), //考拉拖鞋
			Array(1072516,700,1,1), //新手小鸡拖
			Array(1072515,700,1,1), //狮子宝宝拖
			Array(1072484,700,1,1), //黑猫拖
			Array(1072407,700,1,1), //HELLO喵喵拖
			Array(1072437,700,1,1), //PB拖拖
			Array(1072482,700,1,1), //熊猫拖
			Array(1082503,700,1,1), //圣洁天使手镯
			Array(1082312,700,1,1), //七七护腕
			Array(1082548,700,1,1), //星星手镯
			Array(1702375,500,1,1), //大海
			Array(1702488,500,1,1), //邦尼
			Array(1702501,500,1,1), //玫瑰 
			Array(1702503,500,1,1), //泡泡
			Array(1702486,500,1,1), //茶花
			Array(1702406,500,1,1), //坠星魔术空间
			Array(1702422,500,1,1), //冒险明星麦克风
			Array(1702505,500,1,1), //竹子
			Array(1702400,500,1,1), //斯乌的兔子玩偶
			Array(1702455,500,1,1), //真红油漆桶
			Array(1702466,500,1,1), //薄荷巧克力蛋糕魔法棒
			Array(1702464,500,1,1), //闪耀的伙伴们
			Array(1702459,500,1,1), //棉花糖武器
			Array(1702626,500,1,1), //海洋风提包
            Array(1702595,500,1,1), //薄荷喵下午茶
			Array(1702608,500,1,1), //海军条纹雨伞
			Array(1702566,500,1,1), //羊羊魔术棒
			Array(1702278,600,1,1) //枫之武器
			//-------第一个是物品ID，第二个是抽奖概率，第三个是抽奖数量,第四个是是否提示抽奖广播(大于1就会广播)
);

function start() {
	status = -1;
	action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == 1) {
        status++;
    } else {
        if (status == 0) {
            cm.sendOk("箱子抽奖：#v2049100#混沌卷轴/#v2340000#祝福卷轴/#v2000005#超级药水x50.随机抽取其一.");
            cm.dispose();
        }
        status--;
    }
    if (status == 0) {
        if (cm.haveItem(2022467, 1)) {
				var str1 = "";	
           for (var i = 0; i < itemList.length; i++){
                   str1 += "#v"+itemList[i][0]+"#";
            }
				cm.sendOk("这里是可以抽取许多好东西哦！\r\n\r\n比赛所有奖品如下#r[真实,无欺骗!]:" + str1);
			} else {
            var str1 = "\r\n";	
           for (var i = 0; i < itemList.length; i++){
                   str1 += "#v"+itemList[i][0]+"#";
            }
				cm.sendOk("这里是可以抽取许多好东西哦！\r\n\r\n比赛所有奖品如下#r[真实,无欺骗!]:" + str1);
				cm.dispose();
			}
    } else if (status == 1) {
        var chance = Math.floor(Math.random() * +900);
        var finalitem = Array();
        for (var i = 0; i < itemList.length; i++) {
            if (itemList[i][1] >= chance) {
                finalitem.push(itemList[i]);
            }
        }
        if (finalitem.length != 0) {
            var item;
            var random = new java.util.Random();
            var finalchance = random.nextInt(finalitem.length);
            var itemId = finalitem[finalchance][0];
            var quantity = finalitem[finalchance][2];
            var notice = finalitem[finalchance][3];
            item = cm.gainGachaponItem(itemId, quantity, "箱子福利抽奖", notice);
            if (item != -1) {
                cm.gainItem(2022467, -1);
                cm.sendOk("你获得了 #b#t" + item + "##k " + quantity + "个。");
            } else {
                cm.sendOk("你确实有#b#t2022428##k吗？如果是，请你确认在背包的装备，消耗，其他窗口中是否有一格以上的空间。");
            }
            cm.safeDispose();
        } else {
            cm.sendOk("今天的运气可真差，什么都没有拿到。但是作为鼓励，送给你5颗#v4001322#作为奖励.");
            cm.gainItem(2022467, -1);
            cm.gainItem(4001322, 5);
            cm.safeDispose();
        }
    }
}