status = -1;
var itemList = Array(
        Array(2040029, 400, 1, 0), //头盔敏捷卷轴60%
        Array(2040030, 400, 1, 0), //头盔敏捷卷轴30%
        Array(2040031, 700, 1, 0), //头盔敏捷卷轴10%
        Array(2040025, 400, 1, 0), //头盔智力卷轴60%
        Array(2040013, 400, 1, 0), //头盔智力卷轴30%
        Array(2040026, 700, 1, 0), //头盔智力卷轴10%
        Array(2040001, 700, 1, 0), //头盔防御卷轴60%
        Array(2040009, 700, 1, 0), //头盔防御卷轴30%
        Array(2040002, 700, 1, 0), //头盔防御卷轴10%
        Array(2040201, 700, 1, 0), //眼部装饰命中率卷轴60%
        Array(2040203, 700, 1, 0), //眼部装饰命中率卷轴30%
        Array(2040200, 700, 1, 0), //眼部装饰命中率卷轴10%
        Array(2040206, 700, 1, 0), //眼部装饰智力卷轴60%
        Array(2040208, 700, 1, 0), //眼部装饰智力卷轴30%
        Array(2040205, 700, 1, 0), //眼部装饰智力卷轴10%
        Array(2040301, 700, 1, 0), //耳环智力卷轴60%
        Array(2040302, 700, 1, 0), //耳环智力卷轴10%
        Array(2040317, 700, 1, 0), //耳环敏捷卷轴60%
        Array(2040307, 400, 1, 0), //耳环敏捷诅咒卷轴30%
        Array(2040318, 700, 1, 0), //耳环敏捷卷轴10%
        Array(2040321, 700, 1, 0), //耳环幸运卷轴60%
        Array(2040322, 400, 1, 0), //耳环幸运诅咒卷轴30%
        Array(2040323, 700, 1, 0), //耳环幸运卷轴10%
        Array(2040401, 700, 1, 0), //上衣防御卷轴60%
        Array(2040405, 700, 1, 0), //上衣防御诅咒卷轴30%
        Array(2040402, 700, 1, 0), //上衣防御卷轴10%
        Array(2040418, 400, 1, 0), //上衣力量卷轴60%
        Array(2040419, 700, 1, 0), //上衣力量卷轴10%
        Array(2040413, 700, 1, 0), //上衣幸运卷轴60%
        Array(2040412, 700, 1, 0), //上衣幸运卷轴10%
        Array(2040504, 700, 1, 0), //套服防御卷轴60%
        Array(2040511, 700, 1, 0), //套服防御诅咒卷轴30%
        Array(2040505, 700, 1, 0), //套服防御卷轴10%
        Array(2040501, 400, 1, 0), //套服敏捷卷轴60%
        Array(2040502, 700, 1, 0), //套服敏捷卷轴10%
        Array(2040532, 400, 1, 0), //套服力量卷轴60%
        Array(2040534, 400, 1, 0), //套服力量卷轴10%
        Array(2040513, 400, 1, 0), //套服智力卷轴60%
        Array(2040514, 400, 1, 0), //套服智力卷轴10%
        Array(2040516, 400, 1, 0), //套服幸运卷轴60%
        Array(2040517, 700, 1, 0), //套服幸运卷轴10%
        Array(2040601, 700, 1, 0), //裤、裙防御卷轴60%
        Array(2040605, 700, 1, 0), //裤、裙防御诅咒卷轴30%
        Array(2040602, 700, 1, 0), //裤、裙防御卷轴10%
        Array(2040618, 700, 1, 0), //裤裙跳跃卷轴60%
        Array(3040607, 700, 1, 0), //裤、裙跳跃诅咒卷轴30%
        Array(2040619, 700, 1, 0), //裤裙跳跃卷轴10%
        Array(2040625, 400, 1, 0), //裤裙敏捷卷轴 60%
        Array(2040627, 700, 1, 0), //裤裙敏捷卷轴 10%
        Array(2040704, 700, 1, 0), //鞋子跳跃卷轴60%
        Array(2040715, 400, 1, 0), //鞋子跳跃诅咒卷轴30%
        Array(2040705, 700, 1, 0), //鞋子跳跃卷轴10%
        Array(2040701, 700, 1, 0), //鞋子敏捷卷轴60%
        Array(2040713, 700, 1, 0), //鞋子敏捷诅咒卷轴30%
        Array(2040702, 700, 1, 0), //鞋子敏捷卷轴10%
        Array(2040707, 700, 1, 0), //鞋子速度卷轴60%
        Array(2040717, 700, 1, 0), //鞋子速度诅咒卷轴30%
        Array(2040708, 700, 1, 0), //鞋子速度卷轴10%
        Array(2040801, 700, 1, 0), //手套敏捷卷轴60%
        Array(2040809, 700, 1, 0), //手套敏捷诅咒卷轴30%
        Array(2040802, 700, 1, 0), //手套敏捷卷轴10%
        Array(2040804, 400, 1, 0), //手套攻击卷轴60%
        Array(2040805, 400, 1, 0), //手套攻击卷轴10%
        Array(2040817, 400, 1, 0), //手套魔力卷轴60%
        Array(2040816, 400, 1, 0), //手套魔力卷轴10%
        Array(2040824, 700, 1, 0), //手套生命卷轴60%
        Array(2040813, 700, 1, 0), //手套生命诅咒卷轴30%
        Array(2040825, 700, 1, 0), //手套生命卷轴10%
        Array(2040901, 700, 1, 0), //盾牌防御卷轴60%
        Array(2040905, 700, 1, 0), //盾牌防御诅咒卷轴30%
        Array(2040902, 700, 1, 0), //盾牌防御卷轴10%
        Array(2040914, 400, 1, 0), //盾牌攻击卷轴60%
        Array(2040917, 400, 1, 0), //盾牌攻击诅咒卷轴30%
        Array(2040915, 400, 1, 0), //盾牌攻击卷轴10%
        Array(2040919, 400, 1, 0), //盾牌魔力卷轴60%
        Array(2040922, 400, 1, 0), //盾牌魔力诅咒卷轴30%
        Array(2040920, 400, 1, 0), //盾牌魔力卷轴10%
        Array(2040931, 700, 1, 0), //盾牌力量卷轴60%
        Array(2040932, 700, 1, 0), //盾牌力量诅咒卷轴30%
        Array(2040933, 700, 1, 0), //盾牌力量卷轴10%
        Array(2040924, 700, 1, 0), //盾牌幸运卷轴60%
        Array(2040907, 700, 1, 0), //盾牌幸运诅咒卷轴30%
        Array(2040925, 700, 1, 0), //盾牌幸运卷轴10%
        Array(2041013, 700, 1, 0), //披风力量卷轴60%
        Array(2041035, 700, 1, 0), //披风力量诅咒卷轴30%
        Array(2041014, 700, 1, 0), //披风力量卷轴10%
        Array(2041019, 700, 1, 0), //披风敏捷卷轴60%
        Array(2041039, 700, 1, 0), //披风敏捷诅咒卷轴30%
        Array(2041020, 700, 1, 0), //披风敏捷卷轴10%
        Array(2041016, 700, 1, 0), //披风智力卷轴60%
        Array(2041037, 700, 1, 0), //披风智力诅咒卷轴30%
        Array(2041017, 700, 1, 0), //披风智力卷轴10%
        Array(2041022, 700, 1, 0), //披风幸运卷轴60%
        Array(2041041, 700, 1, 0), //披风幸运诅咒卷轴30%
        Array(2041023, 700, 1, 0), //披风幸运卷轴10%
        Array(2041207, 700, 1, 0), //项炼力量卷轴60%
        Array(2041209, 700, 1, 0), //项炼力量诅咒卷轴30%
        Array(2041206, 700, 1, 0), //项炼力量卷轴10%
        Array(2041202, 700, 1, 0), //项炼幸运卷轴60%
        Array(2041204, 700, 1, 0), //项炼幸运诅咒卷轴30%
        Array(2041201, 700, 1, 0), //项炼幸运卷轴10%
        Array(2041301, 700, 1, 0), //腰带力量卷轴60%
        Array(2041313, 700, 1, 0), //腰带力量诅咒卷轴30%
        Array(2041302, 700, 1, 0), //腰带力量卷轴10%
        Array(2041307, 700, 1, 0), //腰带敏捷卷轴60%
        Array(2041317, 700, 1, 0), //腰带敏捷诅咒卷轴30%
        Array(2041308, 700, 1, 0), //腰带敏捷卷轴10%
        Array(2041304, 700, 1, 0), //腰带智力卷轴60%
        Array(2041315, 700, 1, 0), //腰带智力诅咒卷轴30%
        Array(2041305, 700, 1, 0), //腰带智力卷轴10%
        Array(2041310, 700, 1, 0), //腰带幸运卷轴60%
        Array(2041319, 700, 1, 0), //腰带幸运诅咒卷轴30%
        Array(2041311, 700, 1, 0), //腰带幸运卷轴10%
        Array(2043001, 700, 1, 0), //单手剑攻击卷轴60%
        Array(2043002, 700, 1, 0), //单手剑攻击卷轴10%
        Array(2043101, 700, 1, 0), //单手斧攻击卷轴60%
        Array(2043105, 400, 1, 0), //单手斧攻击诅咒卷轴30%
        Array(2043102, 700, 1, 0), //单手斧攻击卷轴10%
        Array(2043201, 700, 1, 0), //单手棍攻击卷轴60%
        Array(2043205, 700, 1, 0), //单手棍攻击诅咒卷轴30% 
        Array(2043202, 700, 1, 0), //单手棍攻击卷轴10%
        Array(2043301, 400, 1, 0), //短剑攻击卷轴60%
        Array(2043302, 700, 1, 0), //短剑攻击卷轴10%
        Array(2043701, 700, 1, 0), //短杖魔力卷轴60%
        Array(2043702, 700, 1, 0), //短杖魔力卷轴10%
        Array(2043801, 700, 1, 0), //长杖魔力卷轴60%
        Array(2043802, 700, 1, 0), //长杖魔力卷轴10%
        Array(2044001, 700, 1, 0), //双手剑攻击卷轴60%
        Array(2044005, 400, 1, 0), //双手剑攻击诅咒卷轴30%
        Array(2044002, 700, 1, 0), //双手剑攻击卷轴10%
        Array(2044301, 700, 1, 0), //枪攻击卷轴60%
        Array(2044302, 700, 1, 0), //枪攻击卷轴10%
        Array(2044401, 700, 1, 0), //矛攻击卷轴60%
        Array(2044402, 700, 1, 0), //矛攻击卷轴10%
        Array(2044501, 700, 1, 0), //弓攻击卷轴60%
        Array(2044502, 700, 1, 0), //弓攻击卷轴10%
        Array(2044601, 700, 1, 0), //弩攻击卷轴60%
        Array(2044605, 700, 1, 0), //弩攻击诅咒卷轴30%
        Array(2044602, 700, 1, 0), //弩攻击卷轴10%
        Array(2044701, 700, 1, 0), //拳套攻击卷轴60%
        Array(2044702, 400, 1, 0), //拳套攻击卷轴10%
        Array(2044801, 700, 1, 0), //指虎攻击卷轴60%
        Array(2044802, 700, 1, 0), //指虎攻击卷轴10%
        Array(2044901, 400, 1, 0), //火枪攻击卷轴60%
        Array(2044902, 400, 1, 0), //火枪攻击卷轴10%
        Array(2049100, 400, 1, 0), //混沌卷轴60%
        Array(2040305, 120, 1, 1), //耳环智力诅咒卷轴30%
        Array(2040407, 120, 1, 1), //上衣力量诅咒卷轴30%
        Array(2040411, 120, 1, 1), //上衣幸运诅咒卷轴30%
        Array(2040509, 120, 1, 1), //套服敏捷诅咒卷轴30%
        Array(2040533, 120, 1, 1), //套服力量诅咒卷轴30%
        Array(2040519, 120, 1, 1), //套服智力诅咒卷轴30%
        Array(2040521, 120, 1, 1), //套服幸运诅咒卷轴30%
        Array(2040626, 120, 1, 1), //裤裙敏捷卷轴 30%
        Array(2040811, 120, 1, 1), //手套攻击诅咒卷轴30%
        Array(2040815, 120, 1, 1), //手套魔力诅咒卷轴30%
        Array(2043005, 120, 1, 1), //单手剑攻击诅咒卷轴30%
        Array(2043305, 120, 1, 1), //短剑攻击诅咒卷轴30%
        Array(2043705, 120, 1, 1), //短杖魔力诅咒卷轴30%
        Array(2043805, 120, 1, 1), //长杖魔力诅咒卷轴30%
        Array(2044305, 120, 1, 1), //枪攻击诅咒卷轴30%
        Array(2044405, 120, 1, 1), //矛攻击诅咒卷轴30%
        Array(2044505, 120, 1, 1), //弓攻击诅咒卷轴30%
        Array(2044705, 120, 1, 1), //拳套攻击诅咒卷轴30%
        Array(2044804, 120, 1, 1), //指虎攻击诅咒卷轴30%
        Array(2044904, 120, 1, 1), //火枪攻击诅咒卷轴30%
        Array(2340000, 80, 1, 1)//祝福卷轴
        );

function action(mode, type, selection) {
    if (mode == 1) {
        status++;
    } else {
        if (status == 0) {
            cm.sendOk("不想使用了吗？");
            cm.dispose();
        }
        status--;
    }

    if (status == 0) {
        if (cm.getPlayer().getLevel() < 25) {
            cm.sendOk("必须达到25级才能使用。");
            cm.dispose();
        } else if (cm.haveItem(5220000)) {
            cm.sendYesNo("你持有#b转蛋券#k你要试试手气吗?");
        } else {
            cm.sendOk("你没有转蛋券，请收集完成再来转蛋哦.");
            cm.safeDispose();
        }
    } else if (status == 1) {
        var chance = Math.floor(Math.random() * 1000);
        if (chance > 700) {
            chance = 700;
        }
        var finalitem = Array();
        for (var i = 0; i < itemList.length; i++) {
            if (itemList[i][1] >= chance) {
                finalitem.push(itemList[i]);
            }
        }
        if (finalitem.length != 0) {
            var random = new java.util.Random();
            var finalchance = random.nextInt(finalitem.length);
            var itemId = finalitem[finalchance][0];
            var quantity = finalitem[finalchance][2];
            var notice = finalitem[finalchance][3];
            if (cm.haveItem(5220000) && cm.canHold()) {
                if (notice == 1) {
                    cm.gainGachaponItem(itemId, quantity, "卷轴转蛋机");
                } else {
                    cm.gainItem(itemId, quantity);
                }
                cm.gainItem(5220000, -1);
                cm.sendOk("你得到了 #b#t" + itemId + "##k " + quantity + "个。");
            } else {
                cm.sendOk("请确认背包是否已经满了以及是否有转蛋卷唷。");
            }
            cm.safeDispose();
        } else {
            cm.sendOk("今天的运气可真差，什么都没有拿到。");
            cm.safeDispose();
        }
    } else {
        cm.dispose();
    }
}
