status = -1;
var itemList = Array(
Array(1032032, 500, 1, 0), //秋叶耳环
Array(1032035, 500, 1, 0), //枫叶耳环
Array(1032040, 500, 1, 0), //枫叶型耳环,800,1,0), //初
Array(1032041, 500, 1, 0), //枫叶型耳环,800,1,0), //庆
Array(1032042, 500, 1, 0), //枫叶型耳环,800,1,0), //盛
Array(1032055, 500, 1, 0), //工作人员C的旧收信机
Array(1032056, 500, 1, 0), //工作人员C的旧收信机
Array(1032057, 500, 1, 0), //工作人员C的旧收信机
Array(1032058, 500, 1, 0), //工作人员C钛质收信机
Array(1122001, 500, 1, 0), //绿色蝶形领结
Array(1122002, 500, 1, 0), //红色蝶形领结
Array(1122003, 500, 1, 0), //黄色蝶形领结
Array(1122004, 500, 1, 0), //粉红蝶形领结
Array(1122005, 500, 1, 0), //黑色蝶形领结
Array(1122006, 500, 1, 0), //蓝色蝶形领结
Array(1122015, 500, 1, 0), //枫叶围巾
Array(1122058, 100, 1, 0), //休彼德蔓的混沌项链
Array(1132000, 800, 1, 0), //白色腰带
Array(1132001, 700, 1, 0), //黄色腰带
Array(1132002, 600, 1, 0), //蓝色腰带
Array(1132003, 500, 1, 0), //红色腰带
Array(1132004, 450, 1, 0), //黑贺腰带
Array(1132010, 500, 1, 0), //黄金猪猪腰带
Array(1132011, 500, 1, 0), //黄金猪猪腰带
Array(1132012, 500, 1, 0), //法老的腰带
Array(1132013, 800, 1, 0), //不灭的法老腰带
Array(1122074, 500, 1, 0), //枫叶吊坠
Array(1122075, 500, 1, 0), //黄金枫叶魔法吊坠
Array(1002390, 500, 1, 0), //真扎昆头盔
Array(1002391, 500, 1, 0), //海盗头巾(绿)
Array(1002392, 500, 1, 0), //海盗头巾(红)
Array(1002393, 500, 1, 0), //海盗头巾(粉)
Array(1002394, 500, 1, 0), //海盗头巾(灰)
Array(1002395, 500, 1, 0), //海盗头巾(紫)
Array(1002418, 500, 1, 0), //废报纸头盔
Array(1002419, 500, 1, 0), //枫叶帽
Array(1002424, 500, 1, 0), //红马术帽
Array(1002425, 500, 1, 0), //蓝马术帽
Array(1002441, 500, 1, 0), //热血头带
Array(1002508, 500, 1, 0), //枫叶头盔
Array(1002509, 500, 1, 0), //枫叶头盔
Array(1002510, 500, 1, 0), //枫叶头盔
Array(1002511, 500, 1, 0), //枫叶头盔
Array(1002547, 500, 1, 0), //红猎人帽子
Array(1002550, 500, 1, 0), //黑色格莱西头盔
Array(1002551, 500, 1, 0), //蓝龙头盔
Array(1002554, 500, 1, 0), //武艺头绳
//-------耳环-------
Array(1032055, 500, 1, 0), //工作人员C的旧收信机
Array(1032056, 500, 1, 0), //工作人员C的旧收信机
Array(1032057, 500, 1, 0), //工作人员C的旧收信机
Array(1032058, 500, 1, 0), //工作人员C钛质收信机
//------手套------
Array(1082145, 100, 1, 1), //工地手套(黄)
Array(1082146, 100, 1, 1), //工地手套(红)
Array(1082147, 100, 1, 1), //工地手套(蓝)
Array(1082148, 100, 1, 1), //工地手套(紫)
Array(1082149, 100, 1, 1), //工地手套(褐)
Array(1082150, 100, 1, 1), //工地手套(灰)
//-----椅子-----
Array(3010013, 150, 1, 0), //悠长假期
Array(3010014, 150, 1, 0), //月亮弯
Array(3010018, 150, 1, 0), //椰子树沙滩椅
Array(3010019, 150, 1, 0), //寿司椅
Array(3010021, 150, 1, 0), //暖暖桌
Array(3010025, 150, 1, 0), //枫叶纪念凳
Array(3010028, 150, 1, 0), //海盗的俘虏
Array(3010029, 150, 1, 0), //蓝环凳
Array(3010030, 150, 1, 0), //黑环凳
Array(3010031, 150, 1, 0), //红环凳
Array(3010032, 150, 1, 0), //黄环凳
Array(3010033, 150, 1, 0), //绿环凳
Array(3010037, 150, 1, 0), //猪猪凳
Array(3010044, 150, 1, 0), //同一红伞下
Array(3012001, 150, 1, 0), //篝火
Array(3012002, 150, 1, 0), //浴桶
Array(3010073, 150, 1, 0), //PB克缤
Array(3012003, 150, 1, 0), //爱心椅子
Array(3010012, 150, 1, 0), //剑士 宝座
Array(3010025, 150, 1, 0), //枫叶纪念凳
Array(3010037, 150, 1, 0), //猪猪凳
Array(3010038, 150, 1, 0), //爱心椅子
Array(3010040, 150, 1, 0), //蝙蝠椅
Array(3010041, 150, 1, 0), //骷髅王座
Array(3010043, 150, 1, 0), //魔女的飞扫把
Array(3010044, 150, 1, 0), //同一红伞下
Array(3010045, 150, 1, 0), //寒冰椅子
Array(3010046, 150, 1, 0), //红龙椅
Array(3010047, 200, 1, 0), //蓝龙椅
Array(3010048, 200, 1, 0), //圣诞树椅子
Array(3010049, 200, 1, 0), //雪房子
Array(3010050, 200, 1, 0), //公主凳
Array(3010057, 200, 1, 0), //血色玫瑰
Array(3010058, 200, 1, 0), //世界末日
Array(3010068, 200, 1, 0), //露水椅子
Array(3010070, 15, 1, 1), //巨无霸品克缤
Array(3010071, 125, 1, 0), //神兽椅
Array(3010077, 125, 1, 0), //猫头鹰椅子
Array(3010085, 125, 1, 0), //鬼娃娃椅子
Array(3010096, 125, 1, 0), //恐龙化石宝座
Array(3010095, 125, 1, 0), //石头人座椅
Array(3010094, 215, 1, 0), //漂漂猪椅子
Array(3010098, 125, 1, 0), //电视宅人
Array(3010106, 125, 1, 0), //雪狼战椅
Array(3010112, 125, 1, 0), //情书柜子
Array(3010117, 125, 1, 0), //魔法书椅子
Array(3010119, 125, 1, 0), //羊羊椅子
Array(3010120, 125, 1, 0), //彩蛋篮子
Array(3010123, 125, 1, 0), //夏日花朵
Array(3010124, 125, 1, 0), //都纳斯喷气椅子
Array(3010125, 125, 1, 0), //尼贝隆战舰椅
Array(3010127, 125, 1, 0), //扎昆宝座
Array(3012001, 125, 1, 0), //篝火
Array(3010136, 150, 1, 0), //6周年怪物王座
Array(3010155, 150 * 2, 1, 0), //暗影双刀的猫头鹰椅子
Array(3010144, 150 * 2, 1, 0), //七夕椅子
Array(3010149, 150 * 2, 1, 0), //猫咪风扇椅
Array(3010129, 150 * 2, 1, 0), //酋长宝座
Array(3010131, 150 * 2, 1, 0), //贪吃熊猫椅
Array(3010132, 150 * 2, 1, 0), //撒娇喵咪椅
Array(3010133, 150 * 2, 1, 0), //帐篷椅
Array(3010163, 150 * 2, 1, 0), //满月椅
// ------ 特殊奖品 --------------
//Array(4000385, 900, 1, 1), //心灯
//Array(4001465, 800, 20, 1), //爱心宝石
//Array(4110000, 700, 1, 1), //迷你抽奖用
// ------ 086添加 ------
Array(1003622, 100, 1, 1), //布莱克缤帽 
Array(1003621, 200, 1, 1), //混沌品克缤帽 
Array(1003780, 100, 1, 1), //自由品克缤帽 
Array(1003781, 100, 1, 1), //自由布莱克缤帽 
Array(1052526, 100, 1, 1), //混沌品克缤大衣 
Array(1052527, 100, 1, 1), //布莱克缤大衣 
Array(1052588, 100, 1, 1), //自由品克缤连身衣 
Array(1052589, 100, 1, 1), //自由布莱克缤连身衣 
Array(1212072, 100, 1, 1), //布莱克缤双头杖 
Array(1222067, 100, 1, 1), //布莱克缤灵魂手铳 
Array(1232064, 100, 1, 1), //布莱克缤亡命剑 
Array(1242069, 100, 1, 1), //布莱克缤能量剑 
Array(1242070, 100, 1, 1), //布莱克缤能量剑 
Array(1302070, 100, 1, 1), //布莱克缤单手剑 
Array(1312142, 100, 1, 1), //布莱克缤单手斧 
Array(1322100, 100, 1, 1), //布莱克缤单手钝器 
Array(1332214, 100, 1, 1), //布莱克缤短刀 
Array(1342079, 100, 1, 1), //布莱克缤双刀 
Array(1362081, 100, 1, 1), //布莱克缤手杖 
Array(1372168, 100, 1, 1), //布莱克缤短杖 
Array(1382199, 100, 1, 1), //布莱克缤长杖 
Array(1402185, 100, 1, 1), //布莱克缤双手剑 
Array(1412126, 100, 1, 1), //布莱克缤双手斧 
Array(1422129, 100, 1, 1), //布莱克缤双手钝器 
Array(1432158, 100, 1, 1), //布莱克缤长枪 
Array(1442209, 100, 1, 1), //布莱克缤长矛 
Array(1452196, 100, 1, 1), //布莱克缤弓 
Array(1462184, 100, 1, 1), //布莱克缤弩 
Array(1472205, 100, 1, 1), //布莱克缤拳套 
Array(1482159, 100, 1, 1), //布莱克缤指节 
Array(1492170, 100, 1, 1), //布莱克缤短枪 
Array(1522085, 100, 1, 1), //布莱克缤双弩枪 
Array(1532089, 100, 1, 1), //布莱克缤火炮 
Array(3010592, 100, 1, 1), //布莱克缤椅子
//暴君系列转蛋
Array(1072746, 50, 1, 1),//暴君利卡昂靴
Array(1082546, 50, 1, 1),//暴君利卡昂手套
Array(1102484, 50, 1, 1),//暴君利卡昂披风
Array(1132177, 50, 1, 1),//暴君利卡昂腰带

//冒险之心系列转蛋
Array(4033755, 800, 1, 0), //心之项链链子
Array(2431559, 780, 1, 1), //冒险岛勇士之心(飞侠)
Array(2431564, 750, 1, 1), //高级冒险岛勇士之心(飞侠)
//意志肩饰腰带转蛋
Array(4033667, 800, 1, 0),//意志盒

Array(1112915, 100, 1, 1) //蓝调戒指
);

function action(mode, type, selection) {
    if (mode == 1) {
        status++;
    } else {
        if (status == 0) {
            cm.sendOk("不想使用吗？…我的肚子里有各类#b奇特座椅或卷轴、装备、新奇道具#k哦！");
            cm.dispose();
        }
        status--;
    }
    if (status == 0) {
        if (cm.haveItem(5220040)) {
            cm.sendYesNo("冒险岛转蛋机中有各类#b装备、卷轴或稀有新奇的道具#k噢！使用“#b#t5220040##k”就可以交换. 游戏商城中的“其他”－“游戏”区里有噢。 假如不买转蛋券的话，是不可以使用我的。现在要玩转蛋机么? ");
        } else {
            cm.sendOk("你背包里有#b#t5220040##k吗?");
            cm.safeDispose();
        }
    } else if (status == 1) {
        var chance = Math.floor(Math.random() * 1000);
        var finalitem = Array();
        for (var i = 0; i < itemList.length; i++) {
            if (itemList[i][1] >= chance) {
                finalitem.push(itemList[i]);
            }
        }
        if (finalitem.length != 0) {
            var random = new java.util.Random();
            var finalchance = random.nextInt(finalitem.length);
            var itemId = finalitem[finalchance][0];
            var quantity = finalitem[finalchance][2];
            var notice = finalitem[finalchance][3];
			if (cm.haveItem(5220040) && cm.canHold()) {
				if (notice == 1) {
					item = cm.gainGachaponItem(itemId, quantity, "飞侠转蛋机");
				} else {
					cm.gainItem(itemId, quantity);
				}
                cm.gainItem(5220040, -1);
                cm.sendOk("你获得了 #b#t" + itemId + "##k " + quantity + "个。");
            } else {
                cm.sendOk("你确实有#b#t5220040##k吗？如果是，请你确认在背包的装备，消耗，其他窗口中是否有一格以上的空间。");
            }
            cm.safeDispose();
        } else {
            cm.sendOk("今天的运气可真差，什么都没有拿到。\r\n(获得了安慰奖：荣誉勋章 一个。)");
            cm.gainItem(5220040, -1);
            cm.gainItem(2431174, 1);
            cm.safeDispose();
        }
    } else {
		cm.dispose();
    }
}

