/*
 脚本：拍卖主菜单
 */
//时间引用
var ca = java.util.Calendar.getInstance();
var year = ca.get(java.util.Calendar.YEAR);
var month = ca.get(java.util.Calendar.MONTH) + 1;
var day = ca.get(java.util.Calendar.DATE);
var hour = ca.get(java.util.Calendar.HOUR_OF_DAY);
var minute = ca.get(java.util.Calendar.MINUTE);
var second = ca.get(java.util.Calendar.SECOND);
var weekday = ca.get(java.util.Calendar.DAY_OF_WEEK);
//素材引用
var JT = "#fUI/Basic/BtHide3/mouseOver/0#";
var 心 = "#fUI/GuildMark.img/Mark/Etc/00009001/14#";
var r = "#fUI/UIWindow.img/Quest/TimeQuest/AlarmClock/default/0/0#";
var 闹钟图标 = "#fUI/UIWindow.img/Quest/TimeQuest/AlarmClock/default/0/0#";
var 音符 = "#fEffect/CharacterEff/1003276/0/0#";
var 爱心 = "#fEffect/CharacterEff/1022223/4/0#";
var 红色箭头 = "#fUI/UIWindow/Quest/icon6/7#";
var 蓝色角点 = "#fUI/UIWindow.img/PvP/Scroll/enabled/next2#";
var aaa = "#fUI/UIWindow.img/Quest/icon9/0#";
var zzz = "#fUI/UIWindow.img/Quest/icon8/0#";
var sss = "#fUI/UIWindow.img/QuestIcon/3/0#";
var 心 = "#fUI/GuildMark.img/Mark/Etc/00009001/14#";
var ca = java.util.Calendar.getInstance();
var year = ca.get(java.util.Calendar.YEAR); //获得年份
var month = ca.get(java.util.Calendar.MONTH) + 1; //获得月份
var day = ca.get(java.util.Calendar.DATE);//获取日
var hour = ca.get(java.util.Calendar.HOUR_OF_DAY); //获得小时
var minute = ca.get(java.util.Calendar.MINUTE);//获得分钟
var second = ca.get(java.util.Calendar.SECOND); //获得秒
var weekday = ca.get(java.util.Calendar.DAY_OF_WEEK);
var 正方箭头 = "#fUI/Basic/BtHide3/mouseOver/0#";
var 爱心 = "#fEffect/CharacterEff/1022223/4/0#";
var 大粉红爱心 = "#fItem/Etc/0427/04270001/Icon8/4#";  //
var 小粉红爱心 = "#fItem/Etc/0427/04270001/Icon8/5#";  //
var 小黄星 = "#fItem/Etc/0427/04270001/Icon9/0#";  //
var 大黄星 = "#fItem/Etc/0427/04270001/Icon9/1#";  //
var 小水滴 = "#fItem/Etc/0427/04270001/Icon10/5#";  //
var 大水滴 = "#fItem/Etc/0427/04270001/Icon10/4#";  //
var tz = "#fEffect/CharacterEff/1082565/4/0#";  //粉兔子
var tz1 = "#fEffect/CharacterEff/1082565/0/0#";  //橙兔子
var tz2 = "#fEffect/CharacterEff/1082565/2/0#";  //蓝兔子
var 邪恶小兔 = "#fEffect/CharacterEff/1112960/3/0#";  //邪恶小兔 【小】
var 邪恶小兔2 = "#fEffect/CharacterEff/1112960/3/1#";  //邪恶小兔 【大】
var 花草 ="#fEffect/SetEff/208/effect/walk2/4#";
var 花草1 ="#fEffect/SetEff/208/effect/walk2/3#";
var 小花 ="#fMap/MapHelper/weather/birthday/2#";
var 桃花 ="#fMap/MapHelper/weather/rose/4#";
var 金枫叶 ="#fMap/MapHelper/weather/maple/2#";
var 红枫叶 ="#fMap/MapHelper/weather/maple/1#";
var 银杏叶 ="#fMap/MapHelper/weather/maple/3#";
var 小烟花 ="#fMap/MapHelper/weather/squib/squib4/1#";
var 星星 ="#fMap/MapHelper/weather/witch/3#";
status = -1;
var need = 200;
var itemList = Array(
            Array(3015304,200,1,1), //红伞椅子
			Array(3015406,200,1,1), //红伞椅子
			Array(3015407,200,1,1), //红伞椅子
			Array(3010070,200,1,1), //红伞椅子
			Array(3015051,200,1,1), //红伞椅子
			Array(3010416,200,1,1), //红伞椅子
			Array(3010044,600,1,1), //红伞椅子
			Array(3010036,600,1,1), //秋千
			Array(3010049,600,1,1), //学房子
			Array(3010110,600,1,1), //熊
			Array(3010131,600,1,1), //熊猫
			Array(1022129,50,1,1), //眼睛
			Array(3012001,600,1,1), //篝火 
			Array(3012002,600,1,1), //浴桶
			Array(3012003,600,1,1), //爱心
			Array(3010013,600,1,1), //遮阳椅
			Array(3010018,600,1,1), //椰子树
			Array(3010021,600,1,1), //暖暖桌
			Array(3010024,600,1,1), //玩具熊
			Array(3010025,600,1,1), //5周年枫叶纪念
			Array(3010026,600,1,1), //恶灵附身
			Array(3010034,600,1,1), //假期红
			Array(3010035,600,1,1), //假期蓝
			Array(3010043,600,1,1), //魔女扫把
			Array(3010051,600,1,1), //沙漠兔兔1
			Array(3010052,600,1,1), //沙漠兔兔2
			Array(3010054,600,1,1), //呼噜床
			Array(3010057,600,1,1), //血色玫瑰
			Array(3010058,600,1,1), //世界末日
			Array(3010063,600,1,1), //月亮星星
			Array(3010068,600,1,1), //露水椅子
			Array(3010069,600,1,1), //大黄蜂
			Array(3010071,600,1,1), //神兽椅子
			Array(3010075,600,1,1), //大熊猫
			Array(3010079,600,1,1), //肥猫
			Array(3010085,600,1,1), //鬼娃娃椅子
			Array(3010096,600,1,1), //恐龙化石
			Array(3010099,600,1,1), //北极熊椅子
			Array(3010109,600,1,1), //暖炉椅子
			Array(3010110,600,1,1), //白熊
			Array(3010129,600,1,1), //酋长宝座
			Array(3010139,600,1,1), //私密空间
			Array(3010140,600,1,1), //早日康复
			Array(3010147,600,1,1), //龙蛋椅子
			Array(3010149,600,1,1), //风扇
			Array(3010151,600,1,1), //无人岛
			Array(3010151,600,1,1), //三角张峰
			Array(3010169,600,1,1), //求领养
			Array(3010172,600,1,1), //星空椅子
			Array(3010175,600,1,1), //名画家椅子
			Array(3010193,600,1,1), //炼金瓶
			Array(3010195,600,1,1), //无价之宝
			Array(3010195,600,1,1), //泡泡浴缸
			Array(3010289,600,1,1), //老奶奶读通话
			Array(3010293,600,1,1), //恶灵椅子
			Array(3010403,600,1,1), //音乐会
			Array(3010410,600,1,1), //珍妮
			Array(3010411,600,1,1), //双鱼
			Array(3010412,600,1,1), //双塔
			Array(3010428,600,1,1), //水晶
			Array(3010437,600,1,1), //魔法书
			Array(3010438,600,1,1), //音符
			Array(3010453,600,1,1), //兔子
			Array(3010454,600,1,1), //爱心云朵
			Array(3010462,600,1,1), //天文台
			Array(3010494,600,1,1), //TV椅子
			Array(3010505,600,1,1), //看球赛
			Array(3010515,600,1,1), //奇石椅子
			Array(3010609,600,1,1), //不是在做梦
			Array(3010622,600,1,1), //丹真
			Array(3010632,600,1,1), //印第安
			Array(3010633,600,1,1), //印第安
			Array(3010659,600,1,1), //巴士
			Array(3010716,600,1,1), //超级蘑菇
			Array(3010729,600,1,1), //孤独男子
			Array(3010730,600,1,1), //电视椅子
			Array(3010738,600,1,1), //闪电三人组
			Array(3010739,600,1,1), //雪人香波
			Array(3010753,600,1,1), //玫瑰鸟笼
			Array(3010767,600,1,1), //雪人椅子
			Array(3010760,600,1,1), //古代浴池
			Array(1912446,600,1,1), //人鱼
			Array(1902446,600,1,1), //人鱼
			Array(3010879,600,1,1), //繁星
			Array(3010937,600,1,1), //异界
			Array(3010938,600,1,1), //异界
			Array(3010939,600,1,1), //异界
			Array(3010946,600,1,1), //森林伙伴
			Array(3012007,600,1,1), //石狮
			Array(3012008,600,1,1), //稻荷神社
			Array(3012011,600,1,1), //火锅
			Array(3012022,600,1,1), //寿司
			Array(3015053,600,1,1), //三重杨
			Array(3015120,600,1,1), //枕头大战
			Array(3015264,600,1,1), //美味厨房
			Array(3015158,600,1,1), //印第安
			Array(3010291,600,1,1), //病床
			Array(3010428,600,1,1), //水晶
			Array(3010492,600,1,1), //首脑
			Array(3010435,600,1,1), //千年狐狸
			Array(3010494,600,1,1), //TV
			Array(3010511,600,1,1), //公园
			Array(3010512,600,1,1), //半半
			Array(3010589,600,1,1), //充电
			Array(3010600,600,1,1), //福星
			Array(3010601,600,1,1), //竹篮
			Array(3010620,600,1,1), //泄愤
			Array(3010664,600,1,1), //进化
			Array(3010678,600,1,1), //还加吨
			Array(3010680,600,1,1), //公主
			Array(3010739,600,1,1), //香波
			Array(3010744,600,1,1), //积木
			Array(3010795,600,1,1), //栖息
			Array(3010806,600,1,1), //放飞
			Array(3010894,600,1,1), //咖啡
			Array(3012030,600,1,1), //公主
			Array(3015100,600,1,1), //公主
			Array(3015183,600,1,1), //公主
			Array(3015312,600,1,1), //公主
			Array(3012011,600,1,1), //火锅
Array(1032026, 500, 1, 1), //黄水晶耳环
Array(1032027, 500, 1, 1), //黑水晶耳环
Array(1032028, 500, 1, 1), //红水晶耳环
Array(1032035, 500, 1, 1), //枫叶耳环
Array(1032042, 500, 1, 1), //枫叶型耳环
Array(1032047, 500, 1, 1), //可乐耳环
Array(1002391, 600, 1, 1), //海盗头巾(绿)
Array(1002392, 600, 1, 1), //海盗头巾(红)
Array(1002393, 600, 1, 1), //海盗头巾(粉)
Array(1002394, 600, 1, 1), //海盗头巾(灰)
Array(1002395, 600, 1, 1), //海盗头巾(紫)
Array(1002418, 100, 1, 1), //废报纸头盔
Array(1002436, 600, 1, 1), //长老斯坦之帽
Array(1002550, 600, 1, 1), //黑色格莱西头盔
Array(1002562, 600, 1, 1), //青苹果帽
Array(1002583, 600, 1, 1), //蝙蝠客头套
Array(1002622, 600, 1, 1), //水兵帽
Array(1002677, 300, 1, 1), //玩具匠人帽
Array(1002699, 300, 1, 1), //南瓜帽子
//------披风------
Array(1102040, 500, 1, 1), //浪人披风(黄)
Array(1102041, 50, 1, 1), //浪人披风(粉)
Array(1102042, 50, 1, 1), //浪人披风(紫)
Array(1102043, 500, 1, 1), //浪人披风(褐)
Array(1102140, 400, 1, 1), //卡帕莱特披风
Array(1102147, 420, 1, 1), //玩具匠人披风
Array(1102172, 400, 1, 1), //永恒不灭披风
Array(1102174, 400, 1, 1), //工作人员披风
Array(1102166, 400, 1,1), //枫叶披风
Array(1102167, 400, 1, 1), //枫叶披风
Array(1102168, 400, 1, 1), //枫叶披风
Array(1082135, 600, 1, 1), //侠盗手套(蓝)
Array(1082136, 600, 1, 1), //侠盗手套(绿)
Array(1082137, 600, 1, 1), //侠盗手套(红)
Array(1082138, 600, 1, 1), //侠盗手套(黑)
Array(1082139, 600, 1, 1), //混天手套(黄)
Array(1082140, 600, 1, 1), //混天手套(紫)
Array(1082141, 600, 1, 1), //混天手套(褐)
Array(1082142, 600, 1, 1), //幻光手套(蓝)
Array(1082143, 600, 1, 1), //幻光手套(紫)
Array(1082144, 600, 1, 1), //幻光手套(红)
Array(1082145, 300, 1, 1), //工地手套(黄)
Array(1082146, 300, 1, 1), //工地手套(红)
Array(1082147, 300, 1, 1), //工地手套(蓝)
Array(1082148, 300, 1, 1), //工地手套(紫)
Array(1082149, 50, 1, 1), //工地手套(褐)
Array(1082150, 300, 1, 1), //工地手套(灰)
Array(1082151, 350, 1, 1), //幻魔手套(绿)
Array(1082152, 350, 1, 1), //幻魔手套(蓝)
Array(1082153, 350, 1, 1), //幻魔手套(红)
Array(1082154, 350, 1, 1), //幻魔手套(黑)
Array(1082158, 300, 1, 1), //红色条纹手套
Array(1082159, 300, 1, 1), //蓝色条纹手套
Array(1082160, 300, 1, 1), //绿色条纹手套
Array(1082163, 300, 1, 1), //红猎人手套
Array(1082164, 300, 1, 1), //蓝色元素手套
Array(1082167, 300, 1, 1), //黑色格丽纳手套
Array(1082168, 5, 1, 1), //青龙手套
Array(1082175, 5, 1, 1), //马绍尔手套(赤)
Array(1082176, 5, 1, 1), //马绍尔手套(青)
Array(1082177, 5, 1, 1), //马绍尔手套(紫
Array(1082178, 5, 1, 1), //马绍尔手套(桃)
Array(1082179, 5, 1, 1), //马绍尔手套(黄)
Array(1082234, 1, 1, 1), //永恒定边手套
Array(1082235, 1, 1, 1), //永恒逍遥手套
Array(1082236, 1, 1, 1), //永恒白云手套
Array(1082237, 1, 1, 1), //永恒探云手套
Array(1082238, 1, 1, 1), //永恒抚浪手套
Array(1082239, 1, 1, 1), //重生定边手套
Array(1082240, 1, 1, 1), //重生逍遥手套
Array(1082241, 1, 1, 1), //重生白云手套
Array(1082242, 1, 1, 1), //重生探云手套
Array(1082243, 1, 1, 1), //重生抚浪手套
//-------武器------
Array(1302016, 100, 1, 1), //黄色雨伞
Array(1302017, 100, 1, 1), //蓝色雨伞
Array(1302018, 100, 1, 1), //汤勺
Array(1302019, 100, 1, 1), //无名剑
Array(1302020, 100, 1, 1), //枫叶战剑
Array(1302021, 100, 1, 1), //橡皮榔头
Array(1302022, 100, 1, 1), //竹刀
Array(1302023, 100, 1, 1), //六脉神剑
Array(1302024, 100, 1, 1), //废报纸卷
Array(1302025, 100, 1, 1), //红雨伞
Array(1302026, 100, 1, 1), //黑雨伞
Array(1302027, 100, 1, 1), //绿雨伞
Array(1302028, 100, 1, 1), //紫雨伞
Array(1302029, 100, 1, 1), //褐雨伞
Array(1302030, 100, 1, 1), //枫叶剑
Array(1302031, 100, 1, 1), //七星剑
Array(1302032, 100, 1, 1), //烈焰之剑
Array(1302035, 100, 1, 1), //枫叶旗
Array(1302036, 100, 1, 1), //枫叶旗
Array(1302042, 100, 1, 1), //汤勺
Array(1302043, 100, 1, 1), //战剑
Array(1302044, 100, 1, 1), //树灵之剑
Array(1302045, 100, 1, 1), //奇型刀
Array(1302046, 100, 1, 1), //奇型刀
Array(1302047, 100, 1, 1), //汤勺
Array(1302049, 100, 1, 1), //光线鞭子
Array(1302051, 100, 1, 1), //树灵之剑
Array(1302058, 100, 1, 1), //冒险岛伞
Array(1302059, 100, 1, 1), //狂龙闪电剑
Array(1302061, 100, 1, 1), //蔓藤鞭子
Array(1302063, 100, 1, 1), //燃烧的火焰刀
Array(1302064, 100, 1, 1), //枫叶突击剑
Array(1302066, 100, 1, 1), //枫叶3年旗
Array(1302067, 100, 1, 1), //枫叶庆典旗
Array(1302068, 100, 1, 1), //薄光刃
Array(1302077, 100, 1, 1), //新手战士之剑
Array(1302080, 100, 1, 1), //七彩霓虹灯泡
Array(1302081, 120, 1, 1), //永恒破甲剑
Array(1302084, 240, 1, 1), //火柴
Array(1302085, 240, 1, 1), //叉子
Array(1302086, 100, 1, 1), //重生破甲剑
Array(1302087, 100, 1, 1), //火炬
Array(1302104, 100, 1, 1), //鱿鱼剑
Array(1312000, 600, 1, 1), //双刃斧
Array(1312001, 600, 1, 1), //战斗斧
Array(1312002, 600, 1, 1), //镰刀
Array(1312012, 600, 1, 1), //乾坤圈
Array(1312030, 600, 1, 1), //烛影摇红
Array(1312031, 600, 1, 1), //狂龙怒斩
Array(1312032, 600, 1, 1), //枫叶破击斧
Array(1312033, 600, 1, 1), //枫叶3年旗
Array(1312034, 600, 1, 1), //粉色花边游泳圈
Array(1312037, 100, 1, 1), //永恒断蚺斧
Array(1312038, 100, 1, 1), //重生断蚺斧
Array(1322003, 600, 1, 1), //棒棒果
Array(1322004, 600, 1, 1), //奇型锤
Array(1322006, 600, 1, 1), //钢管
Array(1322007, 600, 1, 1), //皮制手提包
Array(1322008, 600, 1, 1), //007提包
Array(1322009, 100, 1, 1), //马桶吸
Array(1322010, 600, 1, 1), //方形铁铲
Array(1322011, 600, 1, 1), //三角铁铲
Array(1322012, 100, 1, 1), //红色砖头
Array(1322021, 600, 1, 1), //黑游泳圈
Array(1322022, 600, 1, 1), //红花纹游泳圈
Array(1322023, 600, 1, 1), //蓝花纹游泳圈
Array(1322024, 600, 1, 1), //紫游泳圈
Array(1322025, 600, 1, 1), //救命游泳圈
Array(1322026, 600, 1, 1), //彩虹游泳圈
Array(1322027, 100, 1, 1), //米伽勒的平底锅
Array(1322028, 600, 1, 1), //钉头锤
Array(1322029, 600, 1, 1), //雷神钉
Array(1322031, 600, 1, 1), //葵花宝典
Array(1322032, 600, 1, 1), //铁头锤
Array(1322033, 600, 1, 1), //鬼怪棒
Array(1322034, 600, 1, 1), //铁棍
Array(1322035, 600, 1, 1), //大战斗锤
Array(1322036, 600, 1, 1), //旋风锤
Array(1322037, 600, 1, 1), //巨型锤
Array(1322038, 600, 1, 1), //暴风锤
Array(1322051, 600, 1, 1), //七夕
Array(1322052, 600, 1, 1), //狂龙地锤
Array(1322054, 600, 1, 1), //枫叶地震锤
Array(1322055, 600, 1, 1), //枫叶3年旗
Array(1322056, 600, 1, 1), //粉色花边游泳圈
Array(1322060, 100, 1, 1), //永恒惊破天
Array(1322061, 50, 1, 1), //重生惊破天
Array(1322071, 600, 1, 1), //采矿铁锹
Array(1332052, 100, 1, 1), //阴风碎魂刃
Array(1332053, 100, 1, 1), //野外烧烤串
Array(1332054, 100, 1, 1), //闪电飞刀
Array(1332055, 100, 1, 1), //枫叶锁魄铗
Array(1332056, 100, 1, 1), //枫叶追魂刺
Array(1332057, 100, 1, 1), //枫叶3年旗
Array(1332059, 100, 1, 1), //粉色花边游泳圈
Array(1332063, 100, 1, 1), //初级盗贼的短剑
Array(1332066, 100, 1, 1), //新手刮胡刀
Array(1332073, 100, 1, 1), //永恒狂鲨锯
Array(1332074, 100, 1, 1), //永恒断首刃
Array(1332075, 100, 1, 1), //重生狂鲨锯
Array(1332076, 100, 1, 1), //重生断首刃
Array(1372008, 600, 1, 1), //金属短杖
Array(1372009, 600, 1, 1), //慈悲为怀
Array(1372010, 600, 1, 1), //嗜魂法杖
Array(1372011, 600, 1, 1), //羽扇
Array(1372012, 600, 1, 1), //水晶短杖
Array(1372013, 600, 1, 1), //竹杖
Array(1372014, 600, 1, 1), //火焰之杖
Array(1372015, 600, 1, 1), //天使之翼
Array(1372016, 600, 1, 1), //凤凰短杖
Array(1372017, 600, 1, 1), //领路灯
Array(1372018, 600, 1, 1), //法师短杖
Array(1372019, 100, 1, 1), //大魔法师短杖
Array(1372028, 100, 1, 1), //大魔法师短杖
Array(1372029, 100, 1, 1), //火焰之杖
Array(1372030, 100, 1, 1), //天使之翼
Array(1372031, 100, 1, 1), //圣贤短杖
Array(1372032, 100, 1, 1), //佘太君龙杖
Array(1372033, 100, 1, 1), //圣贤短杖
Array(1372034, 100, 1, 1), //枫叶仙姬杖
Array(1372035, 100, 1, 1), //火灵珠短杖
Array(1372036, 100, 1, 1), //毒灵珠短杖
Array(1372037, 100, 1, 1), //冰灵珠短杖
Array(1372038, 100, 1, 1), //雷灵珠短杖
Array(1372039, 100, 1, 1), //爆炎之杖
Array(1372040, 100, 1, 1), //剧毒之杖
Array(1372041, 100, 1, 1), //寒冰之杖
Array(1372042, 100, 1, 1), //狂雷之杖
Array(1372043, 100, 1, 1), //初级魔法师的杖
Array(1372044, 100, 1, 1), //永恒蝶翼杖
Array(1372045, 100, 1, 1), //重生蝶翼杖
Array(1382005, 600, 1, 1), //祖母綠长杖
Array(1382006, 600, 1, 1), //白龙之杖
Array(1382007, 600, 1, 1), //魔灵之翼
Array(1382008, 600, 1, 1), //魔灵之魂
Array(1382009, 600, 1, 1), //枫叶权杖
Array(1382010, 600, 1, 1), //死灵法杖
Array(1382011, 600, 1, 1), //枫树杖
Array(1382012, 600, 1, 1), //枫叶杖
Array(1382013, 600, 1, 1), //烈焰之杖
Array(1382014, 600, 1, 1), //孙家之杖
Array(1382015, 500, 1, 1), //毒蘑菇
Array(1382016, 500, 1, 1), //香菇
Array(1382017, 100, 1, 1), //金轮杖
Array(1382018, 100, 1, 1), //翡翠之杖
Array(1382019, 100, 1, 1), //护法之杖
Array(1382020, 100, 1, 1), //精灵长杖
Array(1382021, 100, 1, 1), //白龙之杖
Array(1382022, 100, 1, 1), //魔灵之翼
Array(1382023, 100, 1, 1), //死灵法杖
Array(1382024, 100, 1, 1), //魔灵之魂
Array(1382025, 100, 1, 1), //精灵长杖
Array(1382026, 100, 1, 1), //白龙之杖
Array(1382027, 100, 1, 1), //魔灵之翼
Array(1382028, 100, 1, 1), //死灵法杖
Array(1382029, 100, 1, 1), //魔灵之魂
Array(1382030, 100, 1, 1), //精灵长杖
Array(1382031, 100, 1, 1), //白龙之杖
Array(1382032, 100, 1, 1), //魔灵之翼
Array(1382033, 100, 1, 1), //死灵法杖
Array(1382034, 100, 1, 1), //魔灵之魂
Array(1382035, 100, 1, 1), //冰肌玲珑杖
Array(1382036, 100, 1, 1), //黑精灵王杖
Array(1382037, 100, 1, 1), //偃月之杖
Array(1382039, 100, 1, 1), //枫叶丹心杖
Array(1382040, 100, 1, 1), //枫叶3年旗
Array(1382041, 100, 1, 1), //夜行權杖
Array(1382042, 100, 1, 1), //粉色花边游泳圈
Array(1382045, 100, 1, 1), //火灵珠长杖
Array(1382046, 100, 1, 1), //毒灵珠长杖
Array(1382047, 100, 1, 1), //冰灵珠长杖
Array(1382048, 100, 1, 1), //雷灵珠长杖
Array(1382049, 100, 1, 1), //朱雀长杖
Array(1382050, 100, 1, 1), //玄武长杖
Array(1382051, 100, 1, 1), //白虎长杖
Array(1382052, 100, 1, 1), //青龙长杖
Array(1382057, 100, 1, 1), //永恒冰轮杖
Array(1382059, 100, 1, 1), //重生冰轮杖
Array(1402011, 600, 1, 1), //无极剑
Array(1402012, 600, 1, 1), //霸王剑
Array(1402013, 600, 1, 1), //白日剑
Array(1402014, 50, 1, 1), //温度计
Array(1402015, 100, 1, 1), //亚历山大之剑
Array(1402016, 100, 1, 1), //所罗门之剑
Array(1402017, 100, 1, 1), //船长佩剑
Array(1402037, 1, 1, 1), //龙背刃
Array(1402039, 300, 1, 1), //枫叶枭首剑
Array(1402040, 300, 1, 1), //枫叶3年旗
Array(1402041, 300, 1, 1), //粉色花边游泳圈
Array(1402044, 300, 1, 1), //南瓜灯笼
Array(1402046, 300, 1, 1), //永恒玄冥剑
Array(1402047, 1, 1, 1), //重生玄冥剑
Array(1412007, 600, 1, 1), //光明斧
Array(1412008, 600, 1, 1), //雷电斧
Array(1412009, 600, 1, 1), //大力神之斧
Array(1412021, 600, 1, 1), //龙魂祭
Array(1412022, 600, 1, 1), //太阳之斧
Array(1412023, 600, 1, 1), //光明斧
Array(1412024, 600, 1, 1), //雷电斧
Array(1412025, 600, 1, 1), //大力神之斧
Array(1412026, 600, 1, 1), //炼狱魔龙斧
Array(1412027, 600, 1, 1), //枫叶乾坤轮
Array(1412028, 600, 1, 1), //枫叶3年旗
Array(1412029, 600, 1, 1), //粉色花边游泳圈
Array(1412033, 100, 1, 1), //永恒碎鼋斧
Array(1412034, 100, 1, 1), //重生碎鼋斧
Array(1422004, 600, 1, 1), //板手
Array(1422005, 600, 1, 1), //黄金锤
Array(1422006, 600, 1, 1), //十字镐
Array(1422007, 600, 1, 1), //巨人锤
Array(1422008, 600, 1, 1), //大锤
Array(1422009, 600, 1, 1), //妖精之锤
Array(1422010, 600, 1, 1), //封魂之锤
Array(1422011, 600, 1, 1), //酒瓶
Array(1422012, 600, 1, 1), //雷神之锤
Array(1422013, 600, 1, 1), //狮子之魂
Array(1422014, 600, 1, 1), //枫叶锤
Array(1422015, 600, 1, 1), //黄金锤
Array(1422028, 600, 1, 1), //金龙轰天锤
Array(1422029, 600, 1, 1), //枫叶轰天镗
Array(1422030, 100, 1, 1), //粉红海豹抱枕
Array(1422031, 100, 1, 1), //蓝色海豹抱枕
Array(1422032, 600, 1, 1), //枫叶3年旗
Array(1422033, 600, 1, 1), //粉色花边游泳圈
Array(1422036, 600, 1, 1), //玩具匠人的锤子
Array(1422037, 100, 1, 1), //永恒威震天
Array(1422038, 100, 1, 1), //重生威震天
Array(1432008, 100, 1, 1), //海神叉
Array(1432009, 100, 1, 1), //木精灵枪
Array(1432010, 100, 1, 1), //奥丁手戟
Array(1432011, 100, 1, 1), //寒冰破魔枪
Array(1432012, 100, 1, 1), //枫叶枪
Array(1432013, 100, 1, 1), //南瓜枪
Array(1432014, 100, 1, 1), //海神叉
Array(1432015, 100, 1, 1), //红色滑雪板
Array(1432016, 100, 1, 1), //橙色滑雪板
Array(1432017, 100, 1, 1), //绿色滑雪板
Array(1432018, 100, 1, 1), //蓝色滑雪板
Array(1432007, 100, 1, 1), //银龙枪
Array(1432030, 100, 1, 1), //红莲落神枪
Array(1432037, 100, 1, 1), //枫叶大将旗
Array(1432038, 300, 1, 1), //盘龙七冲枪
Array(1432039, 100, 1, 1), //钓鱼竿
Array(1432040, 100, 1, 1), //枫叶钻天枪
Array(1432041, 100, 1, 1), //枫叶3年旗
Array(1432042, 100, 1, 1), //粉色花边游泳圈
Array(1432046, 500, 1, 1), //圣诞树手杖
Array(1432047, 100, 1, 1), //永恒显圣枪
Array(1432048, 100, 1, 1), //铲子
Array(1432049, 100, 1, 1), //重生显圣枪
Array(1442002, 600, 1, 1), //月灵戟
Array(1442003, 600, 1, 1), //斧戟
Array(1442004, 600, 1, 1), //拖把
Array(1442005, 600, 1, 1), //九龙刀
Array(1442006, 600, 1, 1), //蓝铁锤
Array(1442007, 600, 1, 1), //幻影
Array(1442008, 600, 1, 1), //黄龙刀
Array(1442009, 600, 1, 1), //月牙戟
Array(1442010, 600, 1, 1), //方天戟
Array(1442011, 600, 1, 1), //冲浪板
Array(1442012, 100, 1, 1), //天空雪板
Array(1442013, 100, 1, 1), //沧海雪板
Array(1442014, 100, 1, 1), //银雪板
Array(1442015, 100, 1, 1), //黄金雪板
Array(1442016, 100, 1, 1), //黑雪板
Array(1442017, 100, 1, 1), //赤血雪板
Array(1442019, 100, 1, 1), //月神刀
Array(1442020, 100, 1, 1), //巨灵开山斧
Array(1442021, 100, 1, 1), //黄拖把
Array(1442022, 100, 1, 1), //白拖把
Array(1442023, 100, 1, 1), //黑拖把
Array(1442024, 100, 1, 1), //枫叶矛
Array(1442025, 100, 1, 1), //青龙偃月刀
Array(1442026, 100, 1, 1), //红色冲浪板
Array(1442027, 100, 1, 1), //绿色冲浪板
Array(1442028, 100, 1, 1), //蓝色冲浪板
Array(1442029, 100, 1, 1), //紫色冲浪板
Array(1442030, 100, 1, 1), //枫之雪板
Array(1442039, 100, 1, 1), //冻冻鱼
Array(1442040, 100, 1, 1), //九龙刀
Array(1442041, 100, 1, 1), //方天戟
Array(1442042, 100, 1, 1), //黄龙刀
Array(1442043, 100, 1, 1), //月神刀
Array(1442044, 100, 1, 1), //战魂斗杀戟
Array(1442045, 100, 1, 1), //血龙神斧
Array(1442046, 100, 1, 1), //超级滑雪板
Array(1442051, 100, 1, 1), //枫叶强袭斧
Array(1442052, 100, 1, 1), //枫叶3年旗
Array(1442053, 100, 1, 1), //粉色花边游泳圈
Array(1442054, 100, 1, 1), //红色滑水板
Array(1442055, 100, 1, 1), //绿色滑水板
Array(1442056, 100, 1, 1), //蓝色滑水板
Array(1442057, 100, 1, 1), //紫色滑水板
Array(1442063, 100, 1, 1), //永恒神光戟
Array(1442065, 600, 1, 1), //蓝色冲浪板
Array(1442066, 600, 1, 1), //红色冲浪板
Array(1442067, 1, 1, 1), //重生神光戟
Array(1442069, 600, 1, 1), //红色冲浪板
Array(1442070, 600, 1, 1), //绿色冲浪板
Array(1452018, 100, 1, 1), //天蝎之弓
Array(1452019, 100, 1, 1), //天鹰弓(白)
Array(1452020, 100, 1, 1), //天鹰弓(黄)
Array(1452021, 100, 1, 1), //天鹰弓(黑)
Array(1452022, 100, 1, 1), //枫叶弓
Array(1452025, 100, 1, 1), //蓝色梅杜斯
Array(1452026, 100, 1, 1), //黑色梅杜斯
Array(1452044, 100, 1, 1), //金龙振翅弓
Array(1452045, 600, 1, 1), //枫叶HAPPY弓
Array(1452046, 600, 1, 1), //枫叶3年旗
Array(1452048, 600, 1, 1), //粉色花边游泳圈
Array(1452051, 600, 1, 1), //初级弓手的弓
Array(1452057, 1, 1, 1), //永恒惊电弓
Array(1452059, 1, 1, 1), //重生惊电弓
Array(1462014, 100, 1, 1), //枫叶玉弩
Array(1462015, 100, 1, 1), //光圣鹞弩(白)
Array(1462016, 100, 1, 1), //金圣鹞弩(黄)
Array(1462017, 100, 1, 1), //黑暗圣鹞弩
Array(1462018, 100, 1, 1), //红炎神机弩
Array(1462019, 100, 1, 1), //枫叶弩
Array(1462039, 100, 1, 1), //黄金飞龙弩
Array(1462050, 1, 1, 1), //永恒冥雷弩
Array(1462051, 1, 1, 1), //重生冥雷弩
Array(1462040, 600, 1, 1), //枫叶击星弩
Array(1462041, 600, 1, 1), //枫叶3年旗
Array(1462043, 600, 1, 1), //粉色花边游泳圈
Array(1462050, 100, 1, 1), //永恒冥雷弩
Array(1462051, 100, 1, 1), //重生冥雷弩
Array(1472003, 600, 1, 1), //黄金拳套
Array(1472043, 600, 1, 1), //龙之拳
Array(1472045, 600, 1, 1), //朱矿斗拳
Array(1472046, 600, 1, 1), //黑手甲
Array(1472047, 600, 1, 1), //黑战神拳套
Array(1472048, 600, 1, 1), //黑闪电甲
Array(1472049, 600, 1, 1), //龙之拳
Array(1472051, 600, 1, 1), //寒木升龙拳
Array(1472052, 600, 1, 1), //碧水落龙拳
Array(1472053, 600, 1, 1), //逆龙咆哮拳
Array(1472054, 600, 1, 1), //信玄
Array(1472055, 600, 1, 1), //枫叶定天拳
Array(1472056, 600, 1, 1), //枫叶3年旗
Array(1472058, 600, 1, 1), //粉色花边游泳圈
Array(1472061, 600, 1, 1), //初级飞侠拳套
Array(1472063, 600, 1, 1), //魔法手套
Array(1472068, 100, 1, 1), //永恒大悲赋
Array(1472071, 100, 1, 1), //重生大悲赋
Array(1482007, 100, 1, 1), //蛇吻
Array(1482008, 100, 1, 1), //列翼拳甲
Array(1482009, 100, 1, 1), //强袭拳甲
Array(1482010, 100, 1, 1), //破坏者
Array(1482011, 100, 1, 1), //三刃雪钩
Array(1482012, 100, 1, 1), //剑龙拳甲
Array(1482013, 100, 1, 1), //撕裂者
Array(1482014, 100, 1, 1), //新手专用指套
Array(1482015, 100, 1, 1), //轻型覆拳甲
Array(1482016, 100, 1, 1), //轻型蛇吻
Array(1482017, 100, 1, 1), //比翼鸟
Array(1482018, 100, 1, 1), //突击拳甲
Array(1482019, 100, 1, 1), //冲击者
Array(1482023, 1, 1, 1), //永恒孔雀翎
Array(1482024, 1, 1, 1), //重生孔雀翎
Array(1482025, 100, 1, 1), //粉色花边游泳圈
Array(1482030, 100, 1, 1), //枫叶3年旗
Array(1492009, 100, 1, 1), //重装手铳
Array(1492010, 100, 1, 1), //雷明顿
Array(1492011, 100, 1, 1), //鲁格
Array(1492012, 100, 1, 1), //金枪
Array(1492013, 100, 1, 1), //枭龙
Array(1492015, 100, 1, 1), //镀银枪
Array(1492016, 100, 1, 1), //猞猁
Array(1492017, 100, 1, 1), //急速手铳
Array(1492018, 100, 1, 1), //集火手铳
Array(1492019, 100, 1, 1), //德林杰
Array(1492023, 1, 1, 1), //永恒凤凰铳
Array(1492025, 1, 1, 1), //重生凤凰铳
Array(1492026, 600, 1, 1), //粉色花边游泳圈
Array(1492034, 600, 1, 1), //枫叶3年旗
//------药水------
Array(2000004, 900, 20, 1), //特殊药水
Array(2000005, 700, 20, 1), //超级药水
Array(2000005, 900, 30, 1), //超级药水
Array(2022245, 850, 5, 1), //心跳停止糖
Array(1382013, 200, 1, 1), //烈焰之杖
Array(1382015, 100, 1, 1), //毒蘑菇
Array(1002914, 100, 1, 1), //盖福克斯的帽子(力量)
Array(1002915, 100, 1, 1), //盖福克斯的帽子(敏捷)
Array(1002916, 100, 1, 1), //盖福克斯的帽子(智力)
Array(1002917, 100, 1, 1), //盖福克斯的帽子(幸运)
Array(1132000, 200, 1, 1), //白色腰带
Array(1132001, 200, 1, 1), //黄色腰带
Array(1132002, 200, 1, 1), //蓝色腰带
Array(1132003, 200, 1, 1), //红色腰带
Array(1132004, 250, 1, 1), //黑贺腰带
Array(1132010, 200, 1, 1), //黄金猪猪腰带
Array(1132011, 100, 1, 1), //黄金猪猪腰带
Array(1132012, 100, 1, 1), //法老的腰带
Array(1132013, 100, 1, 1), //不灭的法老腰带
Array(1012011, 100, 1, 1), //圣诞鹿的鼻子
Array(1012012, 100, 1, 1), //圣诞鹿的鼻子
Array(1012013, 100, 1, 1), //圣诞鹿的鼻子
Array(1012014, 100, 1, 1), //圣诞鹿的鼻子
Array(1012015, 100, 1, 1), //圣诞鹿的鼻子
Array(1012016, 100, 1, 1), //圣诞鹿的鼻子
Array(1012017, 100, 1, 1), //圣诞鹿的鼻子
Array(1012018, 100, 1, 1), //圣诞鹿的鼻子
Array(1012019, 100, 1, 1), //圣诞鹿的鼻子
Array(1012020, 100, 1, 1), //圣诞鹿的鼻子
Array(1012056, 100, 1, 1), //狗狗鼻
Array(2340000, 50, 1, 1), //祝福卷轴
Array(2049100, 600, 1, 1), //混沌卷轴60%
Array(1122015, 500, 1, 1), //枫叶围巾
Array(1122058, 800, 1, 1), //休彼德蔓的混沌项链
Array(1132000, 800, 1, 1), //白色腰带
Array(1132001, 800, 1, 1), //黄色腰带
Array(1132002, 800, 1, 1), //蓝色腰带
Array(1132003, 800, 1, 1), //红色腰带
Array(1132004, 800, 1, 1), //黑贺腰带
Array(1132010, 500, 1, 1), //黄金猪猪腰带
Array(1132011, 500, 1, 1), //黄金猪猪腰带
Array(1132012, 500, 1, 1), //法老的腰带
Array(1132013, 500, 1, 1), //不灭的法老腰带
Array(1122074, 500, 1, 1), //枫叶吊坠
Array(1122075, 500, 1, 1), //黄金枫叶魔法吊坠
Array(1002390, 500, 1, 1), //真扎昆头盔
Array(1132213, 300, 1, 1), //红色腰带
Array(1132212, 400, 1, 1), //红色腰带
Array(1132215, 1, 1, 1), //黑色腰带
Array(1132214, 50, 1, 1), //红色腰带
Array(1132178, 1, 1, 1), //暴君腰带
Array(1132177, 1, 1, 1), //暴君腰带
Array(1132176, 1, 1, 1), //暴君腰带
Array(1132175, 1, 1, 1), //暴君腰带
Array(1132174, 1, 1, 1), //暴君腰带
Array(1102485, 1, 1, 1), //暴君披风
Array(1102484, 1, 1, 1), //暴君披风
Array(1102483, 1, 1, 1), //暴君披风
Array(1102482, 1, 1, 1), //暴君披风
Array(1102481, 1, 1, 1), //暴君披风
Array(1072747, 1, 1, 1), //暴君鞋子
Array(1072746, 1, 1, 1), //暴君鞋子
Array(1072745, 1, 1, 1), //暴君鞋子
Array(1072744, 1, 1, 1), //暴君鞋子
Array(1072743, 1, 1, 1), //暴君鞋子
Array(1082547, 1, 1, 1), //海盗暴君手套
Array(1082546, 1, 1, 1), //海盗暴君手套
Array(1082545, 1, 1, 1), //海盗暴君手套
Array(1082544, 1, 1, 1), //海盗暴君手套
Array(1082543, 1, 1, 1), //海盗暴君手套
Array(1032219, 1, 1, 1), //神话耳环
Array(1002418, 500, 1, 1), //废报纸头盔
Array(1073057, 500, 1, 1), //废报纸头盔
Array(1073057, 500, 1, 1), //废报纸头盔
Array(1102828, 500, 1, 1), //废报纸头盔
Array(1102828, 500, 1, 1), //废报纸头盔
Array(1002419, 500, 1, 1),
			Array(1302063,50, 1, 1),//燃烧的火焰刀
            Array(1402044,500, 1, 1),//南瓜灯笼
            Array(1422036,500, 1, 1),//玩具匠人的锤子(有特效)
            Array(1382016,500, 1, 1),//香菇
            Array(1442018,500, 1, 1),//冻冻鱼
            Array(1432039,500, 1, 1),//钓鱼竿
            Array(1442023,500, 1, 1),//黑拖把
            Array(1302013,500, 1, 1),//红鞭子
            Array(1432009,500, 1, 1),//木精灵枪
            Array(1302058,500, 1, 1),//冒险岛伞
            Array(1302066,500, 1, 1),//枫叶庆典旗
            Array(1302049,500, 1, 1),//光线鞭子
            Array(1322051,500, 1, 1),//七夕
            Array(1372017,500, 1, 1),//领路灯
            Array(1322026,500, 1, 1),//彩虹游泳圈
            Array(1332020,500, 1, 1),//太极扇
            Array(1332053,500, 1, 1),//野外烧烤串
            Array(1332054,500, 1, 1),//闪电飞刀
            Array(1402017,500, 1, 1),//船长佩剑
            Array(1402029,500, 1, 1),//鬼刺狼牙棒
            Array(1302080,500, 1, 1),//闪光彩灯鞭
            Array(1442046,500, 1, 1),//超级雪板
            //Array(1442061,500, 1, 1),//仙人掌之矛
            Array(1432046,500, 1, 1),//圣诞枪
            //Array(1442047,500, 1, 1),//玫瑰(47-50)
Array(1102590,1,1,1), //红色
Array(1102564,1,1,1), //红色
Array(1102577,1,1,1), //红色
Array(1102589,1,1,1), //
Array(1102587,1,1,1), //红色
Array(1102588,1,1,1), //红色
Array(1102798,1,1,1), //红色
Array(1102779,1,1,1), //红色
			Array(2043003,500, 1, 1), //单手剑攻击卷轴(必成)
			Array(2044003,500, 1, 1), //双手剑攻击卷轴(必成)
			Array(2044303,500, 1, 1), //枪攻击攻击卷轴(必成)
			Array(2044403,500, 1, 1), //矛攻击攻击卷轴(必成)
			Array(2044503,500, 1, 1), //弓攻击攻击卷轴(必成)
			Array(2044603,500, 1, 1), //弩攻击必成卷
			Array(2043703,500, 1, 1), //短杖攻击必成卷
			Array(2043803,500, 1, 1), //长杖攻击诅轴(必成)
			Array(2043303,500, 1, 1), //短剑攻击必成卷
			Array(2044703,500, 1, 1), //拳套攻击诅轴(必成)
			Array(2044908,500, 1, 1), //短枪攻击卷轴(必成)
			Array(2044815,500, 1, 1), //指节攻击必成卷
			Array(2040807,500, 1, 1), //手套攻击卷轴(必成)
			Array(2040506,500, 1, 1), //全身铠甲敏捷卷轴(必成)
			//Array(2040303 ,500, 1, 1), //耳环智力必成卷(必成)
			Array(2040710,500, 1, 1), //鞋子跳跃卷轴(必成)
			Array(2290096,1,1,1),//勇士20
			Array(2290125,1,1,1),//勇士30
Array(5520000, 1, 10, 1),//剪刀
Array(5570000, 1, 10, 1),//金锤子%
			//披风------
			Array(1102382,10, 1, 1), //极真
			Array(1102383,10, 1, 1), //极真
			//Array(1102320,500, 1, 1), //1
			//Array(1102321,500, 1, 1), //2
			Array(1102248,1, 1, 1), //祥龙
			//Array(1102238,500, 1, 1), //尾巴
		    Array(1102041,1, 1, 1), //粉浪 
		    Array(1102042,1, 1, 1), //紫浪 
		    Array(1102163,1, 1, 1), //贵族披风
		    Array(1102207,1, 1, 1), //金魂
		    Array(1102206,1, 1, 1),//黑色野兽
//-------耳环-------
			//Array(1112424,500, 1, 1), //小鱼 //
			Array(1082149,1, 1, 1), //工地手套(褐)
		    Array(1122000,1, 1, 1), //黑龙链
		Array(1092049,200, 1, 1),//热情剑盾
		Array(1092050,500, 1, 1),//冷艳剑盾
		//鞋子
		Array(1072664 ,1, 1, 1),//外星人之靴
		//Array(1072672 ,500, 1, 1),//风暴鞋子
		Array(1072799  ,1, 1, 1),//妖精争执靴
		//脸  
		Array(1012371     ,1, 1, 1),//掌上脸饰
		Array(1012319     ,1, 1, 1),//8周年点点红
		//Array(1012158     ,500, 1, 1),//草莓幕斯
		Array(1012132    ,500, 1, 1),//鸟嘴面饰5G5M
		Array(1012284    ,500, 1, 1),//白色专属符号
		Array(1012285   ,500, 1, 1),//黑色专属符号
		Array(1012259   ,500, 1, 1),//高级封锁灰色徽章 - (无描述)3不能升级不可交易
		Array(1012252   ,500, 1, 1),//闪亮红色特殊徽章 - (无描述)5G不能升级		可交易
		Array(1012411   ,500, 1, 1),//白色专属匠人徽章 - (无描述)5G可升级+1  5G可交易
		Array(1012474   ,1, 1, 1),//10周年大赏枫叶脸饰 - (无描述)10G不可交易   可升级3次 
		Array(1012171   ,1, 1, 1),//恐怖鬼娃20G
		//Array(1022231  ,500, 1, 1),//绚蓝水印脸饰  
		Array(1022182  ,1, 1, 1),//混沌品克缤瞳印   
		Array(1022197  ,1, 1, 1),//进化太阳镜   
		Array(1022117  ,50, 1, 1),//玛瑙龙眼镜3G   不可砸
		Array(1022185  ,50, 1, 1),//瑞贝卡的古典眼镜 - (无描述)3G可交易7次
		Array(1022224  ,50, 1, 1),//独眼巨人之眼Lv.1
		Array(1022225  ,50, 1, 1),//独眼巨人之眼Lv.2
		Array(1022226  ,50, 1, 1),//独眼巨人之眼Lv.3
		//套服
		Array(1052758      ,1, 1, 1),//11周年衣服
		Array(1052569      ,1, 1, 1),//革命战斗服
		Array(1052460      ,1, 1, 1),//外星人
		Array(1052467      ,1, 1, 1),//高级
		//戒指1112597 - 希纳斯的钻石戒指
		//Array(1113074      ,200, 1, 1),//低级
		Array(1113075      ,10, 1, 1),//最高级贝勒戒指
		Array(1112597     ,10, 1, 1),//希纳斯的钻石戒指
		Array(1113040      ,50, 1, 1),//瑞贝卡的枫叶戒指
		Array(1113017      ,50, 1, 1),//妖精争执戒指
		Array(1112951      ,50, 1, 1),//麦格纳斯的愤怒
		Array(1112952      ,50, 1, 1),//希拉的愤怒	
		//Array(1112794      ,50, 1, 1),//终极戒指
		Array(1112745     ,50, 1, 1),//幻影守护戒指
		Array(1112804     ,1, 1, 1),//结婚戒指
		Array(1112738     ,50, 1, 1),//外星人之戒指
		//耳环
		Array(1032171    ,50, 1, 1),//葡 萄耳环 - (无描述)
		Array(1032241    ,50, 1, 1),//魅惑耳环
		Array(1032234    ,1, 1, 1),//蓝色桃心耳环
		Array(1032108    ,50, 1, 1),//无双耳环 - (无描述)2G		6次
		Array(1032216    ,1, 1, 1),//真红耳环 - (无描述)3G		6次
		Array(1032200    ,50, 1, 1),//巨匠耳环 - (无描述)
		Array(1032232    ,50, 1, 1),//海光耳环 - (无描述)
		//腰带
		//Array(1132161    ,500, 1, 1),//风暴腰带 - (无描述)	可交易
		Array(1132105    ,1, 1, 1),//维克特班·雷昂腰带 - (无描述)
		Array(1132106    ,1, 1, 1),//赫克斯班·雷昂腰带 - (无描述)
		Array(1132228    ,50, 1, 1),//10周年黑色腰带 - (无描述)
		//可抽可合	
		Array(1032174     ,50, 1, 1),//瑞贝卡的酸甜耳环 - (无描述)
		Array(1022168     ,500, 1, 1),// 黑羽眼镜 - (无描述)  -攻击1	可升级3  不可交易
		Array(1012348     ,500, 1, 1),//2013圣诞鹿的鼻子 - (无描述)
		Array(1132013     ,500, 1, 1),//1132013 - 不灭的法老腰带 - (无描述)
		//帽子
			Array(1003843,1, 1, 1),//点券帽子牛
		    Array(1002939,1, 1, 1), //安全帽 1003561 
		    Array(1003621,1, 1, 1), //PB  
		    Array(1003722,1, 1, 1), //进阶贝伦头盔  
		    //Array(1003765,500, 1, 1), //真．紫烏鴉 - (无描述)  
		    //Array(1003766,500, 1, 1), //真．戴碧斯魂 - (无描述) 
		    //Array(1003782,100, 1, 1), //神．紫烏鴉 - (无描述)
		    //Array(1003783,100, 1, 1), //神．戴碧斯魂 - (无描述) 
		    Array(1003768,1, 1, 1), //真．龍魔導士翅膀頭巾  
		    Array(1003785,1, 1, 1), //神．龍魔導士翅膀頭巾 - (无描
		    Array(1003767,1, 1, 1), //真．精靈王之頭冠 - (无描述)  
		    Array(1003784,1, 1, 1), //神．精靈王之頭冠 - (无描述)
		    Array(1003787,1, 1, 1), //妖精大眼青蛙帽子 - (无描述)
		    Array(1003863,1, 1, 1), //10周年黑色 - (无描述)
		    Array(1003973 ,1, 1, 1), //蛛丝  - (无描述)
		  //  Array(1004040 ,1, 1, 1), //小熊猫耳朵  - (无描述)
		   // Array(1004041 ,1, 1, 1), //松鼠耳朵  - (无描述)
		    //Array(1004042 ,1, 1, 1), //兔耳朵  - (无描述)
		    //Array(1004043 ,1, 1, 1), //狗狗耳朵  - (无描述)
		   // Array(1004044 ,1, 1, 1), //熊熊耳朵  - (无描述)
			Array(1122029,500, 1, 1), //苏醒的冒险之心         
			Array(1122030,500, 1, 1), //苏醒的冒险之心         
			Array(1122031,500, 1, 1), //苏醒的冒险之心         
			Array(1122032,500, 1, 1), //苏醒的冒险之心         
			Array(1122033,500, 1, 1), //苏醒的冒险之心         
			Array(1122034,200, 1, 1), //觉醒的冒险之心         
			Array(1122035,200, 1, 1), //觉醒的冒险之心
			Array(1122036,200, 1, 1), //觉醒的冒险之心
			Array(1122037,200, 1, 1), //觉醒的冒险之心
			Array(1122038,200, 1, 1), //觉醒的冒险之心 	
		Array(1032208      ,1, 1, 1),//神话耳环复原第3阶段 - (无描述)
		Array(1032209     ,1, 1, 1),//神话耳环复原第4阶段 - (无描述)
		Array(1032219      ,1, 1, 1),//遗忘之神话耳环 - (无描述)
		    Array(1102481 ,1, 1, 1),//暴君披风
		    Array(1102482 ,1, 1, 1),//暴君披风
		    Array(1102483 ,1, 1, 1),//暴君披风
		    Array(1102484 ,1, 1, 1),//暴君披风
		    Array(1102485 ,1, 1, 1),//暴君披风
		    Array(1072743  ,1, 1, 1),//暴君鞋
		    Array(1072744  ,1, 1, 1),//暴君鞋
		    Array(1072745  ,1, 1, 1),//暴君鞋
		    Array(1072746  ,1, 1, 1),//暴君鞋
		    Array(1072747  ,1, 1, 1),//暴君鞋
		    Array(1132174   ,1, 1, 1),//暴君腰带
		    Array(1132175   ,1, 1, 1),//暴君腰带
		    Array(1132176   ,1, 1, 1),//暴君腰带
		    Array(1132177   ,1, 1, 1),//暴君腰带
		    Array(1132178   ,1, 1, 1),//暴君腰带
			//-------帽子-------
			Array(1382050,50, 1, 1), //玄武长杖
			Array(1382052,50, 1, 1), //青龙长杖
			//-------武器------
			//Array(1402902,200, 1, 1),  //斩月
			//Array(1402903,200, 1, 1),  //斩月
			//Array(1402904,200, 1, 1),  //斩月
			//Array(1402905,200, 1, 1),  //斩月
			//Array(1402307 ,200, 1, 1),  //天锁斩月 
			//Array(1402332 ,200, 1, 1),  //黑刀
			//Array(1402331 ,200, 1, 1),  //黑刀
			//Array(1402330 ,200, 1, 1),  //黑刀
			//Array(1402329 ,200, 1, 1),  //黑色恶魔
			//Array(1402328 ,200, 1, 1),  //黑色恶魔
			//Array(1402327 ,200, 1, 1),  //金の剑  双
			//Array(1402326 ,200, 1, 1),  //黑色恶魔
			//Array(1402325 ,200, 1, 1),  //失败の剑 
			//Array(1402324 ,200, 1, 1),  //黑色恶魔
			//Array(1402323 ,200, 1, 1),  //黑色恶魔
			//Array(1402322 ,200, 1, 1),  //黑色恶魔
			//Array(1402321 ,200, 1, 1),  //黑色恶魔
			//Array(1402320 ,50, 1, 1),  //青龙剑
			//Array(1402319 ,50, 1, 1),  //青龙剑
			//Array(1402318 ,200, 1, 1),  //血雷の剑 双
			//Array(1402317 ,200, 1, 1),  //血雷の剑 双
			//Array(1402316 ,200, 1, 1),  //血雷の剑 双
			//Array(1402315 ,200, 1, 1),  //血雷の剑 双
			//Array(1402314 ,200, 1, 1),  //血雷の剑 双
			//Array(1402313 ,200, 1, 1),  //血雷の剑 双
			//Array(1402312 ,200, 1, 1),  //血雷の剑 双
			//Array(1402311 ,200, 1, 1),  //血雷の剑 双
			//Array(1402310 ,200, 1, 1),  //血雷の剑 双
			//Array(1402309 ,200, 1, 1),  //血雷の剑 
			//Array(1402308 ,200, 1, 1),  //泪雪の剑
			Array(1432182,1, 1, 1), //红色枪
			//Array(1442088,200, 1, 1), //紫色矛
			Array(1442029,1, 1, 1), //紫色矛
			Array(1382226,10, 1, 1), //红色长杖  
			Array(1452220,10, 1, 1), //红色弓                           
			Array(1462208,10, 1, 1), //红色之弩
			Array(1332242,10, 1, 1), //红色切割者
			Array(1472230,10, 1, 1), //红色拳套 
			Array(1482183,10, 1, 1), //红色拳甲  
			Array(1492194,10, 1, 1), //红色短枪   
			Array(1402037,10, 1, 1), //龙背刀
			Array(1332114,500, 1, 1), //黄金枫叶短刀
			//Array(1322084,500, 1, 1), //黄金枫叶锤子
			//Array(1312056,500, 1, 1), //黄金枫叶斧子
			//Array(1422057,500, 1, 1), //黄金枫叶巨锤
			//Array(1442104,500, 1, 1), //黄金枫叶开山斧
			Array(1432075,500, 1, 1), //黄金枫叶枪
			Array(1402085,500, 1, 1), //黄金枫叶双手剑
			Array(1372071,500, 1, 1), //黄金枫叶短杖
			Array(1462085,500, 1, 1), //黄金枫叶弩
			Array(1452100,500, 1, 1), //黄金枫叶弓
			Array(1472111,500, 1, 1), //黄金枫叶拳套
			Array(1482073,500, 1, 1), //黄金枫叶指节
			Array(1492073,500, 1, 1), //黄金枫叶短枪
			//Array(4000463,500, 1, 1),  //货币
			//Array(4001028,500, 1, 1),  //血书
			Array(4031217,1, 1, 1),  //黄金钥匙
			Array(1402047,1, 1, 1),//重生玄冥剑
			Array(1432049,1, 1, 1), //重生显圣枪
			Array(1442067,1, 1, 1), //重生神光戟
			Array(1452059,1, 1, 1), //重生惊电弓
			Array(1462051,1, 1, 1), //重生冥雷弩
			Array(1472071,1, 1, 1), //重生大悲赋
			Array(1482024,1, 1, 1), //重生孔雀翎
			Array(1492025,1, 1, 1), //重生凤凰铳
			Array(1302086,1, 1, 1), //重生破甲剑
			Array(1332075,1, 1, 1), //重生狂鲨锯
			Array(1332076,1, 1, 1), //重生断首刃
			Array(1382059,1,1, 1),//重生蝶翼杖
			Array(1492179,100,1, 1),//FFN
			Array(1482168,100,1, 1),//FFN
			Array(1472214,100,1, 1),//FFN
			Array(1462193,100,1, 1),//FFN
			Array(1452205,100,1, 1),//FFN
			Array(1442223,100,1, 1),//FFN
			Array(1432167,100,1, 1),//FFN
			Array(1422140,100,1, 1),//FFN
			Array(1412135,100,1, 1),//FFN
			Array(1402196,100,1, 1),//FFN
			Array(1382208,100,1, 1),//FFN
			Array(1372177,100,1, 1),//FFN
			Array(1492235,10,1, 1),//神秘
			Array(1482221,10,1, 1),//神秘
			Array(1472265,10,1, 1),//神秘
			Array(1462243,10,1, 1),//神秘
			Array(1452257,10,1, 1),//神秘
			Array(1442274,10,1, 1),//神秘
			Array(1432218,10,1, 1),//神秘
			Array(1422189,10,1, 1),//神秘
			Array(1412181,10,1, 1),//神秘
			Array(1402259,10,1, 1),//神秘
			Array(1382265,10,1, 1),//神秘
			Array(1372228,10,1, 1),//神秘
			Array(2022336,0,1, 1)//创世自选箱
			
			
			
);

function action(mode, type, selection) {
    if (mode == 1) {
        status++;
    } else {
        if (status == 0) {
            cm.sendOk("不想使用吗？…我的肚子里有各类#b奇特座椅或卷轴、装备、新奇道具#k哦！\r\n\r\n");
            cm.dispose();
        }
        status--;
    }
    if (status == 0) {
		 
            var   text = "#r使用#v4000463#就可以获得我肚子里的礼物，快行动吧！\r\n#e#d" + 小烟花 + "任何建议，请联系管理，谢谢！" + 小烟花 + "#n#k\r\n\r\n";
		
       // text +=" 点券余额；#r"+cm.getPlayer().getmoneyb()+"#k\r\n\r\n";
	   
        text += "#L1#" + 小烟花 +  "使用#v4000463#抽#r1#k次#l#L10"+"#" + 小烟花 + "使用#v4000463#抽#r10#k次\r\n\r\n";
       // text += "#L1#"+"#使用#v4001126#抽奖；#l\r\n\r\n";
        text += "#L101##r" + 星星 + "想看我肚子里有什么东西吗" + 星星 + "#l\r\n\r\n";
	//	text +="#L104#积分兑换#l"  +  "#L103#单个分解#l"+"#L105#多个分解#l\r\n\r\n";
        cm.sendSimple(text);
    } else if (status == 1) {
        if (selection == 102) {
            cm.dispose();
            cm.openNpc(9310022, 102);
        }else if(selection == 106){
			cm.dispose();
			cm.openNpc(9900001, "百宝券抽奖");
			//cm.openNpc(9310022,103 );
			return;
		}else if(selection == 104){
			cm.dispose();
			cm.openNpc(9310022, "装备积分兑换");
			return;
		}else if(selection == 105){
			cm.dispose();
			cm.openNpc(9310022, 104);
			return;
		}
		else if (selection == 101) {
            var textItem = ""
            for (var i = 0; i < itemList.length; i++) {
                textItem += "#i" + itemList[i][0] + ":#"
            }
            cm.sendOk("使用#v4000463#获得以下道具，快行动吧！\r\n#e#r任何建议，请联系管理，谢谢！#n#k\r\n" + textItem);
            status = -1;
            //cm.safeDispose();
        } else if (selection > 0 && selection <= 10) {
			//cm.getPlayer().getCSPoints(1) < 500
            if (!cm.haveItem(4000463,1)) {
                cm.sendOk("你没有#v4000463#！");
                cm.dispose();
                return;
            }

            var chance;
            var Xms1 = 0;
            var Xms2 = new Array();
            for (var j = 0; (j < selection); ) {

                chance = Math.floor(Math.random() * 400);
                var finalitem = Array();
                for (var i = 0; i < itemList.length; i++) {
                    if (itemList[i][1] >= chance) {
                        finalitem.push(itemList[i]);
                    }
                }
                
                if (finalitem.length != 0) {
            var item;
            var random = new java.util.Random();
            var finalchance = random.nextInt(finalitem.length);
            var itemId = finalitem[finalchance][0];
            var quantity = finalitem[finalchance][2];
            var notice = finalitem[finalchance][3];
            item = cm.gainGachaponItem(itemId, quantity, "飞天猪", notice);
            if (item != -1) {
             //   cm.gainItem(4000463,-1);
             //   cm.sendOk("你获得了 #b#t" + item + "##k " + quantity + "个。");
cm.dispose();
			}

                    if (cm.getInventory(1).isFull(0)) {
                        cm.sendNext("背包空间不足或你无法获得道具，抽奖终止！");
                        cm.dispose();
                        return;
                    }
                    if (cm.getInventory(2).isFull(0)) {
                        cm.sendNext("背包空间不足或你无法获得道具，抽奖终止！");
                        cm.dispose();
                        return;
                    }
                    if (cm.getInventory(3).isFull(0)) {
                        cm.sendNext("背包空间不足或你无法获得道具，抽奖终止！");
                        cm.dispose();
                        return;
                    }
                    if (cm.getInventory(4).isFull(0)) {
                        cm.sendNext("背包空间不足或你无法获得道具，抽奖终止！");
                        cm.dispose();
                        return;
                    }
                    if (cm.getInventory(5).isFull(0)) {
                        cm.sendNext("背包空间不足或你无法获得道具，抽奖终止！");
                        cm.dispose();
                        return;
                    }

                    if (item != -1) {
                        //cm.setLuckDrawLog(itemId,"快乐百宝箱中获得",0,ii.getInventoryType2(itemId).getType());						
                        Xms2[Xms1] = new Array();
                        Xms2[Xms1][0] = itemId;
                        Xms2[Xms1][1] = quantity;
                        //cm.更改推广值(-3);
						// cm.gainNX(-500);
						 cm.gainItem(4000463,-1);
						
					//	cm.gainzb(-5);5220010
					//cm.gainItem(4001126,-1);
						//cm.gainItem(4310088,1);
						if(cm.getPlayer().getBossLog("每日抽奖")<50){
							cm.getPlayer().setBossLog("活跃度");
							cm.getPlayer().setBossLog("活跃度");
						}
						cm.getPlayer().setBossLog("每日抽奖");
                        Xms1++;
                        j++;
                        
                        if (selection == 1) {
                            cm.gainItem(itemId, 0);
                            cm.sendOk("你获得了 #b#t" + itemId + "##k " + quantity + "个。");
                            
                        }
/* 						if(cm.getOneTimeLog("累计抽奖") > 0 && cm.getOneTimeLog("累计抽奖")%5 == 0 ){
							cm.gainItem(4031997,1);
							
						}
						if(cm.getOneTimeLog("累计抽奖") > 0 && cm.getOneTimeLog("累计抽奖")%8 == 0 ){
							cm.gainItem(2049100,1);
							
						}
						if(cm.getOneTimeLog("累计抽奖") > 0 && cm.getOneTimeLog("累计抽奖")%12 == 0 ){
							cm.gainItem(2340000,1);
							
						} */
						cm.dispose();

                    }
                }
            }
            cm.dispose();
        }

    }
}

