/*
 
 道具制作
 */
var 装备 = [
  /*************
     手套
     *************/
  //重生定边手套
  1082234,
  //重生逍遥手套
  1082235,
  //重生白云手套
  1082236,
  //重生探云手套
  1082237,
  //重生抚浪手套
  1082238,
  /*************
     鞋子
     *************/
  //重生坚壁靴
  1072355,
  //重生缥缈鞋
  1072356,
  //重生彩虹鞋
  1072357,
  //重生舞空靴
  1072358,
  //重生定海靴
  1072359,
  /*************
     套服
     *************/
  //重生演武铠
  1052155,
  //重生奥神袍
  1052156,
  //重生巡礼者
  1052157,
  //重生翻云服
  1052158,
  //重生霸七海
  1052159,
  /*************
     帽子
     *************/
  //重生冠军盔
  1002776,
  //重生玄妙帽
  1002777,
  //重生霓翎帽
  1002778,
  //重生迷踪帽
  1002779,
  //重生海王星
  1002780,
  /*************
     武器
     *************/
  //重生破甲剑
  1302081,
  //重生断蚺斧
  1312037,
  //重生惊破天
  1322060,
  //重生狂鲨锯
  1332073,
  //重生断首刃
  1332074,
  //重生蝶翼杖
  1372044,
  //重生冰轮杖
  1382057,
  //重生玄冥剑
  1402046,
  //重生碎鼋斧
  1412033,
  //重生威震天
  1422037,
  //重生显圣枪
  1432047,
  //重生神光戟
  1442063,
  //重生惊电弓
  1452057,
  //重生冥雷弩
  1462050,
  //重生大悲赋
  1472068,
  //重生孔雀翎
  1482023,
  //重生凤凰铳
  1492023,
  //战士盾
  1092058,
  //法师盾
  1092057,
  //飞侠盾
  1092059,
];
//说明文字
var 说明文字 =
  "物理职业手套、帽子、鞋额外+10攻，衣服额外+20攻。\r\n魔法职业手套、帽子、鞋额外+10攻、智，衣服额外+20攻、智\r\n#b#h ##k 赶紧选，选错了老子可不给你退";

var sels;
var 脚本执行 = -1;

function start() {
  action(1, 0, 0);
}

function action(mode, type, selection) {
  if (mode == 1) {
    脚本执行++;
  } else if (mode == 0) {
    脚本执行--;
  } else {
    cm.对话结束();
    return;
  }
  if (脚本执行 == 0) {
    var 文本信息 = "";
    for (var i = 0; i < 装备.length; i++) {
      文本信息 += "#b#L" + i + "#";
      文本信息 += "#i" + 装备[i] + "##z" + 装备[i] + "##l#k\r\n";
    }

    cm.sendSimple("" + 说明文字 + "\r\n" + 文本信息 + "");
  } else if (脚本执行 == 1) {
    if (cm.haveItem(4310113, 288) && cm.haveItem(4310022, 66)) {
      sels = selection;
      cm.gainItem(装备[sels], 1);
      cm.gainItem(4310113, -288);
      cm.gainItem(4310022, -66);
      cm.说明文字("拿着 " + cm.显示物品(装备[sels]) + "，快滚");
      //cm.输出记录("礼包兑换记录/重生套装兑换记录.txt",""+cm.时间()+" : "+cm.getChar().getName()+" 兑换了 "+cm.getItemName(装备[sels])+" \r\n");
      cm.对话结束();
    }
    cm.说明文字("你没有材料不要骗我");
  } else {
    cm.说明文字("#r发生错误: mode : " + mode + " 脚本执行 : " + 脚本执行);
    cm.对话结束();
  }
}
