var status = 0;
var itemList =   
Array(   
			Array(2290125,5,1,1),//30勇士
			Array(1132242,200,1,1),//革命腰带
			Array(1003946,20,1,1),//革命帽子
			Array(1102612,30,1,1),//革命披风
			Array(1082540,30,1,1),//革命手套
			//Array(1052647,50,1,1),//革命战斗服
			Array(1052647,30,1,1),//革命战斗服
			Array(1122262,200,1,1),//革命吊坠
			Array(1072853,100,1,1),//革命鞋子
			Array(2070006,200,1,1),//齿轮
			Array(2070007,250,1,1),//月牙
			Array(1132243,50,1,1),//低级贝勒德刻印腰带
			Array(1132244,20,1,1),//中级贝勒德刻印腰带
			Array(1132245,10,1,1),//高级贝勒德刻印腰带
			Array(1132246,5,1,1),//最高级贝勒德刻印腰带
			Array(1122264,50,1,1),//低级贝勒德刻印吊坠
			Array(1122265,20,1,1),//中级贝勒德刻印吊坠
			Array(1122266,10,1,1),//高级贝勒德刻印吊坠
			Array(1122267,5,1,1),//最高级贝勒德刻印吊坠
			Array(1032220,30,1,1),//低级贝勒德耳环
			Array(1032221,20,1,1),//中级贝勒德耳环
			Array(1032222,10,1,1),//高级贝勒德耳环
			Array(1032223,5,1,1),//最高级贝勒德耳环
			Array(1113072,20,1,1),//低级贝勒德戒指
			Array(1113073,20,1,1),//中级贝勒德戒指
			Array(1113074,10,1,1),//高级贝勒德戒指
			Array(1113075,5,1,1),//最高级贝勒德戒指
			Array(1112405,100,1,1),//全属性5左右戒指
			Array(1112404,200,1,1),//极光戒指
			//Array(1112426,200,1,1),//全属性1戒指
			Array(1112425,200,1,1),//全属性2戒指
			Array(1112424,200,1,1),//
			Array(1112423,200,1,1),//
			Array(1112422,200,1,1),//
			Array(1112421,200,1,1),//
			Array(1112402,200,1,1),//
			Array(1092074,100,1,1),//至尊不速之客战士盾
			Array(1092079,10,1,1),//至尊不速之客法师盾
			Array(1092084,20,1,1),//至尊不速之客飞侠盾
			Array(1302147,20,1,1),//至尊不速之客单手剑
			Array(1312062,20,1,1),//至尊不速之客单手斧
			Array(1322090,20,1,1),//至尊不速之客单手钝器
			Array(1332120,20,1,1),//至尊不速之客短剑-运
			Array(1332125,20,1,1),//至尊不速之客短剑-力
			Array(1342033,20,1,1),//至尊不速之客刀
			Array(1372078,20,1,1),//至尊不速之客短杖
			Array(1382099,20,1,1),//至尊不速之客长杖
			Array(1402090,20,1,1),//至尊不速之客双手剑
			Array(1412062,20,1,1),//至尊不速之客双手斧
			Array(1422063,20,1,1),//至尊不速之客双手斧
			Array(1432081,20,1,1),//至尊不速之客枪
			Array(1442111,20,1,1),//至尊不速之客矛
			Array(1452106,20,1,1),//至尊不速之客弓
			Array(1462091,20,1,1),//至尊不速之客弩
			Array(1472117,20,1,1),//至尊不速之客拳套
			Array(1482079,50,1,1),//至尊不速之客指节
			Array(1492079,50,1,1),//至尊不速之客刀
			Array(1342033,50,1,1),//至尊不速之客短枪
			Array(1132040,200,1,1),//至尊
//-------140级巨匠装备-------
Array(1032200, 250, 1, 1), //
Array(1012396, 250, 1, 1), //
Array(1012397, 250, 1, 1), //
Array(1012398, 250, 1, 1), //
Array(1012399, 250, 1, 1), //
Array(1012401, 250, 1, 1), //
Array(1012402, 250, 1, 1), //
Array(1012403, 250, 1, 1), //
Array(1012404, 250, 1, 1), //
Array(1113067, 250, 1, 1), //
Array(1113063, 250, 1, 1), //
Array(1113055, 250, 1, 1), //
//-------150级法弗纳装备-----
Array(1402196, 20, 1, 1), //
Array(1412135, 20, 1, 1), //
Array(1422140, 20, 1, 1), //
Array(1432167, 20, 1, 1), //
Array(1442223, 20, 1, 1), //
Array(1452205, 20, 1, 1), //
Array(1462193, 20, 1, 1), //
Array(1472214, 20, 1, 1), //
Array(1482168, 20, 1, 1), //
Array(1492179, 20, 1, 1), //
Array(1382208, 20, 1, 1), //
Array(1302275, 20, 1, 1), //
Array(1332225, 20, 1, 1), //
//-------150级暴君-----
Array(1132174, 10, 1, 1), //
Array(1132175, 10, 1, 1), //
Array(1132176, 10, 1, 1), //
Array(1132177, 10, 1, 1), //
Array(1132178, 10, 1, 1), //
Array(1102481, 10, 1, 1), //
Array(1102482, 10, 1, 1), //
Array(1102483, 10, 1, 1), //
Array(1102484, 10, 1, 1), //
Array(1102485, 10, 1, 1), //
Array(1082543, 10, 1, 1), //
Array(1082544, 10, 1, 1), //
Array(1082545, 10, 1, 1), //
Array(1082546, 10, 1, 1), //
Array(1082547, 10, 1, 1), //
Array(1072743, 10, 1, 1), //
Array(1072744, 10, 1, 1), //
Array(1072745, 10, 1, 1), //
Array(1072746, 10, 1, 1), //
Array(1072747, 10, 1, 1), //
//-------150级高贵系列-----
Array(1003797, 30, 1, 1), //
Array(1003798, 30, 1, 1), //
Array(1003799, 30, 1, 1), //
Array(1003800, 30, 1, 1), //
Array(1003801, 30, 1, 1), //
Array(1042254, 30, 1, 1), //
Array(1042255, 30, 1, 1), //
Array(1042256, 30, 1, 1), //
Array(1042257, 30, 1, 1), //
Array(1042258, 30, 1, 1), //
Array(1062165, 30, 1, 1), //
Array(1062166, 30, 1, 1), //
Array(1062167, 30, 1, 1), //
Array(1062168, 30, 1, 1), //
Array(1062169, 30, 1, 1), //
//-------160级埃苏莱布-----
Array(1402251, 20, 1, 1), //
Array(1412177, 20, 1, 1), //
Array(1422184, 20, 1, 1), //
Array(1432214, 20, 1, 1), //
Array(1442268, 20, 1, 1), //
Array(1452252, 20, 1, 1), //
Array(1462239, 20, 1, 1), //
Array(1472261, 20, 1, 1), //
Array(1482216, 20, 1, 1), //
Array(1492231, 20, 1, 1), //
Array(1332274, 20, 1, 1), //
Array(1302333, 20, 1, 1), //
Array(1382259, 20, 1, 1), //
//-------160级埃苏莱布防具-----
Array(1004422, 20, 1, 1), //
Array(1004423, 20, 1, 1), //
Array(1004424, 20, 1, 1), //
Array(1004425, 20, 1, 1), //
Array(1004426, 20, 1, 1), //
Array(1102775, 20, 1, 1), //
Array(1102794, 20, 1, 1), //
Array(1102795, 20, 1, 1), //
Array(1102796, 20, 1, 1), //
Array(1102797, 20, 1, 1), //
Array(1082636, 20, 1, 1), //
Array(1082637, 20, 1, 1), //
Array(1082638, 20, 1, 1), //
Array(1082639, 20, 1, 1), //
Array(1082640, 20, 1, 1), //
Array(1052882, 20, 1, 1), //
Array(1052887, 20, 1, 1), //
Array(1052888, 20, 1, 1), //
Array(1052889, 20, 1, 1), //
Array(1052890, 20, 1, 1), //
Array(1073030, 20, 1, 1), //
Array(1073032, 20, 1, 1), //
Array(1073033, 20, 1, 1), //
Array(1073034, 20, 1, 1), //
Array(1073035, 20, 1, 1), //
			Array(1122081,200,1,1),//1代项链
			Array(1122082,200,1,1),//2代项链
			Array(1122083,200,1,1),//3
			Array(1122084,200,1,1),//末代
			Array(1122085,200,1,1),//至尊
			//Array(1122083,50,1,1),//3
			//Array(1122083,50,1,1),//3
			//Array(1122083,50,1,1),//3
			//Array(1122083,50,1,1),//3
			//Array(1122083,50,1,1),//3			
			//Array(2049002,200,1,1),//白医5
			//Array(2049001,300,1,1),//白医3
			Array(2049000,200,1,1),//白医1
			Array(2040006,200,1,1),//头盔防御必成
			Array(2040007,200,1,1),//体力必成
			Array(2040303,50,1,1),//耳环智力必成
			Array(2040403,200,1,1),//上衣防御必成
			Array(2040506,50,1,1),//全身敏捷必称
			Array(2040603,300,1,1),//裤裙防御必成
			Array(2040709,30,1,1),//鞋子敏捷必成
			Array(2040710,200,1,1),//跳跃必成
			Array(2040711,300,1,1),//速度必成
			Array(2040806,50,1,1),//手套敏捷必成
			Array(2040903,300,1,1),//盾牌防御必成
			Array(2041024,300,1,1),//披风MF必成
			Array(2041025,200,1,1),//披风WF必成
			Array(5570000,200,1,1),//金锤子
			Array(1132053,200,1,1),//坚韧极限
			Array(1132063,200,1,1),	
			Array(1132073,200,1,1),
			Array(1132083,200,1,1),//幸运极限
		Array(1122110,300,1,1),//超级枫叶系列
		Array(1082313,300,1,1),
		Array(1332143,200,1,1),
		Array(1342038,330,1,1),
		Array(1372095,200,1,1),
		Array(1382119,200,1,1),
		Array(1402105,300,1,1),
		Array(1442131,300,1,1),
		Array(1452124,200,1,1),
		Array(1462112,300,1,1),
		Array(1472135,200,1,1),
		Array(1482097,300,1,1),
		Array(1492096,200,1,1),
			
		Array(1302030,300,1,1),//枫叶系列
		Array(1332025,300,1,1),
		Array(1382012,300,1,1),
		Array(1412011,330,1,1),
		Array(1422014,300,1,1),
		Array(1432012,300,1,1),
		Array(1442024,300,1,1),
		Array(1452022,300,1,1),
		Array(1462019,300,1,1),
		Array(1472032,300,1,1),
		Array(1482021,300,1,1),
		Array(1492021,300,1,1),
		Array(1402037,200,1,1),//龙背
		Array(1372035,300,1,1),//4短属性
		Array(1372036,300,1,1),
		Array(1372037,300,1,1),
		Array(1372038,300,1,1),
		Array(1382045,200,1,1),//四长属性
		Array(1382046,200,1,1),
		Array(1382047,200,1,1),
		Array(1382048,200,1,1),
		Array(1382049,100,1,1),//四大属性
		Array(1382050,100,1,1),
		Array(1382051,100,1,1),
		Array(1382052,100,1,1),
		
		
		Array(2049100,300,1,1),//混沌
			Array(2340000,50,1,1),//祝福卷轴
			Array(2040914,100,1,1),//盾牌攻击卷轴  
			Array(2040810,151,1),
			Array(2040811,100,1,1),
			Array(2040916,150,1,1),
			Array(2040917,150,1,1),
			Array(2043004,150,1,1),
			Array(2043005,150,1,1),
			Array(2043104,150,1,1),
			Array(2043105,150,1,1),
			Array(2043204,150,1,1),
			Array(2043205,150,1,1),
			Array(2043304,150,1,1),
			Array(2043305,150,1,1),
			Array(2044004,150,1,1),
			Array(2044005,100,1,1),
			Array(2044104,100,1,1),
			Array(2044105,100,1,1),
			Array(2044204,100,1,1),
			Array(2044205,100,1,1),
			Array(2044304,100,1,1),
			Array(2044305,100,1,1),
			Array(2044404,100,1,1),
			Array(2044405,100,1,1),
			Array(2044504,100,1,1),
			Array(2044505,100,1,1),
			Array(2044604,100,1,1),
			Array(2044605,100,1,1),
			Array(2044704,100,1,1),
			Array(2044903,100,1,1),
			Array(2044904,100,1,1),
			Array(2043704,100,1,1),
			Array(2043705,100,1,1),
			Array(2043804,100,1,1),
			Array(2043805,300,1,1),
			Array(1002419,200,1,1),//枫叶帽
			Array(1002677,150,1,1),//玩具匠人帽
			Array(1002798,200,1,1),//年糕1002798
			Array(1002743,150,1,1),//海洋之帽
			Array(1002939,300,1,1),//安全帽						
			Array(1082149,300,1,1),//工地手套(褐) 		 
			Array(1102042,250,1,1),//浪人披风(紫) 
			Array(1102041,200,1),//浪人披风(粉)			
			Array(1102086,300,1,1),//蓝色盖亚披风
			Array(1102084,300,1,1),//粉红盖亚披风		
			Array(1012070,300,1,1),//雪糕+攻
			Array(1012071,200,1,1),//雪糕全属性
			Array(1012072,300,1,1),//狐猴
			Array(1012073,300,1,1),//狐猴
			Array(1022060,100,1,1),//狐猴
			Array(1022067,100,1,1),//黑狐猴
			Array(1012056,100,1,1),//狗狗鼻子1012056		  
			Array(1402063,100,1,1),//樱花伞
			Array(1302058,100,1,1),//枫叶伞			
			Array(1092022,100,1,1),//调色板盾牌					
			Array(1302063,200,1,1),//燃烧的火焰刀
			Array(1302106,200,1,1),//燃烧的冰焰刀
			Array(1302080,200,1,1),//冒险岛小灯泡
			Array(1302085,200,1,1),//叉子
			Array(1302087,200,1,1),//火炬
			Array(1382015,200,1,1),//毒蘑菇
			Array(1382016,200,1,1),//香菇
			Array(1402044,300,1,1),//南瓜灯笼
			Array(1302061,300,1,1),//蔓藤鞭子
			Array(1422030,300,1,1),//粉红海豹抱枕
			Array(1422031,300,1),//蓝色海豹抱枕
			Array(1432046,200,1,1),//圣诞树手杖
			Array(1432013,100,1,1),//南瓜枪
        	Array(1302024,100,1,1),//废报纸武器
        	Array(1322051,300,1,1),//七夕
        	Array(1402014,30,1,1),//温度计
        	Array(1402029,100,1,1),//鬼刺狼牙棒
        	Array(1422011,200,1,1),//酒瓶
        	Array(1332053,200,1,1),//野外烧烤
        	Array(1372017,200,1,1),//领路灯
		    Array(1442039,50,1,1),//冻冻鱼
        	Array(1302019,200,1,1),//无名剑
        	Array(1332021,100,1,1),//乌龙茶
        	//Array(1302128,200,1,1),//火柴	
        	//Array(1302084,300,1,1),//火柴
        	Array(1402013,200,1,1),//白日剑
			Array(1302036,200,1,1),//枫叶小旗
			Array(1302049,200,1,1),//光线鞭
				//---戒指
			Array(1112688,100,1,1),            
			Array(1112138,100,1,1),
            Array(1112245,100,1,1),
            Array(1112584,100,1,1),
			Array(1112591,100,1,1),            
			Array(1112592,100,1,1),
            Array(1112596,100,1,1),
            Array(1112597,100,1,1),
			Array(1112662,100,1,1),            
			Array(1112663,100,1,1),
            Array(1113016,100,1,1),
            Array(1113017,100,1,1),
			Array(1112795,100,1,1),            
			Array(1112782,100,1,1),
            Array(1112783,100,1,1),
            Array(1112784,100,1,1),
			Array(1112725,100,1,1),            
			Array(1112729,100,1,1),
            Array(1112730,100,1,1),
            Array(1112732,100,1,1),
			Array(1112733,100,1,1),            
			Array(1112734,100,1,1),
            Array(1112920,100,1,1),
            Array(1112738,100,1,1),
			Array(1112745,100,1,1),            
			Array(1113003,100,1,1),
            Array(1113020,100,1,1),
            Array(1113038,100,1,1),
			Array(1113077,100,1,1),
            Array(1113096,100,1,1),
			
			Array(1112570,200,1,1),
            Array(1112794,100,1,1),
            Array(1112789,100,1,1),
            Array(1112675,100,1,1),
            Array(1112682,100,1,1),
            Array(1112683,100,1,1),
            Array(1112712,100,1,1),
            Array(1112721,100,1,1),
            Array(1112723,100,1,1),
            Array(1112735,100,1,1),
			Array(1112736,100,1,1),
            Array(1112739,100,1,1),
            Array(1112740,100,1,1),
            Array(1112742,100,1,1),
            Array(1112743,100,1,1),
            Array(1112748,100,1,1),            
			Array(1112747,100,1,1),
            Array(1112751,100,1,1),
            Array(1112752,100,1,1),            
			Array(1112761,100,1,1),
            Array(1112758,100,1,1),
            Array(1112759,100,1,1),            
			Array(1112760,100,1,1),
            Array(1113028,100,1,1),
            Array(1113039,100,1,1),            
			Array(1113040,100,1,1),
            Array(1113064,200,1,1),
            Array(1113048,200,1,1),
		    Array(1113065,200,1,1),            
			Array(1113066,200,1,1),
            Array(1113067,200,1,1),
            Array(1113069,200,1,1),            
			Array(1113071,200,1,1),
            Array(1113076,200,1,1),
            Array(1113081,200,1,1),
			Array(1113082,200,1,1),            
			Array(1113087,200,1,1),
            Array(1113089,200,1,1),
            Array(1113095,200,1,1),            
			Array(1113149,200,1,1),
            Array(1113170,200,1,1),
            Array(1113034,200,1,1),
			Array(1113178,80,1,1),
			Array(1112400,300,1,1),//
			Array(1112401,300,1,1),//
			Array(1112402,300,1,1),//
			Array(1112403,300,1,1),//	


						
			
			//-----椅子-----
			//  Array(3010788,100,1,1),
			//Array(3010681,100,1,1),
			//Array(3010416,100,1,1),
			//Array(3010417,100,1,1),
		   // Array(3010043,200,1,1),//魔女的飞扫把
		    Array(3015051,50,1,1),//巨无霸国际巨星
		   //Array(3015183,200,1,1),//绿水灵背景椅子
		    Array(3015096,200,1,1),//羊羊幻想牧场椅子
		    //Array(3010180,300,1,1),//HP椅子
		    Array(3010009,10,1,1),//粉色爱心马桶
		    //Array(3010028,100,1,1),//老海盗椅子
		    //Array(3012006,300,1,1),//风吹稻香
        	//Array(3010013,100,1,1),//悠长假期
        	Array(3010014,300,1,1),//月亮弯
        	Array(3010018,300,1,1),//椰子树沙滩椅
        	Array(3010025,300,1,1),//枫叶纪念凳
        	Array(3012001,300,1,1),//篝火
        	//Array(3012002,100,1,1),//浴桶---
        	Array(3010073,100,1,1),//PB克缤
        	Array(3010049,300,1,1),//雪房子
        	//Array(3010068,300,1,1),//露水椅子
        	Array(3010070,100,1,1),//巨无霸品克缤
        	//rray(3010095,100,1,1),//石头人座椅
//-----后期植入椅子-----
        	Array(3010898,100,1,1),//迷你神兽椅子
        	Array(3010465,100,1,1),//可爱音符椅子
        	Array(3010460,100,1,1),//爆竹椅子
        	Array(3010450,100,1,1),//艾莉珍椅子
        	Array(3010455,100,1,1),//扎昆的帝王椅子
        	Array(3010456,100,1,1),//杜鹃花椅子
        	Array(3010458,100,1,1),//翻滚兔子椅子
        	Array(3010863,300,1,1),//愤怒的美发师椅子
        	Array(3010447,100,1,1),//睡觉小鸟椅子
        	Array(3010446,100,1,1),//皮肤皇后椅子
        	Array(3010448,100,1,1),//泡泡浴椅子
        	Array(3010434,100,1,1),//热带夏日椅子
        	Array(3010428,100,1,1),//水晶椅子
        	Array(3010409,100,1,1),//粽子椅子
      	    //Array(3010094,100,1,1),//漂漂猪椅子-----------------------
        	//Array(3010411,100,1,1),//鱼尾狮椅子
        	//Array(3010085,300,1,1),//鬼娃娃椅子
        	//Array(3010077,100,1,1),//猫头鹰椅子
        	//Array(3010053,300,1,1),//兔子纪念版椅子
        	//Array(3010151,200,1,1),//无人岛椅子
        	//Array(3015415,300,1,1),//猴子椅子
        	//Array(3010142,300,1,1),//水族馆椅子
        	//Array(3010144,100,1,1),//七夕椅子
        	//Array(3015430,100,1,1),//年兽椅子
        	//Array(3010117,100,1,1),//魔法书椅子
        	//Array(3015424,100,1,1),//超级饺子椅子
        	//Array(3015428,100,1,1),//和猴子一起放烟花椅子
        	Array(3015427,100,1,1),//和猴子一起玩麻将椅子
        	//Array(3010804,100,1,1),//军人月妙拜年椅子
        	//Array(3015045,300,1,1),//羊绒咩咩椅子--------------
        	//Array(3010375,300,1,1),//奥妙的超级药水椅子
        	//Array(3015057,300,1,1),//烟花绽放椅子
        	//Array(3010373,300,1,1),//云朵洗手间椅子
        	//Array(3010799,300,1,1),//坟墓幽灵椅子
        	//Array(3010737,300,1,1),//动物英雄团椅子
        	//Array(3010734,100,1,1),//猫箱椅子
        	//Array(3010738,300,1,1),//闪电三人组椅子
        	//Array(3010740,100,1,1),//圣诞树椅子
        	//Array(3010365,100,1,1),//休彼德蔓的古代石掌椅子
        	//Array(3010306,100,1,1),//生如夏花椅子
        	//Array(3010301,300,1,1),//高级HP药水椅子
        	//Array(3010188,100,1,1),//班·雷昂椅子
        	//Array(3010186,100,1,1),//兔子椅子
        	//Array(3010184,300,1,1),//冰钓椅子
         	//Array(3010173,300,1,1),//万圣节塔罗椅子
        	//Array(3010175,300,1,1),//名画家椅子
        	//Array(3010195,100,1,1),//无价之宝椅子
        	Array(3010210,100,1,1),//草莓冰淇淋月饼椅子--------------
        	Array(3010224,300,1,1),//年糕冰淇淋椅子
        	Array(3010036,300,1,1),//浪漫秋千
        	Array(3010044,300,1,1),//同一红伞下
        	//Array(3010111,100,1,1),//虎虎生威
        	//Array(3010115,100,1,1),//熊宝宝床
        	//Array(3010126,300,1,1),//蝙蝠魔王座
        	//Array(3010313,300,1,1),//粉红扎昆椅子
        	//Array(3010128,300,1,1),//黑龙王座
        	//Array(3010133,300,1,1),//帐篷椅
        	//Array(3010152,200,1,1),//黄三角帐篷椅
        	//Array(3010291,300,1,1),//早日康复床
        	Array(3010172,300,1,1),//星空椅子
        	Array(3010168,300,1,1),//友谊万岁椅子
        	Array(3010185,100,1,1),//小伙伴品克缤
        	Array(3010622,100,1,1),//我的好友丹珍之椅
        	Array(3010453,300,1,1),//兔子乘风椅
        	Array(3010493,300,1,1),//那就是我--------------------------------
        	Array(3010527,300,1,1),//深海章鱼
        	Array(3010531,300,1,1),//小企鹅合唱团
        	Array(3010565,300,1,1),//我的女皇椅子
        	Array(3010587,300,1,1),//时间胶囊
        	Array(3010609,300,1,1),//不是在做梦
        	Array(3010608,300,1,1),//完美的名画椅子
        	Array(3010661,300,1,1),//欢乐相框椅子
        	Array(3010678,300,1,1),//海加顿之安息
        	Array(3010739,300,1,1),//雪人香波椅子
        	Array(3010744,300,1,1),//冒险岛的砖头朋友们
        	Array(3010752,300,1,1),//玫瑰鸟笼
        	Array(3010756,300,1,1),//新年招财猫椅子
        	Array(3010767,300,1,1),//雪人椅子
        	Array(3010760,300,1,1),//古代浴池椅子
        	Array(3010795,300,1,1),//森林中休息处
        	Array(3010806,300,1,1),//桃樱芳菲椅
        	Array(3010848,300,1,1),//红地毯主人公椅子
        	Array(3012024,50,1,1)//沙滩排球椅子
);

function start() {
	status = -1;
	action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == 1) {
        status++;
    } else {
        if (status == 0) {
           selStr = "#e#r该玩具箱可以获得以下物品，99%获得\r\n\#b是否消耗 #b3000万\r\n来一发？#n#k\r\n";
		   for (i = 0; i < itemList.length; i++) {
                selStr += "#d#v" + itemList[i][0] + "#";
            }
			
			cm.sendOk(selStr);
            cm.dispose();
        }
        status--;
    }
    if (status == 0) {
		selStr = "\r\n";
		   for (i = 0; i < itemList.length; i++) {
                selStr += "#d#v" + itemList[i][0] + "#";
            }
        if (cm.getMeso() > 30000000) {
            cm.sendYesNo("只要你有3000万，就可以随机可以获得以下物品，99%获得\r\n\#b是否消耗 #r3000万金币\r\n\#g来一发?"+selStr);
        } else {
            cm.sendOk("只要你有3000万，就可以随机获得以下物品，99%获得\r\n\#b是否消耗 #b3000万金币\r\n来一发？?"+selStr);
            cm.safeDispose();
        }
    } else if (status == 1) {
        var chance = Math.floor(Math.random() * 200);
        var finalitem = Array();
        for (var i = 0; i < itemList.length; i++) {
            if (itemList[i][1] >= chance) {
                finalitem.push(itemList[i]);
            }
        }
        if (finalitem.length != 0) {
            var item;
            var random = new java.util.Random();
            var finalchance = random.nextInt(finalitem.length);
            var itemId = finalitem[finalchance][0];
            var quantity = finalitem[finalchance][2];
            var notice = finalitem[finalchance][3];
            item = cm.gainGachaponItem(itemId, quantity, "抽奖箱", notice);
            if (item != -1) {
                cm.gainMeso(-30000000);
                cm.sendOk("你获得了 #b#t" + item + "##k " + quantity + "个。");
            } else {
                cm.sendOk("你确实有#b3000万吗？如果是，请你确认在背包的装备，消耗，其他窗口中是否有一格以上的空间。");
            }
            cm.safeDispose();
        } else {
            cm.sendOk("今天的运气可真差，什么都没有拿到，但是不扣你金币拉。");
            cm.gainMeso(-1);
            cm.safeDispose();
        }
    }
}