var status = 0;
var itemList =   
Array(   		
                        Array(1102382,150,1,1), //极真·比耶莫特披风
                        Array(1102383,50,1,1), //极真·夏其尔披风
                Array(1302138,30,1,1), //柳德之剑
                Array(1302137,30,1,1), //柳德之剑
                Array(1302136,30,1,1), //柳德之剑
                Array(1302140,30,1,1), //柳德之剑
                Array(1302173,30,1,1), //柳德之剑
                Array(1092048,20,1,1), //小天锁
                Array(1402300,30,1,1), //柳德之剑
                Array(1302139,2,1,1), //柳德之剑
                Array(1302156,2,1,1), //柳德之剑
                Array(1302158,2,1,1), //柳德之剑9
                Array(1402301,2,1,1), //小天锁
                Array(1402302,2,1,1), //小天锁
                Array(1402311,5,1,1), //柳德之剑
                Array(1402329,30,1,1), //柳德之剑
                Array(1402330,5,1,1), //柳德之剑
                Array(1402331,5,1,1), //柳德之剑
                Array(1432154,30,1,1), //柳德之剑
                Array(1432153,30,1,1), //柳德之剑
                Array(1432037,50,1,1), //枫叶
                Array(1432060,30,1,1), //柳德之剑
                Array(1442100,50,1,1), //东东鱼
                Array(1442112,50,1,1), //矛
                Array(1452302,5,1,1), //矛
	                Array(1432045,100,1,1),//
	                Array(1372008,100,1,1),//
	                Array(1302022,100,1,1),//
	                Array(1322102,100,1,1),//
	                Array(1322027,100,1,1),//
	                Array(1322003,100,1,1),//
	                Array(1102163,100,1,1),//
	                Array(1102248,100,1,1),//
	                Array(1402037,80,1,1),//龙背
                        Array(1382173,50,1,1),//死神之刃	
                        Array(1112444,100,1,1), //6周年黄金枫叶戒指
                        Array(1112915,100,1,1), //蓝调戒指 
                        Array(1112720,100,1,1), //天使冒险岛终结者戒指+心					 		 
			Array(1102042,100,1,1),//浪人披风(紫) 
			Array(1102041,50,1),//浪人披风(粉)				
			Array(1012070,100,1,1),//雪糕+攻
			Array(1022067,100,1,1),//黑狐猴		  
			Array(1402063,100,1,1),//樱花伞
			Array(1302058,100,1,1),//枫叶伞			
			Array(1092022,100,1,1),//调色板盾牌					
			Array(1302063,100,1,1),//燃烧的火焰刀
			Array(1302106,100,1,1),//燃烧的冰焰刀
			Array(1302080,150,1,1),//冒险岛小灯泡
			Array(1302085,150,1,1),//叉子
			Array(1302087,150,1,1),//火炬
			Array(1402044,150,1,1),//南瓜灯笼
			Array(1302061,220,1,1),//蔓藤鞭子
			Array(1432046,150,1,1),//圣诞树手杖
        	        Array(1302024,100,1,1),//废报纸武器
        	        Array(1322051,150,1,1),//七夕
        	        Array(1402014,30,1,1),//温度计
        	        Array(1402029,100,1,1),//鬼刺狼牙棒
        	        Array(1332053,150,1,1),//野外烧烤
        	        Array(1372017,150,1,1),//领路灯
		        Array(1442039,50,1,1),//冻冻鱼
        	        Array(1332021,100,1,1),//乌龙茶
			Array(1302036,150,1,1),//枫叶小旗 
                         Array(1092049,100,1,1),//热情剑盾
			Array(1302049,100,1,1),//光线鞭
        	Array(3010734,200,1,1),//猫箱椅子
        	Array(3010738,220,1,1),//闪电三人组椅子
        	Array(3010740,200,1,1),//圣诞树椅子
        	Array(3010365,200,1,1),//休彼德蔓的古代石掌椅子
        	Array(3010301,220,1,1),//高级HP药水椅子
        	Array(3010188,200,1,1),//班·雷昂椅子
        	Array(3010186,200,1,1),//兔子椅子
        	Array(3010184,220,1,1),//冰钓椅子
         	Array(3010173,220,1,1),//万圣节塔罗椅子
        	Array(3010175,220,1,1),//名画家椅子
        	Array(3010210,200,1,1),//草莓冰淇淋月饼椅子--------------
        	Array(3010224,220,1,1),//年糕冰淇淋椅子
        	Array(3010036,220,1,1),//浪漫秋千
        	Array(3010044,220,1,1),//同一红伞下
        	Array(3010111,200,1,1),//虎虎生威
        	Array(3010115,200,1,1),//熊宝宝床
        	Array(3010144,200,1,1),//七夕椅子
        	Array(3015430,200,1,1),//年兽椅子
        	Array(3010117,200,1,1),//魔法书椅子
        	Array(3015424,200,1,1),//超级饺子椅子
        	Array(3015428,200,1,1),//和猴子一起放烟花椅子
        	Array(3010804,200,1,1),//军人月妙拜年椅子
        	Array(3015045,300,1,1),//羊绒咩咩椅子--------------
        	Array(3010375,300,1,1),//奥妙的超级药水椅子
        	Array(3015057,300,1,1),//烟花绽放椅子
        	Array(3010373,300,1,1),//云朵洗手间椅子
        	Array(3010799,300,1,1),//坟墓幽灵椅子
        	Array(3010737,300,1,1),//动物英雄团椅子

        	Array(3010126,300,1,1),//蝙蝠魔王座
        	Array(3010313,300,1,1),//粉红扎昆椅子
        	Array(3010128,300,1,1),//黑龙王座
        	Array(3010133,300,1,1),//帐篷椅
        	Array(3010152,200,1,1),//黄三角帐篷椅
        	Array(3010291,300,1,1),//早日康复床
        	Array(3010172,200,1,1),//星空椅子
        	Array(3010168,200,1,1),//友谊万岁椅子
        	Array(3010185,200,1,1),//小伙伴品克缤
        	Array(3010531,300,1,1),//小企鹅合唱团
        	Array(3010565,300,1,1),//我的女皇椅子
        	Array(3010587,300,1,1),//时间胶囊
        	Array(3010609,300,1,1),//不是在做梦
        	Array(3010608,300,1,1),//完美的名画椅子
        	Array(3010661,300,1,1),//欢乐相框椅子
        	Array(3010458,200,1,1),//翻滚兔子椅子
        	Array(3010446,200,1,1),//皮肤皇后椅子
        	Array(3010739,100,1,1),//雪人香波椅子
            Array(3010493,200,1,1),//那就是
            Array(3010531,200,1,1),//小企鹅合唱团
            Array(3010306,200,1,1),//生如夏花椅子
            Array(3010195,200,1,1),//无价之宝椅子
            Array(3010453,150,1,1),//兔子乘风椅
        	Array(3010151,200,1,1),//无人岛椅子
		Array(3010043,200,1,1),//魔女的飞扫把
		Array(3010028,200,1,1),//老海盗椅子
        	Array(3010018,300,1,1),//椰子树沙滩椅
        	Array(3010025,300,1,1),//枫叶纪念凳
        	Array(3010898,200,1,1),//迷你神兽椅子
        	Array(3010465,200,1,1),//可爱音符椅子
        	Array(3010450,200,1,1),//艾莉珍椅子
        	Array(3010863,300,1,1),//愤怒的美发师椅子
        	Array(3010447,200,1,1),//睡觉小鸟椅子

        	Array(3010448,200,1,1),//泡泡浴椅子
        	
        	Array(3010428,200,1,1),//水晶椅子
        	Array(3010409,200,1,1),//粽子椅子
      	    Array(3010094,200,1,1),//漂漂猪椅子-----------------------
        	Array(3010411,200,1,1),//鱼尾狮椅子
        	Array(3010085,300,1,1),//鬼娃娃椅子
        	Array(3010077,200,1,1),//猫头鹰椅子
        	Array(3010053,200,1,1),//兔子纪念版椅子
        	Array(3010678,10,1,1),//海加顿之安息
            Array(3015096,50,1,1),//羊羊七七牧场椅子
	    Array(3015183,50,1,1),//绿水灵背景椅子						
	    Array(3010622,50,1,1),//我的好友丹珍之椅	

            Array(3010795,200,1,1),//森林中休息处
        	Array(3010744,150,1,1),//冒险岛的砖头朋友们
        	Array(3010752,150,1,1),//玫瑰鸟笼
        	Array(3010756,150,1,1),//新年招财猫椅子
        	Array(3010767,150,1,1),//雪人椅子
        	Array(3010760,50,1,1),//古代浴池椅子
        	Array(3010806,80,1,1),//桃樱芳菲椅
        	Array(3010848,50,1,1),//红地毯主人公椅子
        	Array(3010456,80,1,1),//杜鹃花椅子
		   Array(3010043,200,1,1),//魔女的飞扫把

		    Array(3010028,100,1,1),//老海盗椅子
        	Array(3010018,300,1,1),//椰子树沙滩椅
        	Array(3010025,300,1,1),//枫叶纪念凳
        	Array(3010898,200,1,1),//迷你神兽椅子
        	Array(3010465,200,1,1),//可爱音符椅子
        	Array(3010460,200,1,1),//爆竹椅子
        	Array(3010450,200,1,1),//艾莉珍椅子
        	Array(3010863,300,1,1),//愤怒的美发师椅子
        	Array(3010447,200,1,1),//睡觉小鸟椅子
        	Array(3010448,200,1,1),//泡泡浴椅子
        	Array(3010428,200,1,1),//水晶椅子
        	Array(3010409,200,1,1),//粽子椅子
      	    Array(3010094,100,1,1),//漂漂猪椅子-----------------------
        	Array(3010411,200,1,1),//鱼尾狮椅子
        	Array(3010085,300,1,1),//鬼娃娃椅子
        	Array(3010077,200,1,1),//猫头鹰椅子
        	Array(3010053,300,1,1),//兔子纪念版椅子
        	Array(3015415,300,1,1),//猴子椅子


        	Array(3012024,30,1,1)//沙滩排球椅子

);

function start() {
	status = -1;
	action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == 1) {
        status++;
    } else {
        if (status == 0) {
           selStr = "#e#r该玩具箱可以获得以下物品，100%获得\r\n\#b是否消耗 #g1#r个#b#v4000487##n#k\r\n";
		   for (i = 0; i < itemList.length; i++) {
                selStr += "#d#v" + itemList[i][0] + "#";
            }
			
			cm.sendOk(selStr);
            cm.dispose();
        }
        status--;
    }
    if (status == 0) {
		selStr = "\r\n";
		   for (i = 0; i < itemList.length; i++) {
                selStr += "#d#v" + itemList[i][0] + "#";
            }
        if (cm.haveItem(4000487, 1)) {
            cm.sendYesNo("欢迎来到冒险岛玩具抽奖~\r\n#r每次抽取需要#r1个#v4000487#【boss组队获得】"+selStr);
        } else {
            cm.sendOk("欢迎来到冒险岛玩具抽奖~\r\n#r每次抽取需要#r1个#v4000487#【boss组队获得】"+selStr);
            cm.safeDispose();
        }
    } else if (status == 1) {
        var chance = Math.floor(Math.random() * 200);
        var finalitem = Array();
        for (var i = 0; i < itemList.length; i++) {
            if (itemList[i][1] >= chance) {
                finalitem.push(itemList[i]);
            }
        }
        if (finalitem.length != 0) {
            var item;
            var random = new java.util.Random();
            var finalchance = random.nextInt(finalitem.length);
            var itemId = finalitem[finalchance][0];
            var quantity = finalitem[finalchance][2];
            var notice = finalitem[finalchance][3];
            item = cm.gainGachaponItem(itemId, quantity, "玩具抽奖", notice);
            if (item != -1) {
                cm.gainItem(4000487, -1);
                cm.sendOk("你获得了 #b#t" + item + "##k " + quantity + "个。");
            } else {
                cm.sendOk("你确实有#b#v4000487##k吗？如果是，请你确认在背包的装备，消耗，其他窗口中是否有一格以上的空间。");
            }
            cm.safeDispose();
        }
    }
}
