importClass(Packages.tools.处理字符串);

var aaa = "#fUI/UIWindow.img/Quest/icon9/0#";
var zzz = "#fUI/UIWindow.img/Quest/icon8/0#";
var sss = "#fUI/UIWindow.img/QuestIcon/3/0#";

//------------------------------------------------------------------------

var chosenMap = -1;
var monsters = 0;
var towns = 0;
var bosses = 0;
var fuben = 0;

//------------------------------------------------------------------------

var bossmaps = Array(		
		/* Array(702070400,0,"妖僧 "), 	
		Array(230040410,0,"鱼王 "),
        Array(551030100,0,"暴力熊狮子王 "), 		
		Array(220080000,0,"闹钟 "), 
		Array(211042300,0,"扎昆 "), 						
		Array(240050400,0,"暗黑龙王 "),													
		Array(100000005,0,"蘑菇王 "),
		Array(105070002,0,"僵尸蘑菇王 "), 
		Array(105090900,0,"被诅咒的寺院 "), 									
		Array(240020101,0,"格瑞芬多森林 "),
		Array(240020401,0,"喷火龙栖息地 "),
        Array(541020700,0,"千年树精  "), 
 		Array(270050000,0,"时间宠儿 "),
		Array(271030600,0,"希纳斯 "),
		Array(105200000,0,"鲁塔比斯（血腥女王、皮埃尔、半半、贝伦）"),
		Array(401060000,0,"麦格纳斯 "),
		Array(450012500,0,"黑魔法师 ") */
		
		Array(104000400,0,"红蜗牛王"),
		Array(100000005,0,"蘑菇王"), 
		Array(800010100,0,"蓝蘑菇王"), 
		Array(105070002,0,"僵尸蘑菇王"), 
		Array(220050100,0,"提莫"),
		Array(200010300,0,"艾利杰"),
		Array(250010304,0,"肯德熊"),
		Array(250010503,0,"妖怪禅师"),
		Array(251010102,0,"巨型蜈蚣"),
		Array(222010310,0,"九尾狐"),
		Array(105090900,0,"蝙蝠怪"),
		Array(801030000,0,"老板"),
		Array(800020130,0,"天球"),
		Array(240020400,0,"火焰龙"),
		Array(240020100,0,"天鹰"),
		Array(240040401,0,"大海兽"),
		Array(270010500,0,"多多"),
		Array(270020500,0,"玄冰独角兽"),
		Array(270030500,0,"雷卡"),
		Array(220080000,0,"闹钟"),
		Array(230040410,0,"鱼王"),
		Array(105100100,0,"大蝙蝠怪"),
		Array(211042300,0,"扎昆"),
		Array(702070400,0,"武林妖僧"),
		Array(551030100,0,"暴力熊"),
		Array(240050400,0,"暗黑龙王"),
		Array(101073200,0,"地鼠王"), 
		Array(141050200,0,"盖奥勒克"),
		Array(541010100,0,"幽灵船船长"),
		Array(252010300,0,"白毛公猴"),
		Array(211061100,0,"看守阿尼"), 
		Array(231040400,0,"蟾蜍领主"),
		Array(300030300,0,"艾菲尼娅"),
		Array(300010410,0,"查乌"), 
		Array(200101000,0,"薛西斯"), 
		Array(510101300,0,"三头犬"),
		Array(273020400,0,"变形树妖王"), 
		Array(860000022,0,"布波"), 
		Array(270050000,0,"品克缤"),
		Array(541020700,0,"克雷塞尔"),
		Array(271030600,0,"希纳斯"),
		Array(105200000,0,"血腥女王"),
		Array(105200000,0,"皮埃尔"),
		Array(105200000,0,"半半"),
		Array(105200000,0,"贝伦"),
		Array(401060000,0,"麦格纳斯"),
		Array(450012500,0,"黑魔法师")
		);

//------------------------------------------------------------------------

var monstermaps = Array(
		Array(104040000,0,"射手训练场　　　　　适合 1 ~ 15 级玩家。    #r↑加怪#b"), 
		Array(103000101,0,"地铁一号线<第1地区> 适合 20 ~ 30 级玩家。   #r↑加怪#b"), 
		Array(103000105,0,"地铁一号线<第4地区> 适合 50 ~ 70 级玩家。   #r↑加怪#b"), 
		Array(101030110,0,"第1军营　　　　　　 适合 40 ~ 60 级玩家。   #r↑加怪#b"), 
		Array(106000002,0,"危险的峡谷Ⅱ　　　　 适合 40 ~ 60 级玩家。  #r↑加怪#b"), 
		Array(101030103,0,"遗迹发掘地Ⅲ　　　　 适合 40 ~ 60 级玩家。  #r↑加怪#b"), 
		Array(101040001,0,"野猪的领土　　　　　适合 20 ~ 35 级玩家。   #r↑加怪#b"), 
		Array(101040003,0,"钢之黑怪之地　　　　适合 20 ~ 35 级玩家。   #r↑加怪#b"), 
		Array(101030001,0,"野猪的领土Ⅱ　　　　 适合 20 ~ 35 级玩家。  #r↑加怪#b"), 
		Array(104010001,0,"猪的海岸 　　　　　 适合 10 ~ 20 级玩家。   #r↑加怪#b"), 
		Array(105070001,0,"蚂蚁广场 　　　　　 适合 20 ~ 40 级玩家。   #r↑加怪#b"), 
		Array(105090300,0,"龙穴　　　　　　　　适合 40 ~ 70 级玩家。   #r↑加怪#b"), 
		Array(105040306,0,"巨人之林 　　　　　 适合 60 ~ 80 级玩家。   #r↑加怪#b"), 
		Array(230020000,0,"东海叉路　　　　　　适合 30 ~ 40 级玩家。   #r↑加怪#b"), 
		Array(230010400,0,"西海叉路　　　　　　适合 40 ~ 50 级玩家。   #r↑加怪#b"), 
		Array(211041400,0,"死亡之林Ⅳ　　　　　适合 55 ~ 70 级玩家。   #r↑加怪#b"), 
		Array(222010000,0,"乌山入口　　　　　　适合 20 ~ 50 级玩家。   #r↑加怪#b"), 
		Array(220010500,0,"露台大厅　　　　　　适合 40 ~ 70 级玩家。   #r↑加怪#b"), 
		Array(251010000,0,"十年药草地　　　　　适合 45 ~ 60 级玩家。   #r↑加怪#b"), 
		Array(250020000,0,"初级修炼场　　　　　适合 50 ~ 60 级玩家。   #r↑加怪#b"),
		Array(800020130,0,"大佛的邂逅　　　　　适合 50 ~ 70 级玩家。   #r↑加怪#b"), 
		Array(200040000,0,"云彩公园Ⅲ　　　 　适合 35 ~ 60 级玩家。    #r↑加怪#b"),
		Array(541010010,0,"幽灵船２  　　　  　适合 60 ~ 90 级玩家。   #r↑加怪#b"),
		Array(200010301,0,"黑暗庭院Ⅰ　　　　　适合 70 ~ 90 级玩家。   #r↑加怪#b"),
		Array(600020300,0,"狼蛛洞穴Ⅰ　　　　　适合 80 ~ 120 级玩家。  #r↑加怪#b"), 
		Array(240020100,0,"火焰死亡战场　　　　适合 85 ~ 120 级玩家。  #r↑加怪#b"),
		Array(220070201,0,"消失的时间　　　　　适合 85 ~ 120 级玩家。  #r↑加怪#b"), 
		Array(220070301,0,"时间停止之间　　　　适合 95 ~ 120 级玩家。  #r↑加怪#b"),
		Array(240040000,0,"龙的峡谷　　　　    适合 95 ~ 120 级玩家。  #r↑加怪#b"),
		Array(551030100,0,"阴森世界入口　　　　适合 95 ~ 120 级玩家。  #r↑加怪#b"),  
		Array(541020000,0,"乌鲁城入口　　　　　适合 95 ~ 130 级玩家。  #r↑加怪#b"),
		Array(240040510,0,"死龙巢穴    　　　　适合 100 ~ 130 级玩家。 #r↑加怪#b"),
		Array(270030500,0,"忘却之路5     　　　适合 120 ~ 150 级玩家。 #r↑加怪#b"),
		Array(702070400,0,"藏经阁七层     　　 适合 130 ~ 150 级玩家。 #r↑加怪#b"),
		Array(211060410,0,"矮城墙1     　　    适合 130 ~ 150 级玩家。 #r↑加怪#b"),
		Array(240070500,0,"未来之城2230年      适合 140 ~ 160 级玩家。 #r↑加怪#b"),
		Array(240091300,0,"虫群栖息地3         适合 160 ~ 170 级玩家。 #r↑加怪#b"),
		Array(240092300,0,"岩壁巨人躯干2       适合 165 ~ 175 级玩家。 #r↑加怪#b"),
		Array(271000200,0,"变形的提诺之林      适合 170 ~ 180 级玩家。 #r↑加怪#b"),
		Array(703002200,0,"外星人占领地B区3    适合 175 ~ 185 级玩家。 #r↑加怪#b"),
		Array(271030400,0,"骑士团要塞第四区域  适合 180 ~ 190 级玩家。 #r↑加怪#b"),
		Array(273020200,0,"黄昏寂寞岩石路      适合 190 ~ 200 级玩家。 #r↑加怪#b"),
		Array(273020200,0,"黑风高原            适合 195 ~ 205 级玩家。 #r↑加怪#b"),
		Array(410000101,0,"狐狸树中段1         适合 200 ~ 210 级玩家。 #r↑加怪#b"),
		Array(450001010,0,"风干喜悦之地        适合 205 ~ 215 级玩家。 #r↑加怪#b"),
		Array(450001260,0,"隐藏湖畔            适合 210 ~ 220 级玩家。 #r↑加怪#b"),
		Array(310070300,0,"黑色天堂甲板1       适合 215 ~ 225 级玩家。 #r↑加怪#b"),
		Array(105300209,0,"堕落世界树上部树枝  适合 220 ~ 230 级玩家。 #r↑加怪#b"),
		Array(450005120,0,"阳光森林            适合 230 ~ 240 级玩家。 #r↑加怪#b"),
		Array(450005410,0,"洞穴上层通道        适合 240 ~ 245 级玩家。 #r↑加怪#b"),
		Array(450007060,0,"生命起源处6         适合 245 ~ 250 级玩家。 #r↑加怪#b"),
		Array(450007120,0,"橙镜之海3           适合 250 ~ 255 级玩家。 #r↑加怪#b")
		); 

//------------------------------------------------------------------------

var townmaps = Array(
		Array(925020000,0,"#r武陵道场"),
		Array(741000208,0,"钓鱼场地"),
		Array(700000000,0,"婚礼入口"),
		Array(1000000,0,"彩虹村庄"), 
		Array(104000000,0,"明珠港口"), 
		Array(100000000,0,"射手村庄"), 
		Array(100000104,0,"射手美发"), 
		Array(101000000,0,"魔法密林"), 
		Array(102000000,0,"勇士部落"), 
		Array(103000000,0,"废弃都市"), 
		Array(120000000,0,"诺特勒斯"),
		Array(105040300,0,"林中之城"),
		Array(103040000,0,"废都广场"),
		Array(106020000,0,"蘑菇城堡"),
		Array(140000000,0,"冰岛里恩"),
		Array(200000000,0,"天空之城"),
		Array(211000000,0,"冰峰雪域"),
		Array(230000000,0,"水下世界"),  
		Array(222000000,0,"童话村庄"), 
		Array(220000000,0,"玩具城堡"),
		Array(701000000,0,"东方神州"),
		Array(250000000,0,"武陵桃源"),
		Array(702000000,0,"少林寺庙"), 
		Array(500000000,0,"水上泰国"),
		Array(260000000,0,"阿里安特"), 
		Array(600000000,0,"新叶城市"),
		Array(240000000,0,"神木村庄"),
		Array(261000000,0,"玛加提亚"), 
		Array(221000000,0,"地球本部"), 
		Array(251000000,0,"百味草堂"),
		Array(701000200,0,"上海豫园"),
		Array(550000000,0,"吉隆都市"),
		Array(130000000,0,"女皇圣地"),
		Array(551000000,0,"甘榜村庄"),
		Array(801000000,0,"昭和村庄"), 
		Array(540000000,0,"新加坡市"),
		Array(270000000,0,"时间神殿"), 
		Array(702100000,0,"大雄宝殿"), 
		Array(800000000,0,"古代神社"), 
		Array(130000200,0,"圣地岔路"),
		Array(271000000,0,"未来之门"),
		Array(271010000,0,"破坏射手"),
		Array(273000000,0,"黄昏勇士"),
		Array(703000000,0,"未来新叶"),
		Array(401000000,0,"赫里总部"),
		Array(401040000,0,"赫里黑市"),
		Array(200100000,0,"克里塞岛"), 
		Array(240090000,0,"岩壁本部"), 
		Array(262010000,0,"阿斯旺城"), 
		Array(231000000,0,"樱之城镇"), 
		Array(211060010,0,"狮子王城"),
		Array(510000000,0,"维拉森特"),
		Array(300000000,0,"艾琳森林"), 
		Array(272000000,0,"次元缝隙"), 
		Array(400000000,0,"万神之殿"), 
		Array(410000000,0,"尖耳狐村"),
		Array(240070000,0,"塔拉森林"),
		Array(105200000,0,"巨大树根"), 
		Array(863100000,0,"绯红村庄"), 
		Array(310070000,0,"机械坟墓"),
		Array(310070310,0,"黑色天堂"),
		Array(105300000,0,"堕落树根"),
		Array(450001000,0,"忘却之湖"),
		Array(490000000,0,"阿尔卡那"),
		Array(882110000,0,"拉克兰市"),
		Array(450007000,0,"埃斯佩拉")
		
		
		//Array(749020000,0,"国庆蛋糕地图")
		);

//------------------------------------------------------------------------

var fubenmaps = Array(
		Array(105040316,10,"沉睡森林跳跳"),	
										Array(103000900,10,"地铁三号线跳跳"), 
										Array(109040001,10,"冒险岛活动跳跳"),     
										Array(280020000,10,"火山跳跳"), 
										Array(101000100,10,"忍苦跳跳") 											
		);






//------------------------------------------------------------------------

	function start() {
		chosenMap = -1;
		monsters = 0;
		towns = 0;
		bosses = 0;
		fuben = 0;
		status = -1;
		action(1, 0, 0);
		}
	function action(mode, type, selection) {
	if (mode == -1) {
		cm.sendOk("#b好的,下次再见.");
		cm.dispose();
		} else {
	if (status >= 0 && mode == 0) {
		cm.sendOk("#b好的,下次再见.");
		cm.dispose();
		return;
		}
	if (mode == 1) {
		status++;
		} else {
		status--;
		}

//------------------------------------------------------------------------

	if (status == 0) {
		if(Packages.snail.Marathon.isBegain() && cm.haveItem(Packages.snail.Marathon.getItemId())){
			cm.sendOk("#r马拉松比赛正在进行中，检测到你持有 #v" + Packages.snail.Marathon.getItemId() + "#，无法进行传送！\r\n")
			cm.dispose();
			return;
		}
		switch(cm.getPlayer().getMapId()){
			case 220080001:
			case 280030000:
			case 240060200:
			case 270050100:
			case 930000600:
			case 910000080:
			case 105100300:
				cm.sendOk("#r该地图不允许传送，请点击地图内的NPC或从传送口离开后再使用该功能！\r\n")
				cm.dispose();
				return;
			
		}
		
   	    var add = "　　　　　　　　　#r#k\r\n\r\n";

//		add += "#r　　　　　　　　　新物品展览#k\r\n";

//		add += "#b座椅#k\r\n";

//		add += "#v3010154# #v3010179# #v3010169# #v3010171# #v3010174# #v3010182# #v3010183# #v3010053##b\r\n\r\n";

//		add += "#b坐骑#k\r\n";

//		add += "#v1902060# #v1912053# #v1902062# #v1912055# #v1902063# #v1912056# #v1902040# #v1912057#\r\n\r\n";

		add += "#L0##b#e城镇传送#l";
		add += "#L2##r自由市场#l";
		add += "#L1##b练级传送#l";
		add += "#L6##r怪物公园#l\r\n\r\n";
		add += "#L4##b跳跳地图#l";
		add += "#L5##r#e副本传送#l";
		add += "#L3##bBOSS传送#l\r\n\r\n";
		cm.sendSimple (add);    

//------------------------------------------------------------------------
				
	} else if (status == 1) {

	if (selection == 0){
		var selStr = "#d　　　　　　　　　选择你的目的地吧:#k#b\r\n";
		for (var i = 0; i < townmaps.length; i++) {
			selStr += "#L" + i + "#" + townmaps[i][2] + " ";
			if((i + 1) % 4 == 0){
				selStr += "\r\n";
			}
		}
		cm.sendSimple(selStr);
		towns = 1;
	}else if (selection == 1) {
		var selStr = "#d　　　　　　　　　选择你的目的地吧.#k#b";
		for (var i = 0; i < monstermaps.length; i++) {
		selStr += "\r\n#L" + i + "#" + monstermaps[i][2] + "";
		}
		cm.sendSimple(selStr);
		monsters = 1;
	}else if (selection == 2) {
		cm.warp(910000000, 0);
		cm.dispose();
	}else if (selection == 3) {
		var selStr = "#k#d　　　　　　　　　选择你的目的地吧:#k#b\r\n";
		for (var i = 0; i < bossmaps.length; i++) {
			selStr += "#r#L" + i + "#" + 处理字符串.formatString(10, " ", bossmaps[i][2]) + "";
			if((i + 1) % 4 == 0){
				selStr += "\r\n";
			}
		}
		cm.sendSimple(selStr);
		bosses = 1;
	}else if (selection == 4) {
		var selStr = "#d　　　　　　　　　选择你的目的地吧.#k#b";
		for (var i = 0; i < fubenmaps.length; i++) {
		selStr += "\r\n#L" + i + "#" + fubenmaps[i][2] + "";
		}
		cm.sendSimple(selStr);
		fuben = 1;
	}else if (selection == 5) {
		cm.warp(701000210, 0);
		cm.dispose();
	}else if (selection == 6){
		cm.warp(951000000,0);
		cm.dispose();
	}


//------------------------------------------------------------------------

	} else if (status == 2) {

	if (towns == 1) {
		cm.sendYesNo("你确定要去 " + townmaps[selection][2] + "?");
		chosenMap = selection;
		towns = 2;

	} else if (monsters == 1) {
		cm.sendYesNo("你确定要去 " + monstermaps[selection][2] + "?");
		chosenMap = selection;
		monsters = 2;

	} else if (bosses == 1) {
		cm.sendYesNo("你确定要去 " + bossmaps[selection][2] + "?");
		chosenMap = selection;
		bosses = 2;

	} else if (fuben == 1) {
		cm.sendYesNo("你确定要去 " + fubenmaps[selection][2] + "?");
		chosenMap = selection;
		fuben = 2;

		}

//----------------------------------------------------------------------

	} else if (status == 3) {

	if (towns == 2) {
		if(cm.getMeso()>=townmaps[chosenMap][1]){
		cm.warp(townmaps[chosenMap][0], 0);
		cm.gainMeso(-townmaps[chosenMap][1]);
		}else{
		cm.sendOk("你没有足够的金币哦!");
		}
		cm.dispose();

	} else if (monsters == 2) {
		if(cm.getMeso()>=monstermaps[chosenMap][1]){
		cm.warp(monstermaps[chosenMap][0], 0);
		cm.gainMeso(-monstermaps[chosenMap][1]);
		}else{
		cm.sendOk("你没有足够的金币哦!");
		}
		cm.dispose();

	} else if (bosses == 2) {
		if(cm.getMeso()>=bossmaps[chosenMap][1]){
		cm.warp(bossmaps[chosenMap][0], 0);
		if(cm.getPlayer().getMapId() == 100000005 || cm.getPlayer().getMapId() == 105070002 || cm.getPlayer().getMapId() == 105090900){
			//cm.给当前地图时钟(5, true, true);
		}
		cm.gainMeso(-bossmaps[chosenMap][1]);
		}else{
		cm.sendOk("你没有足够的金币哦!");
		}
		cm.dispose();

	} else if (fuben == 2) {
		if(cm.getMeso()>=fubenmaps[chosenMap][1]){
		cm.warp(fubenmaps[chosenMap][0], 0);
		cm.gainMeso(-fubenmaps[chosenMap][1]);
		}else{
		cm.sendOk("你没有足够的金币哦!");
		}
		cm.dispose();

                }

//------------------------------------------------------------------------

		}
		}
		}

