var mapId = 889100001;
var index = 0;
var itemList=Array(
	Array(4310150, 250), //商品纪念币
	Array(2049752, 350), //S级潜能卷轴 30%
	Array(4310150, 450), //商品纪念币
	Array(2433646, 300),  //星星100个交换券
	Array(2022956, 500),  //火红玫瑰
	Array(5062009, 200),  //终极魔方
	Array(5062010, 600),  //终极魔方
	Array(1112663, 240),  //白天使的祝福
	Array(2430471, 550),  //终极魔方
	Array(2430471, 550),  //终极魔方
	Array(2430471, 550),  //终极魔方
	Array(2340000, 550),  //祝福卷轴
	Array(5072000, 550),  //高质地喇叭
	Array(1112586, 210),  //白天使的祝福
	Array(5073000, 550),  //心脏高级喇叭
	Array(5074000, 550),  //白骨高级喇叭
	Array(2049135, 300),  //惊人正义混沌卷轴 20%
	Array(2049122, 100),  //正向混沌卷轴
	Array(5010110, 50),  //伦娜之庇护
	Array(1112191, 100), //蜜蜂名片戒指
	Array(1115004, 100), //蜜蜂聊天戒指
	Array(1112190, 100), //爱吃胡萝卜兔名片戒指
	Array(1115003, 100), //爱吃胡萝卜兔聊天戒指
	Array(1112959, 100), //蝶恋花特效戒指
	Array(1112181, 100), //云朵羊咩咩名片戒指
	Array(1112294, 100), //云朵羊咩咩聊天戒指
	Array(1112183, 100), //羊咩咩名片戒指
	Array(1112296, 100), //羊咩咩聊天戒指
	Array(5010044, 100), //幻影残像
	Array(4080000, 100), //绿水灵/蘑菇五目石
	Array(4080006, 100), //吹泡泡双鱼/玩具粉熊五子棋套
	Array(4080007, 100), //吹泡泡双鱼/绿蜘蛛五子棋套
	Array(4080008, 100), //玩具粉熊/绿蜘蛛五子棋套
	Array(4080009, 100), //玩具熊猫/吹泡泡双鱼五子棋套
	Array(4080010, 100), //玩具熊猫/玩具粉熊五子棋套
	Array(4080011, 100), //玩具熊猫/绿蜘蛛五子棋套4080100
	Array(4080100, 100), //记忆大考验
	Array(1004757, 100), //记忆大考验
	Array(1004665, 100), //记忆大考验
	Array(1004706, 100), //记忆大考验
	Array(1004580, 100), //记忆大考验
	Array(1004597, 100), //记忆大考验
	Array(1004598, 100), //记忆大考验
	Array(1004599, 100), //记忆大考验
	Array(1004488, 100), //记忆大考验
	Array(1004428, 100), //记忆大考验
	Array(1052975, 100), //记忆大考验
	Array(1050414, 100), //记忆大考验
	Array(1050418, 100), //记忆大考验
	Array(1042037, 100), //记忆大考验
	Array(3012021, 100), //彩虹云朵椅子
	Array(3012027, 10), //羊羊热气球椅子
	Array(3012007, 100), //石狮椅子
	Array(3012008, 100), //稻荷神社椅子
	Array(3012030, 100), //和你在一起椅子
	Array(3012001, 100), //篝火
	Array(3010736, 100), //萌萌育婴摇篮
	Array(3012022, 100), //寿司小火车椅子
	Array(3012023, 100), //mPhone椅子
	Array(3012010, 100), //巧克力蛋糕恋人
	Array(3012011, 100), //我爱巧克力火锅
	Array(3012024, 100), //沙滩排球椅子
	Array(3012025, 10), //小鸡弹簧床椅子
	Array(3012026, 10), //旋转花茶杯情侣椅子
    Array(1202023, 100), // 真·乔图腾 // 聚集了乔的强烈灵魂的强力图腾。
    Array(1202024, 300),  // 金·乔图腾 // 根据乔的样子所做的黄金图腾。
    Array(1202025, 300),  // 银·乔图腾 // 根据乔的样子所做的银图腾。
    Array(1202026, 300),  // 木·乔图腾 // 根据乔的样子所做的木图腾。
    Array(1202027, 100),  // 真·海丽蜜图腾 // 聚集了海丽蜜的强烈灵魂的强力图腾。
    Array(1202028, 300),  // 金·海丽蜜图腾 // 根据海丽蜜的样子所做的黄金图腾。
    Array(1202029, 300),  // 银·海丽蜜图腾 // 根据海丽蜜的样子所做的银图腾。
    Array(1202030, 300),  // 木·海丽蜜图腾 // 根据海丽蜜的样子所做的木图腾。
    Array(1202031, 100),  // 真·小龙图腾 // 聚集了小龙的强烈灵魂的强力图腾。
    Array(1202032, 300),  // 金·小龙图腾 // 根据小龙的样子所做的黄金图腾。
    Array(1202033, 300),  // 银·小龙图腾 // 根据小龙的样子所做的银图腾。
    Array(1202034, 300),  // 木·小龙图腾 // 根据小龙的样子所做的木图腾。
    Array(1202035, 100),  // 真·李卡司图腾 // 聚集了李卡司的强烈灵魂的强力图腾。
    Array(1202036, 300),  // 金·李卡司图腾 // 根据李卡司的样子所做的黄金图腾。
    Array(1202037, 300),  // 银·李卡司图腾 // 根据李卡司的样子所做的银图腾。
    Array(1202038, 300),  // 木·李卡司图腾 // 根据李卡司的样子所做的木图腾。
    Array(1202039, 300),  // 黑·酷咪图腾 // 根据穿着黑色运动服的酷咪导师的样子所做的图腾。
    Array(1202040, 300),  // 粉·酷咪图腾 // 根据穿着粉红色运动服的酷咪导师的样子所做的图腾。
    Array(1202041, 300),  // 白·酷咪图腾 // 根据穿着白色运动服的酷咪导师的样子所做的图腾。
    Array(1202042, 300),  // 红·酷咪图腾 // 根据穿着红色运动服的酷咪导师的样子所做的图腾。
    Array(1202083, 100),  // 真·伊昆图腾 // (无描述)
    Array(1202084, 300),  // 金·伊昆图腾 // (无描述)
    Array(1202085, 300),  // 银·伊昆图腾 // (无描述)
    Array(1202086, 300),  // 铜·伊昆图腾 // (无描述)
	Array(3010895, 100), // 阿卡伊勒童话书椅子, 100), // 感觉和阿卡伊勒的关系好像变得亲近一些的椅子。每10秒HP恢复100，MP恢复50。
	Array(3010896, 100), // 我的女皇椅子, 100), // 可以感觉到女王的火热人气的椅子。每10秒HP恢复100，MP恢复50。
	Array(3010897, 100), // 生日快乐，恶魔, 100), // 坐在椅子上的恶魔猎手的表情感觉很奇怪。每10秒HP恢复100，MP恢复50。
	Array(3010898, 100), // 迷你神兽椅子, 100), // 坐在迷你神兽椅子上时，每10秒HP恢复50，MP恢复50。
	Array(3010899, 100), // 摆钟椅子, 100), // 坐在钟摆椅子上时，每10秒HP恢复50，MP恢复50。
	Array(3010900, 100), // 宝石枫叶椅子, 100), // 用宝石做成的闪亮枫叶椅子。坐下后每10秒恢复HP 40, MP 20。
	Array(3010901, 100), // 热情的红色药水椅子, 100), // 和其他药水椅子相比，可以更快地恢复HP的红色药水椅子。每10秒HP恢复110，MP恢复50。
	Array(3010902, 100), // 新鲜的蓝色药水椅子, 100), // 和其他药水椅子相比，可以更快地恢复MP的蓝色药水椅子。每10秒HP恢复100，MP恢复60。
	Array(3010903, 100), // 兔子椅子, 100), // 坐在上面，每10秒HP恢复100，MP恢复50的兔子椅子。
	Array(3010904, 100), // 椰子树沙滩椅, 100), // 放在阿里安特凉爽的椰子树下的沙滩椅。坐在上面，每10秒HP恢复40，MP恢复20。
	Array(3010905, 50), // 柿子树鞦韆, 100), // 吊挂在挂满成熟柿子的柿子树上的鞦韆。
	Array(3010906, 50), // 云朵洗手间椅子, 100), // 装修豪华的洗手间。里面一切应有尽有。每10秒HP恢复100，MP恢复50。
	Array(3010907, 50), // 公沙沙兔靠垫, 100), // 靠着可爱的公沙沙兔坐着，每10秒HP恢复60。
	Array(3010908, 50), // 海蓝天鹅绒沙发, 100), // 奢华的海蓝色天鹅绒沙发。坐在上面，每10秒HP恢复60。
	Array(3010909, 50), // 红色设计师椅子, 100), // 采用明亮红色的设计师椅子。坐在上面，每10秒HP恢复60。
	Array(3010910, 50), // 艾莉珍椅子, 100), // 可以成为可爱的少女艾莉珍的好朋友。每10秒HP恢复50，MP恢复50。
	Array(3010911, 100), // 红帽月妙抱枕椅, 100), // 坐在抱枕椅上就可以看到戴著红色帽子的可爱月妙的才艺。
	Array(3010912, 100), // 蓝帽月妙抱枕椅, 100), // 坐在抱枕椅上就可以看到戴著蓝色帽子的可爱月妙的才艺。
	Array(3010913, 100), // 扇子月妙抱枕椅, 100), // 坐在抱枕椅上就可以观赏拿著扇子走绳索的月妙的才艺。
	Array(3010914, 100), // 太平萧月妙抱枕椅, 100), // 坐在抱枕椅上就可以观赏史出浑身力量演奏的月妙。
	Array(3010915, 100), // 恶灵附身的娃娃椅子, 100), // 恶灵附身的娃娃椅子。坐在上面，每10秒HP恢复50。
	Array(3010916, 100), // 粉红沙滩遮阳伞, 100), // 让人想起凉爽的大海的粉红色沙滩遮阳伞。坐在上面，每10秒HP恢复60。
	Array(3010917, 100), // 红色龙椅, 100), // 有严肃的火龙相伴的椅子。每10秒HP恢复50，MP恢复50。
	Array(3010918, 100), // 蓝色龙椅, 100), // 有严苛的青龙相伴的椅子。每10秒HP恢复50，MP恢复50。
	Array(3010919, 100), // 精灵王座, 100), // 为精灵之王制作的椅子。每10秒HP恢复100，MP恢复50。
	Array(3010920, 100), // 水晶月亮, 100), // 怪盗幻影专用椅子，坐下去后每10秒都能恢复HP。
	Array(3010921, 100), // 彩蛋篮子, 100), // 篮子中塞满五彩缤纷的彩蛋!\n每10秒钟恢复HP40,MP40.
	Array(3010922, 100), // 悠长假期(红色), 100), // 坐在上面可享受悠闲的红色悠长假期,每10秒钟恢复MP 20.
	Array(3010923, 100), // 10周年椅子, 100), // 为纪念冒险岛10周年而制作的巨无霸椅子。每10秒钟，HP和MP各恢复50.
	Array(3010936, 10), // 青蛙跳楼机, 100), // 由中国玩家“小术”设计的可同时乘坐多人的青蛙跳楼机椅子。坐下时，每10秒中，可恢复HP，MP各500。
	Array(3010894, 10), // 一杯咖啡的悠闲, 100), // 享受一杯咖啡的浓郁的香味。坐下时，每10秒中，可恢复HP，MP各50。
	Array(3010747, 10), // 和风纸鸢椅子, 100), // 充满和风的纸鸢椅子。坐下时，每10秒中，可恢复HP，MP各50。
	Array(3010748, 10), // 日式拉面椅, 100), // 浓郁的日式传统拉面，香气四溢。坐下时，每10秒中，可恢复HP，MP各50。
	Array(3010750, 10), // 焦糖布丁椅子, 100), // 软软的焦糖布丁，香甜可口。坐下时，每10秒中，可恢复HP，MP各50。
	Array(3010795, 10), // 森林中休息处(椅子), 100), // 可以在宁静的森林中休息的椅子。坐上时，每10秒恢复HP、MP500。
	Array(3010794, 20), // 抖动的舌头椅子, 100), // 抖动的舌头椅子，坐在上面随时可能被丑陋的怪物吃掉哦。坐上时，每10秒恢复HP、MP500。
	Array(3010799, 50), // 坟墓幽灵椅子, 100), // 坐在椅子上，将化身为游走在坟墓中的幽灵。坐上时，每10秒恢复HP、MP500。
	Array(3010714, 20), // 堆王冠, 100), // 由5个不同颜色的王冠一层层堆积起来的椅子。坐上时，每10秒恢复HP、MP500。
	Array(3010732, 20), // 翅膀自行车椅子, 100), // 坐上时，每10秒恢复HP、MP500。
	Array(3012019, 10), // 爱琴海椅子, 100), // 由中国玩家“小术”设计的双人椅子。在浪漫的爱情海，和喜欢的人一起坐在圣爱殿堂中，感受幸福与甜蜜。两人靠近后坐下会出现爱琴海圣爱殿堂的浪漫特效。坐上时，每10秒恢复HP、MP500。
	Array(3010813, 100), // 爱情水晶球的回忆, 100), // 由中国玩家“小术”设计的椅子。装满了满满幸福甜蜜回忆的爱情水晶球。坐上时，每10秒恢复HP、MP500。
	Array(3012020, 100), // 紫藤花吊篮椅, 100), // 由中国冒险岛玩家“小术”设计的情侣椅子，两个人坐一起时产生漂亮的背景效果，每5秒恢复HP/MP 500
	Array(3010820, 10), // 迷你玩具别墅椅子, 100), // 想休息的时候，就到我的别墅来。每10秒，HP恢复500，MP恢复500。
	Array(3010806, 10), // 桃樱芳菲椅, 100), // 百花齐放，惬意悠悠。每10秒钟恢复HP50、MP50。
    Array(3010780, 10), // 旋转木马, 100), // 承载着梦想的木马，带你驶向幸福的彼岸。坐上时，每10秒恢复HP、MP100。
	Array(3010779, 10), // 金马祥云轿, 100), // 由中国玩家“小术”设计。金马祥云轿，腾云驾雾来报到。象征马年吉祥如意的椅子。坐上时，每10秒恢复HP、MP500。
	Array(3010781, 20), // 马上有你, 100), // 和好朋友小马马坐在一起。坐上时，每10秒恢复HP、MP500。
	Array(3010788, 20), // 巨无霸年夜饭, 100), // 由中国玩家“小术”设计。农历除夕，在鞭炮声中围座在一起，共同辞旧迎新一起享受美味的巨无霸团圆饭。坐上时，每秒恢复HP、MP各500。
	Array(3010783, 10), // 蓝色邦尼屋, 100), // 欢迎来到邦尼快乐的家～每10秒HP恢复50，MP恢复50。
	Array(3010797, 100), // 新娘春节椅子, 100), // 和双弩精灵新娘一起迎接春节的到来。每10秒HP恢复50，MP恢复50。
	Array(3010798, 100), // 焰火椅子, 100), // 两边有焰火绽放的高级椅子。可能稍微有点危险……每10秒HP恢复50，MP恢复50。
	Array(3010800, 100), // 小学生月妙拜年椅子, 100), // 感觉好像得给钱才行，但是不仅不扣减金币，还会每10秒HP恢复50，MP恢复50。
	Array(3010801, 100), // 学龄前月妙拜年椅子, 100), // 感觉好像得给钱才行，但是不仅不扣减金币，还会每10秒HP恢复50，MP恢复50。
	Array(3010802, 100), // 中学生月妙拜年椅子, 100), // 感觉好像得给钱才行，但是不仅不扣减金币，还会每10秒HP恢复50，MP恢复50。
	Array(3010803, 100), // 高3月妙拜年椅子, 100), // 感觉好像得给钱才行，但是不仅不扣减金币，还会每10秒HP恢复50，MP恢复50。
	Array(3010804, 100), // 军人月妙拜年椅子, 100), // 到了一定的年纪，得接受军人的拜年。每10秒HP恢复50，MP恢复50。
	Array(3010810, 100), // 火车旅行椅, 100), // 坐着火车去旅行吧！坐下时，每10秒中，可恢复HP，MP各50。
	Array(3010811, 100), // 嫩芽椅, 100), // 可以感觉到春天绿色的气息。坐在嫩芽上，感受春天的情趣吧。每10秒HP恢复50，MP恢复50。
	Array(3010812, 10), // 旋转木马椅, 100), // 快乐的游乐园。坐在旋转木马上，度过快乐的时光。每10秒HP恢复50，MP恢复50。
	Array(3010814, 100), // 粉丝抱枕椅子, 100), // 粉丝抱枕椅子，坐下时，每10秒中，可恢复HP，MP各50。
	Array(3010815, 100), // 单身部队海报椅, 100), // 肉麻的炫耀只会让我们变得更强。我们是无敌的单身部队！\r\n#c每10秒HP/MP恢复50
	Array(3010835, 100), // 爱情水晶球记忆椅, 100), // 沉浸在甜蜜的爱情回忆中吧。每10秒HP恢复50，MP恢复50。\n中国冒险岛玩家[小术]设计的椅子。
	Array(3010844, 100), // 麻辣教室椅子, 100), // 我就是我，谁也不能阻拦我！坐下时，每10秒中，可恢复HP，MP各50。
	Array(3010851, 10), // 夏日沁饮椅子, 100), // 炎炎夏日，只有它才能让你清凉舒爽。坐下时，每10秒中，可恢复HP，MP各50。
	Array(3010852, 100), // 鲜花椅, 100), // 和春天盛开的美丽鲜花在一起。每10秒HP恢复50，MP恢复50。
	Array(3010854, 100), // 神秘怪物共聚一堂！, 100), // 揭开神秘面纱的怪物们和太古蘑菇一起庆祝11周年。每10秒HP恢复50，MP恢复50。
	Array(3010789, 100), // 爆竹声声, 100), // 爆竹声声迎新年！坐在上面的话，每10秒回复200点HP、200点MP
	Array(3010606, 100), // 未上色的名画椅子, 100), // 这幅空的画布，呼唤你为它涂上绚丽的色彩。坐在上面时，每10秒HP恢复10点，MP恢复10点。
	Array(3010608, 100), // 完美的名画椅子, 100), // 天啊，看看这幅杰作！这线条和这色彩，如此炫目，如此令人惊叹！坐在上面时，每10秒HP恢复50点，MP恢复50点。
	Array(1072337, 100), // 喜洋洋拖鞋, 100), // (无描述)
	Array(1112254, 100), // 豪华珍珠聊天戒指, 100), // 由中国冒险岛玩家小术设计，在海底珍珠玲珑光芒的环绕下轻松愉快的聊天吧。
	Array(1112143, 100), // 豪华珍珠名片戒指, 100), // 由中国冒险岛玩家小术设计，在海底珍珠玲珑光芒的环绕下展示自己的昵称吧。
	Array(1112118, 100), // 可乐名片戒指, 100), // 角色造型下面，以可口可乐颜色作为底色，以白色字体显示角色名称。
	Array(1112119, 100), // 可乐(Red) 名片戒指, 100), // 角色造型下面，以可口可乐颜色作为底色，以白色字体显示角色名称。
	Array(1112120, 100), // 可乐(White) 名片戒指, 100), // 角色造型下面，以可口可乐颜色作为底色，以红色字体显示角色名称。
	Array(1112228, 100), // 可乐聊天戒指, 100), // 角色对话的时候，聊天窗会变成可口可乐样子
	Array(1112229, 100), // 可乐(Red)聊天戒指, 100), // 角色对话的时候，聊天窗会变成类似可口可乐样子
	Array(1112230, 100), // 可乐(White)聊天戒指, 100), // 角色对话的时候，聊天窗会变成类似可口可乐样子
	Array(1002524, 100), // 可乐帽, 100), // (无描述)
	Array(1702533, 100), // 奶兔立拍得, 100), // 由中国玩家“小术”设计的奶兔立拍得。\n可以装备在#c所有武器#上的武器。
	Array(1702020, 100), // 棒棒糖, 100), // 可装备在#c/单手剑/单手斧/单手钝器/短杖/长杖/短刀/魔法棒/的主武器#上。
	Array(1702459, 100), // 棉花糖武器, 100), // 攻击时可以看到羊形态的棉花糖。可装备在#c所有的主武器#上。
	Array(1702302, 100), // 杯具, 100), // 可装备在#c除了/手炮/双弩枪/以外的主武器#上。
	Array(1042285, 100), // 拼色点点T恤, 100), // (无描述)
	Array(1042204, 100), // 汉堡T恤, 100), // (无描述)
	Array(1112103, 100), // 嫩黄名片戒指, 100), // 在角色的下面出来黄底黑字角色名。
	Array(1112253, 100), // 木乃伊对话框戒指, 100), // 角色对话时, 显示绷带对话框。
	Array(1112142, 100), // 木乃伊名片戒指, 100), // 在角色下面的绷带上显示角色名。
	Array(1112135, 100), // 水墨花名片戒指, 100), // 在角色脚底下，用以水墨画背景用白色的字体显示角色名字。
	Array(1112238, 100), // 水墨花聊天戒指, 100), // 角色在聊天时，会出现水墨画对话框。
	Array(4001006, 350),  //火焰羽毛
	Array(1112915, 20),  //蓝调戒指
	Array(3010678, 150),  //海加顿之安息
	Array(3010680, 150),  //童话中的宫殿
	Array(2433285, 350),  //
	Array(4033356, 300)  //正义火种
);
function init() {
    em.setProperty("state", "0");
    em.setProperty("leader", "true");
}

function setup(eim, leaderid) {
    em.setProperty("state", "1");
    em.setProperty("leader", "true");
    var eim = em.newInstance("Heros" + leaderid);

    eim.setProperty("HerosSummoned", "0");

    var map = eim.setInstanceMap(mapId);
    map.resetFully();
    var mob = em.getMonster(9500317);//怪物ID
    var stats = mob.getStats();
    stats.setHp(520000);
    stats.setPhysicalAttack(520);
    stats.setMagicAttack(520);
    stats.setAcc(520);
    stats.setExp(70000000);
    stats.setLevel(52);
    stats.setEva(1);
    eim.registerMonster(mob);
    var ostats = em.newMonsterStats();
    ostats.setOHp(520000);
    ostats.setOMp(520000);
    mob.setOverrideStats(ostats);
    map.spawnMonsterOnGroundBelow(mob, new java.awt.Point(-137, 154)); //刷出这个怪物
    eim.startEventTimer(1000 * 60 * 15);
    return eim;
}

function playerEntry(eim, player) {
    var map = eim.getMapInstance(0);
    player.changeMap(map, map.getPortal(0));
}

function playerRevive(eim, player) {
    return false;
}

function scheduledTimeout(eim) {
    end(eim);
}

function changedMap(eim, player, mapid) {
    if (mapid != 889100001) {
        eim.unregisterPlayer(player);

        if (eim.disposeIfPlayerBelow(0, 0)) {
            em.setProperty("state", "0");
            em.setProperty("leader", "true");
        }
    }
}

function playerDisconnected(eim, player) {
    return 0;
}

function monsterValue(eim, mobId) {
    return 1;
}

function playerExit(eim, player) {
    eim.unregisterPlayer(player);

    if (eim.disposeIfPlayerBelow(0, 0)) {
        em.setProperty("state", "0");
        em.setProperty("leader", "true");
    }
}

function monsterValue(eim, mobId) {
    switch (mobId) {
        case 9500319:
            for (i = 0; i < eim.getPlayers().size(); i++) {
                //eim.getPlayers().get(i).setPQLog("麦格纳斯[噩梦]");				
				eim.startEventTimer(1000 * 60 * 5);
		        eim.broadcastPlayerMsg(6, "[爱情 - 甜蜜小屋] 10秒后开启宝箱，掷点时请勿进行其他操作，并且需要在10秒钟内做出需求选择，否则将会被强制下线。");
		        var map = eim.getMapInstance(889100001);
		        map.startMapEffect("[爱情 - 甜蜜小屋] 已被通关，10秒后将开出宝箱。", 5120127);
            }
			roll(eim);
			break;
		} 
    return 1;
}

function roll(eim) {
	MaxRandom = 0;
	var count = eim.getProperty("giftcount");
	var rewardPlayer = null;
	//第二次开始,统计上一次ROLL点玩家结果，并发放奖励。
	if ((count*1)>=1) {
		for (var i = 0; i < eim.getPlayerCount(); i++) {
			var charName = eim.getPlayers().get(i).getName();
			var charId = eim.getPlayers().get(i).getId();
			//推送ROLL点信息
			for (var j = 0; j < eim.getPlayerCount(); j++) {
				var notice =  "[爱情 - 甜蜜小屋] 玩家 "+charName+" 掷出了 "+eim.getProperty("charid_"+charId)+"点";
				if ((eim.getProperty("charid_"+charId)*1)==0) {
					notice =  "[爱情 - 甜蜜小屋] 玩家 "+charName+" 放弃了掷点";
				}
				eim.getPlayers().get(j).dropMessage(6,notice);
			}
			//不断重置最大值
			if ((eim.getProperty("charid_"+charId)*1)>MaxRandom) {
				MaxRandom = eim.getProperty("charid_"+charId);
				//置换玩家名称
				eim.setProperty("rewardplayer", charName);
				//置换玩家ID
				eim.setProperty("rewardplayerid", charId);
			} 
   		}
		for (var j = 0; j < eim.getPlayerCount(); j++) {
			//操作NPC 发放奖励
			eim.getPlayers().get(j).openNpc(1052008, "huangjinroll");
		}
	}
	for (var j = 0; j < eim.getPlayerCount(); j++) {
		//重置所有玩家ROLL点点数为零
		eim.setProperty("charid_"+eim.getPlayers().get(j).getId(),"0");
	}
	//次数+1
	eim.setProperty("giftcount", (count*1+1));
	//重新读入次数
	count = eim.getProperty("giftcount");
	count = (count*1);
	//退出战场
	if ((count*1)>10) {
		EndThisBattle(eim);
		return;
	}
	//创建几率
	var chance = Math.floor(Math.random()*600);
	//最终物品列表
	var finalItemList = Array();
	for(var m=0; m<itemList.length; m++) {
		if (itemList[m][1] >= chance) {
			finalItemList.push(itemList[m][0]);
		}
	}
	var currentItem = finalItemList[Math.floor(Math.random()*finalItemList.length)];
	switch(count) {
		case 8:
		case 9:
		case 10:
			currentItem = 5062010;
		break;
	}
	eim.setProperty("rewarditem", currentItem);
	//延迟10秒打开ROLL点NPC
	setupTask = em.schedule("openRollNpc", 1000 * 5 * 1, eim);
}

function openRollNpc(eim) {
	for (var i = 0; i < eim.getPlayerCount(); i++) {
		eim.getPlayers().get(i).openNpc(9073009);
    }
	//10秒后继续ROLL点
	setupTask = em.schedule("roll", 1000 * 5 * 1, eim);
}

function EndThisBattle(eim) {
	for (var i = 0; i < eim.getPlayerCount(); i++) {
        eim.getPlayers().get(i).dropMessage(1, "[爱情 - 甜蜜小屋] 挑战成功！");
    }
	//em.broadcastYellowMsg("[米纳尔森林保卫战] 挑战结束");
    em.setProperty("state", "done");
    eim.disposeIfPlayerBelow(100, 910000000);
	if (setupTask!=null)
		setupTask.cancel(true);
	eim.dispose();
}

function end(eim) {
    var map = eim.setInstanceMap(mapId);
    if (map.getAllMonstersThreadsafe().size() != 0) {

        eim.broadcastPlayerMsg(6, "不好意思 ！ 看来你们的感情不会太长久");
    }
    eim.disposeIfPlayerBelow(100, 910000000);
    em.setProperty("state", "0");
    em.setProperty("leader", "true");
}

function clearPQ(eim) {
    end(eim);
}



function leftParty(eim, player) { }

function disbandParty(eim) { }

function playerDead(eim, player) { }

function cancelSchedule() { }